"count": 1243,
"next": "https://jobdataapi.com/api/jobs/?max_age=90&page=2&title=Marketing+Specialist",
"previous": null,
"results": [
{
"id": 5037739,
"ext_id": "743999979283123",
"company": {
"id": 12285,
"name": "Red Bull",
"logo": "https://jobdataapi.com/media/company/logo/23/11/red_bull_logo.jpeg",
"website_url": "https://www.redbull.com/",
"linkedin_url": "https://www.linkedin.com/company/red-bull/",
"twitter_handle": null,
"github_url": null
},
"title": "On Premise Marketing Specialist",
"location": "Fuschl, Austria",
"types": [
{
"id": 1,
"name": "Full Time"
}
],
"cities": [],
"countries": [
{
"code": "AT",
"name": "Austria",
"region": {
"id": 3,
"name": "Europe"
}
}
],
"regions": [
{
"id": 3,
"name": "Europe"
}
],
"has_remote": false,
"published": "2024-04-09T05:59:05.719000Z",
"description": "<h3>Unternehmensbeschreibung</h3><p><strong>Als On Premise Marketing Specialist bewegst du dich in einem der dynamischsten und emotionalsten Sektoren unserer Wirtschaft – die Spielwiese der Gastronomie und Events in Österreich ist die Basis des langjährigen und ständig wachsenden Erfolgs von Red Bull Österreich. Emotionen, große Momente und immer neue Trends machen deine Position zu einer diversen Marketingrolle.</strong></p><p>Produkte und Marken des Beverage Business von Red Bull werden von dir an die unterschiedlichen Kanäle, an Konsumenten und Industrie kommuniziert und konzeptuell verpackt. Durch die starke Dynamik am Markt, die Freude an Veränderungen und das Verknüpfen eines riesigen Netzwerks, das sich im Gastronomie-Universum bewegt, ist Flexibilität und Anpassungsfähigkeit grundlegend. Ausreichend Lebensfreude und unvergessliche Momente inklusive.</p><p> </p><h3>Stellenbeschreibung</h3><p><strong>Consumer Marketing – eine Mischung aus Brand &amp; Produkt Marketing</strong></p><p>Marketing Konzepte aus unserem internationalen Headquarter werden von dir umgesetzt und adaptiert.</p><p>Du erkennst Consumer Trends &amp; hast die Fähigkeit diese in Ideen und Konzepte im Lifestyle von Red Bull zu verpacken, um den passenden Auftritt am Point of Sale zu gewährleisten.</p><p>Die Ausführung von messbaren und schlagkräftigen Initiativen, um neue Konsumenten zu gewinnen, Konsum-Gewohnheiten zu schaffen und die Marken von Red Bull in den unterschiedlichen Kanälen und Genres richtig aufzubauen liegt auch in deinem Aufgabenbereich.</p><p> </p><p><strong>Key Account Marketing</strong></p><p>Der jährlich wachsende Bereich des Key Account Business im globalen, wie im lokalen Markt fordert intensive Zusammenarbeit mit den größten Protagonisten aus LSR, Catering, Hotellerie und vielen anderen Bereichen der Gastronomie.</p><p>Du bist für große Projekte mit bekannten Marken aus diesen Sektoren verantwortlich und arbeitest hier eng mit unseren Key Account Managern zusammen.</p><p>Klassische Verkaufsaktivierungen die sich jährlich wiederholen, mischen sich in diesem Bereich mit maßgeschneiderten Lösungen, die die Welt von Red Bull mit den Vorgaben unserer Partner in Einklang bringen, um win-win Situationen zu schaffen.</p><p> </p><p><strong>Industry Marketing</strong></p><p>Die Zielsetzung im Industry Marketing ist der Aufbau von Beziehungen zu den unterschiedlichen Partnern, um die #1 Marke für alle Beteiligten darzustellen.</p><p>Du bist ständig mit wichtigen Entscheidern und Meinungsbildnern im Austausch, um immer am neuesten Stand des Geschehens zu sein, Needs sofort zu erkennen und zu unserem Vorteil zu verarbeiten.</p><p>Du bist für Einladungen und Events verantwortlich.</p><p>Du konzipierst und setzt Ideen zur Bindung an Produkt und Marke sowie direkt bei Accounts und Partnern um und dies speziell im Bereich von Einzel- und Sonderanfertigungen.</p><p> </p><p><strong>Administration und Market Research</strong></p><p>Analyse und Aufbereitung von Research Daten aus dem österreichischen Gastronomie-Universum, internen Daten, allgemeinen Umfragen und globalen Trendstudien.</p><p>Administrative Tätigkeiten und Pflege unterschiedlicher interner Systeme.</p><h3>Qualifikationen</h3><ul><li>2+ Jahre Erfahrung im Marketingbereich.</li><li>Idealerweise vertieftes Wissen oder Arbeitserfahrung aus dem Gastronomie-Umfeld und den Protagonisten in diesem Bereich.</li><li>Ausgezeichnete Englisch Kenntnisse in Wort und Schrift.</li><li>Verständnis von Verkauf und Maßnahmen diesen zu fördern.</li><li>Analytische Fähigkeiten, Planungs- und Projektmanagement-Skills.</li><li>Offenes und sicheres Auftreten bei Präsentationen und Verhandlungen.</li><li>Schnelle Auffassungsgabe, hohe Entscheidungsfreude und Durchsetzungsvermögen.</li><li>Interesse an Lifestyle, Innovationen, Kultur und Stil.</li><li>Kreativität und Passion für die Marke Red Bull und deren Produkte.</li></ul><h3>Zusätzliche Informationen</h3><p>Aus gesetzlichen Gründen sind wir verpflichtet darauf hinzuweisen, dass das kollektivvertragliche Mindestgehalt für diese Position bei monatlich EUR 2.229 brutto liegt. Unsere attraktiven Gehaltspakete orientieren sich jedoch an aktuellen Marktgehältern und liegen daher deutlich über dem angegebenen Mindestgehalt.</p><p>Als Arbeitgeber schätzen wir Diversität und unterstützen Menschen ihre Potenziale und Stärken zu entfalten, ihre Ideen zu verwirklichen und Chancen zu ergreifen. Passioniert glauben wir daran, dass Diversität unter Kollegen ein zentrales Element unseres Erfolgs ist. Wir begrüßen Bewerbungen aller Menschen gleichermaßen, unabhängig von Alter, Hautfarbe, Religion, Geschlecht, sexueller Orientierung oder Herkunft.</p>",
"experience_level": null,
"application_url": "https://jobs.smartrecruiters.com/RedBull/743999979283123-on-premise-marketing-specialist",
"language": "de",
"clearance_required": false,
"salary_min": null,
"salary_max": null,
"salary_currency": null
},
{
"id": 5040834,
"ext_id": "743999979281203",
"company": {
"id": 4046,
"name": "Believe",
"logo": "https://jobdataapi.com/media/company/logo/22/10/xFef09P__400x400.jpg",
"website_url": "https://www.believe.com",
"linkedin_url": "https://www.linkedin.com/company/believeglobal/",
"twitter_handle": "Believe",
"github_url": null
},
"title": "CRM Marketing Specialist (Salesforce Administrator)",
"location": "Mumbai, India",
"types": [
{
"id": 1,
"name": "Full Time"
}
],
"cities": [
{
"geonameid": 1275339,
"asciiname": "Mumbai",
"name": "Mumbai",
"country": {
"code": "IN",
"name": "India",
"region": {
"id": 2,
"name": "Asia/Pacific"
}
},
"timezone": "Asia/Kolkata",
"latitude": "19.07283",
"longitude": "72.88261"
}
],
"countries": [
{
"code": "IN",
"name": "India",
"region": {
"id": 2,
"name": "Asia/Pacific"
}
}
],
"regions": [
{
"id": 2,
"name": "Asia/Pacific"
}
],
"has_remote": false,
"published": "2024-04-09T05:30:27.917000Z",
"description": "<h3>Company Description</h3><p>Believe is one of the world’s leading digital music companies. Believe’s mission is to develop local artists and labels in the digital ecosystem by providing them the solutions they need to grow their audience at each stage of their career and development.  </p><p>Its 1,919 employees in more than 50 countries aim to support local artists and labels with a unique digital expertise, respect, fairness, and transparency.  </p><p>To support our fast-growing presence on all continents, we are constantly looking for new Believers to join us and make a stronger and more positive impact on the music industry! </p><p>Believe is listed on compartment A of the regulated market of Euronext Paris (Ticker: BLV, ISIN: FR0014003FE9). </p><p><a href=\"http://www.believe.com/\">www.believe.com</a> </p><p>Ready to <strong>#setthetone</strong> with Believe? </p><h3>Job Description</h3><p>To support our growth and the increased use of the Salesforce suite, we are seeking an administrator to share in the daily management and drive future developments.</p><p>From basic tasks to complex processes and integrations, Salesforce is the central tool for Believe's sales teams with nearly 500 daily users. Salesforce.com Products: Sales Cloud &amp; Pardot.</p><p><strong>Here's what your day will look like</strong>:</p><ul><li>By joining the Intranet and Salesforce team, you will perform the following missions:</li><li>Contribute to defining Salesforce's trajectory within Believe.</li><li>Configure Salesforce (roles, profiles, permissions, security).</li><li>Maintain and create new processes, flows, validation rules, etc., to help automate operations as needed.</li><li>Develop and maintain connections with third-party systems (Internal ERP, CLM solution, institutional website, Power BI, etc.).</li><li>Create and maintain technical documentation associated with the configurations made.</li><li>Ensure data quality in Salesforce: manage duplicates, improve field completion rates, measure usage.</li><li>Create reports and data visualizations based on team and user needs.</li><li>Provide support to users and assist with all daily needs of sales teams on Salesforce.</li></ul><p><strong>Key Attributes:</strong></p><ul><li>At Believe, our motto is simple: open-mindedness, passion, and commitment!</li><li>We will also appreciate your agility, innovation, excellent interpersonal skills, and enthusiasm!</li><li>If you recognize yourself and have at least 3 years of experience in equivalent positions, don't hesitate; this position is for you!</li><li>You are proactive in integrating a business approach and results oriented.</li><li>You have a strong knowledge of Salesforce configuration and a deep understanding of Salesforce's standard capabilities.</li><li>Certification as an \"Administrator\" or equivalent would be a plus.</li><li>You are familiar with SCRUM &amp; Agile methodologies.</li><li>You have previous experience in API integration and maintenance.</li><li>You demonstrate rigor, analytical, and synthesis skills.</li><li>You have good interpersonal skills and adaptability.</li><li>Your English proficiency is fluent, both oral and written.</li></ul><p><strong>Apply</strong>: Interested applicants can email their resumes at <a href=\"mailto:chandani.veera@believe.com\">chandani.veera@believe.com</a> or reach out to us at +91 9987373636.</p><h3>Qualifications</h3><p>Graduate / Postgraduate in Science or Engineering</p><h3>Additional Information</h3><p><strong>Benefits @Believe:</strong></p><p><strong>#Flexibility - </strong>Just punch in leaves, not intime and out time</p><p><strong>#Office perks - </strong>a game of foosball, table tennis to bat the afternoon lackluster, free event pass for exclusive and limited shows, music subscription, etc</p><p><strong>#Wellbeing - </strong>Caring by EUTELMED, professionals are at your disposal for advice and support, in your own language and culture</p><p><strong>#Transperancy – </strong>engaged in secondary activity just disclose it to us</p><p><strong>#Compensation – </strong>Tailor made flexi pay plan for tax saving</p><p><strong>#Sustainability -</strong> You can be a part of CSR program, represent yourself as a #shaper and contribute to a better future.</p><p><strong>Additional information:</strong></p><p>Believe strongly promotes equal treatment regardless of race, ethnicity, nationality, gender, sexual orientation, socio-economic status, age, marital or civil partner status, pregnancy or maternity, physical abilities, religious beliefs, political beliefs, or other ideologies</p>",
"experience_level": "MI",
"application_url": "https://jobs.smartrecruiters.com/Believe/743999979281203-crm-marketing-specialist-salesforce-administrator-",
"language": "en",
"clearance_required": false,
"salary_min": null,
"salary_max": null,
"salary_currency": null
},
{
"id": 5035763,
"ext_id": "A4214B1111",
"company": {
"id": 11420,
"name": "BSA Solutions",
"logo": "https://jobdataapi.com/media/company/logo/23/11/bsa_solutions_careers_logo.jpeg",
"website_url": "https://bsa-solutions.com/",
"linkedin_url": "https://www.linkedin.com/company/bsa-solutions-inc/",
"twitter_handle": null,
"github_url": null
},
"title": "Digital Marketing Specialist",
"location": "Cebu City, Cebu, Philippines",
"types": [
{
"id": 1,
"name": "Full Time"
}
],
"cities": [
{
"geonameid": 1717512,
"asciiname": "Cebu City",
"name": "Cebu City",
"country": {
"code": "PH",
"name": "Philippines",
"region": {
"id": 2,
"name": "Asia/Pacific"
}
},
"timezone": "Asia/Manila",
"latitude": "10.31672",
"longitude": "123.89071"
}
],
"countries": [
{
"code": "PH",
"name": "Philippines",
"region": {
"id": 2,
"name": "Asia/Pacific"
}
}
],
"regions": [
{
"id": 2,
"name": "Asia/Pacific"
}
],
"has_remote": false,
"published": "2024-04-09T00:00:00Z",
"description": "<p><strong>ABOUT US</strong></p><p>BSA Solutions offers talent outsourcing services to small and medium-sized businesses. We provide access to highly skilled professionals, enabling global businesses to build their dream teams in the Philippines and Malaysia. Our vision is to create a community of successful companies where talented individuals can meet and collaborate. We encourage our talents to push their limits, embrace their potential, and passionately pursue greatness. We pride ourselves on delivering exceptional results to our clients through our personalized service and our in-depth knowledge of the markets we serve. </p><p></p><p><strong>HEADLINE</strong></p><p>Are you talented and dynamic with passion for cutting-edge AI technology? Do you have experience in promoting software technology? If so, we have an exciting opportunity for you to join our client, driving no-code digital transformation.</p><p>We are seeking a <strong>DIGITAL MARKETING SPECIALIST </strong>to be part of a groundbreaking company in the software industry from Amsterdam, The Netherlands, committed to transforming how software is created. Their projects span across enterprise, government, and various industrial sectors.  </p><p>What’s in it for you: </p><ul> <li>The opportunity to help drive the AI revolution. </li> <li>Work on cutting-edge technology and be part of a collaborative and forward-thinking team. </li> <li>Competitive compensation, excellent benefits. </li> <li>Personalised development program &amp; performance bonus. </li> <li>Being part of an international team of smart and passionate colleagues. </li> </ul><p></p><p>This is a FULL-TIME role, MONDAY TO FRIDAY. </p><p>This is an office-based position in central Cebu City. </p><p>The expected start date is April 2024. </p><p></p><p><strong>ABOUT THE ROLE</strong></p><p>As a <strong>DIGITAL MARKETING SPECIALIST</strong>, your role is to implement effective marketing strategies that enhance our online presence, engage our target audience, and drive business growth through lead generation. The ideal candidate will have a good understanding of digital marketing tools and trends, web design, SEO and create compelling content and campaigns. You will collaborate closely with cross-functional teams, including product management, sales, and research and development, to drive brand awareness, generate leads, and support the overall growth of the business. </p><p></p><p><strong>RESPONSIBILITIES</strong></p><ul> <li>Develop and execute an online marketing strategy, including website content and structure, SEO, email and newsletter marketing, social media, and blog. </li> <li>Analyse the online trends and customer insights to identify growth opportunities in our online marketing efforts. </li> </ul><ul> <li>Create engaging content that highlights our platform, projects, customer success and services in our sector. </li> <li>Manage and optimise our website and social media (LinkedIn, blogs) presence to increase visibility, engagement, and lead generation. </li> <li>Monitor and report on the performance of online marketing campaigns. </li> <li>Collaborate with our management to ensure alignment between marketing initiatives and business goals. </li> </ul><p><strong>Requirements</strong></p><ul> <li>Bachelor's degree in marketing, business, or related field </li> <li>At least 3 years of experience in online marketing. </li> <li>Relevant experience in the software industry will have an advantage. </li> <li>Knowledge and experience in digital marketing tools and platforms e.g., Google Analytics, AdWords, SEO tools, social media management software. </li> <li>Good content creation and writing skills, with the ability to produce great marketing materials. </li> <li>Creative thinker with strong problem-solving abilities and attention to detail. </li> <li>Self-motivated, with the ability to work both independently and as part of a team. </li> <li>Excellent communication and interpersonal skills. </li> <li>Strong project management skills and attention to detail. </li> </ul><p><strong>Benefits</strong></p><p>BSA Solutions, Inc. emphasizes in: </p><ul> <li>Providing you with competitive compensation and benefits that exceed market standards and the Labor Law. </li> <li>Ensuring your health and well-being with a comprehensive and generous HMO benefits package for you and one dependent from the start date, a 24/7 employee assistance program, mental health assistance with licensed practitioners, and in-house fitness and wellness programs. </li> <li>Encouraging you to take ownership of your choices and be accountable for your personal growth, happiness, and success. </li> </ul><ul> <li>Challenging your status quo, pushing your boundaries for you to embrace your potential and pursue greatness. </li> <li>Building supportive and inclusive communities that inspire and uplift each other, fostering a sense of belonging and connection among its employees and the wider local communities. </li> <li>Encouraging you to be authentic, be true to yourself, embrace your uniqueness, and live a fulfilling and purpose-driven life. </li> <li>Promoting a growth mindset and a commitment to lifelong learning and encouraging you to seek knowledge, explore new experiences, and embrace challenges as opportunities for personal and professional development. </li> <li>Encouraging you to appreciate each moment and find balance in your lives, being fully present in the moment, cultivating mindfulness, and finding joy in the present. </li> <li>Encouraging you to set clear intentions, align your actions with your values, and make conscious choices that contribute to your overall well-being and happiness. </li> </ul><p> </p><p>Join us and connect and collaborate with bright minds. Be part of a culture of equity, diversity, and inclusion, where you can showcase your unique talents and expertise to create successful outcomes for you, the client, and the company. All qualified applicants will receive consideration for employment without regard to gender, gender identity/orientation, race, colour, religion, origin, or other characteristics.  </p>",
"experience_level": "MI",
"application_url": "https://apply.workable.com/j/A4214B1111/apply",
"language": "en",
"clearance_required": false,
"salary_min": null,
"salary_max": null,
"salary_currency": null
},
{
"id": 5060730,
"ext_id": "JR245292",
"company": {
"id": 11453,
"name": "Salesforce",
"logo": "https://jobdataapi.com/media/company/logo/23/10/salesforce_logo.jpeg",
"website_url": "https://www.salesforce.com/",
"linkedin_url": "https://www.linkedin.com/company/salesforce",
"twitter_handle": "salesforcejobs",
"github_url": "https://github.com/salesforce"
},
"title": "Partner Marketing Specialist (France)",
"location": "France - Paris",
"types": [
{
"id": 1,
"name": "Full Time"
}
],
"cities": [
{
"geonameid": 2988507,
"asciiname": "Paris",
"name": "Paris",
"country": {
"code": "FR",
"name": "France",
"region": {
"id": 3,
"name": "Europe"
}
},
"timezone": "Europe/Paris",
"latitude": "48.85341",
"longitude": "2.34880"
}
],
"countries": [
{
"code": "FR",
"name": "France",
"region": {
"id": 3,
"name": "Europe"
}
}
],
"regions": [
{
"id": 3,
"name": "Europe"
}
],
"has_remote": false,
"published": "2024-04-09T00:00:00Z",
"description": "<p>To get the best candidate experience, please consider applying for a maximum of 3 roles within 12 months to ensure you are not duplicating efforts.</p><p></p><p>Job Category</p>Marketing &amp; Communications<p></p><p>Job Details</p><p></p><p>About Salesforce</p><p>We’re Salesforce, the Customer Company, inspiring the future of business with AI+ Data +CRM. Leading with our core values, we help companies across every industry blaze new trails and connect with customers in a whole new way. And, we empower you to be a Trailblazer, too — driving your performance and career growth, charting new paths, and improving the state of the world. If you believe in business as the greatest platform for change and in companies doing well and doing good – you’ve come to the right place.</p><p></p><p></p><p>International A&amp;C Partner Marketing Team Description:<br/>The International Partner Marketing team epitomizes Salesforce’s creativity, collaboration, and core values, demonstrated through our relationships with consulting system integrators, agencies, and resellers, while driving high-value marketing strategies with top partners. <br/><br/>Our distributed team brings outstanding perspective and expertise to our roles, and we share a common curiosity and desire to constantly improve our partners’ experience with Salesforce. You'll join a team that is passionate about driving focused partner marketing programs that win hearts and minds and fuel growth, trust, inspiration, and success for our partners and customers.<br/><br/>Job Summary<br/><br/>The Salesforce International A&amp;C Partner Marketing team drives communications and marketing in support of the Salesforce Partner Ecosystem. Our team is passionate about Partner success and operates with an entrepreneurial attitude in a fast-paced setting. We work with stakeholders globally both within Salesforce as well as with our greater Salesforce ecosystem.<br/><br/>We are searching for a Partner Marketing Specialist to orchestrate the strategy and direction for establishing and coordinating a comprehensive marketing integrated programme in the region, dedicated to supporting Salesforce Consulting in growing their Salesforce practice.<br/><br/>The ideal Partner Marketing Specialist should possess strong critical thinking, excel in partner enablement, and foster collaboration with partners. A solid understanding of marketing principles is essential for effective campaigns, while analytical skills are vital for measuring initiatives' efficiency. Effective communication, project management abilities, and a results-oriented approach are also crucial for success in this role.<br/><br/>Responsibilities:</p><ul><li>Work with a selected group of consulting partners and/or agencies to help them develop and implement quarterly partner-led demand generation activities to drive growth in revenue from Salesforce solutions in France.</li><li>Act as the primary marketing contact for these partners including regular participation in team calls, in-person/virtual meetings and planning sessions.</li><li>Be responsible for educating partners in the region on Salesforce marketing tools, benefits, and resources available to them.</li><li>Raise purchase orders for co-marketing activities and own the follow-up process.</li><li>Be accountable for the delivery of relevant marketing KPIs</li><li>Drive alignment across different Salesforce marketing teams to advocate for and bring awareness of Consulting Partners for inclusion in Salesforce marketing programs.</li><li>Be a member of the A&amp;C French extended team aligning the partner marketing motions to the regional business strategy</li></ul><p>Required Skills &amp; Experience:</p><ul><li>2+ year experience in marketing with an emphasis in B2B technology campaigns, product, and/or partner marketing.</li><li>Experience with building campaigns</li><li>Demonstrated experience managing through ambiguity and driving results.</li><li>Metrics-driven marketing mind and familiarity with marketing analytics platforms.</li><li>Highly diligent with strong project management and organisational skills.</li><li>Proficiency with digital marketing concepts and best practices.</li><li>Excellent written and verbal communication skills in English and French and the ability to work with multiple teams across the organisation to ensure world class execution</li><li>Experience working with creative teammates, ad agencies, and other vendors.</li><li>Experience using Salesforce is highly desirable.</li></ul><p><br/> </p><p></p><p>Accommodations</p><p>If you require assistance due to a disability applying for open positions please submit a request via this <a href=\"https://careers.mail.salesforce.com/accommodations-request-form\" rel=\"noopener noreferrer\" target=\"_blank\">Accommodations Request Form</a>.</p><p></p><p></p><p>Posting Statement</p><p>At Salesforce we believe that the business of business is to improve the state of our world. Each of us has a responsibility to drive Equality in our communities and workplaces. We are committed to creating a workforce that reflects society through inclusive programs and initiatives such as equal pay, employee resource groups, inclusive benefits, and more. Learn more about Equality at <a href=\"http://www.equality.com\" rel=\"noopener noreferrer\" target=\"_blank\"><u>www.equality.com</u></a> and explore our company benefits at <a href=\"http://www.salesforcebenefits.com\" rel=\"noopener noreferrer\" target=\"_blank\"><u>www.salesforcebenefits.com</u></a>.</p><p></p><p><a href=\"https://salesforce.com\" rel=\"noopener noreferrer\" target=\"_blank\"><u>Salesforce</u></a> is an Equal Employment Opportunity and Affirmative Action Employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status.<a href=\"https://salesforce.com\" rel=\"noopener noreferrer\" target=\"_blank\"> <u>Salesforce</u></a> does not accept unsolicited headhunter and agency resumes.<a href=\"https://salesforce.com\" rel=\"noopener noreferrer\" target=\"_blank\"> <u>Salesforce</u></a> will not pay any third-party agency or company that does not have a signed agreement with<a href=\"https://salesforce.com\" rel=\"noopener noreferrer\" target=\"_blank\"> <u>Salesforce</u></a>.</p><p></p><p>﻿Salesforce welcomes all.</p><p></p><p></p><p></p><h3></h3><h3></h3><h3></h3><h3></h3><h3></h3><h3></h3><h3></h3><h3></h3><p></p><p></p><p></p><p></p>",
"experience_level": null,
"application_url": "https://salesforce.wd12.myworkdayjobs.com/en-US/External_Career_Site/job/France---Paris/Partner-Marketing-Specialist--France-_JR245292",
"language": "en",
"clearance_required": false,
"salary_min": null,
"salary_max": null,
"salary_currency": null
},
{
"id": 5038171,
"ext_id": "743999979184094",
"company": {
"id": 3827,
"name": "Informa Group Plc.",
"logo": "https://jobdataapi.com/media/company/logo/22/10/AU1W13oq_400x400.png",
"website_url": "https://www.informa.com",
"linkedin_url": "https://www.linkedin.com/company/informa",
"twitter_handle": "informaplc",
"github_url": null
},
"title": "Marketing Specialist",
"location": "Toronto, ON, Canada",
"types": [
{
"id": 1,
"name": "Full Time"
}
],
"cities": [
{
"geonameid": 6167865,
"asciiname": "Toronto",
"name": "Toronto",
"country": {
"code": "CA",
"name": "Canada",
"region": {
"id": 5,
"name": "North America"
}
},
"timezone": "America/Toronto",
"latitude": "43.70011",
"longitude": "-79.41630"
}
],
"countries": [
{
"code": "CA",
"name": "Canada",
"region": {
"id": 5,
"name": "North America"
}
}
],
"regions": [
{
"id": 5,
"name": "North America"
}
],
"has_remote": false,
"published": "2024-04-08T16:53:13.794000Z",
"description": "<h3>Company Description</h3><p>We’re part of Informa, a global business with a network of trusted brands in specialist markets across more than 30 countries, and a member of the FTSE 100.</p><p>Our purpose is to connect our customers to information and people that help them know more, do more and be more. No other company in the world helps more people share professional knowledge or make business connections.</p><p>We run around 800 events each year, create digital platforms based on engaging news and information content, and operate professional development programmes for individuals and businesses.</p><p>Informa Corporate Videos Life at Informa <a href=\"https://vimeo.com/818874158\">https://vimeo.com/818874158</a></p><p>Informa overview <a href=\"https://vimeo.com/806052607\">https://vimeo.com/806052607</a></p><p>Diversity &amp; Inclusion at Informa <a href=\"https://vimeo.com/786679923\">https://vimeo.com/786679923</a></p><p>Colleague networks <a href=\"https://vimeo.com/786687436\">https://vimeo.com/786687436</a></p><p>Walk the World <a href=\"https://vimeo.com/837933822\">https://vimeo.com/837933822</a></p><p>GAP 2 <a href=\"https://vimeo.com/806058954\">https://vimeo.com/806058954</a></p><h3>Job Description</h3><p>The Marketing Specialist will be responsible for executing marketing campaigns to grow the target audience and/or client databases, drive consent to market, and encourage target prospects to engage with relevant Informa content. The specialist will develop and deliver a wide range of multi-channel marketing activities. The Marketing Specialist also drives community engagement, increasing community membership, web traffic, and conversions.</p><p>The key objective of the role is to help execute marketing campaigns that result in target prospects engaging with our brands/products/services and gaining hard traction. This role will primarily focus on managing marketing tactics for the One Of A Kind Show.</p><p> </p><p><strong><em>Responsibilities</em></strong></p><p> </p><ul><li>Partner with colleagues and external agencies to define marketing tactics along the customer journey, build brand awareness and consideration, and drive the acquisition of new audiences.</li><li>Partner with external and internal resources to develop and execute community and engagement content including an impactful content calendar executed through various media (eg roundtable events; webinars; op-eds; news insights).</li><li>Establish automated email streams in Adestra across all consumer events and work with show teams to establish nurturing streams.</li><li>Write, design and set up/launch prospect and customer engagement e-mail marketing activities using Eloqua or Adestra email tool.</li></ul><ul><li>Manage social platforms calendars on Sprinklr and pull reports to suggest improvements.</li><li>Manage marketing lists and follow database best practices.</li><li>Recommend social media tactics aligned to brand strategy, write and schedule all planned social posts.</li><li>Manage online communities on META, Pinterest, TikTok etc.</li></ul><ul><li>Manage website updates via Core/AEM tool (ongoing updates and uploads).</li><li>Work with external agencies and partners to develop campaign creative work and produce event signage and advertising.</li><li>Ensure that all market-facing materials are on brand according to brand guidelines.</li><li>Maximize usage of Informa systems and processes, adopting a best practice and facilitating developments in line with internal and external requirements.</li><li>Be accountable for the allocated budget.</li><li>Be present at select shows in person to support show execution.</li></ul><h3>Qualifications</h3><ul><li>Demonstrable experience in Campaign Management, executing a strategy that raises awareness, generates interest and desire, and solicits action.</li><li>2+ years of application of marketing digital metrics in day-to-day work.</li><li>2+ years of experience in e-mail marketing. Experience designing email marketing campaign automated flows, lead nurturing streams, managing lists.</li><li>Proven ability to write content for social media/web pages– samples will be requested.</li><li>Graphic design and video editing skills for social media reels, carousels and other posts– samples will be requested.</li><li>Understanding of design and marketing/advertising creative principles – ability to judge quality of creative ad design.</li><li>Community management background / driving organic social media engagement.</li><li>Content marketing experience: art of using relevant, engaging content to attract and nurture prospects through the buyer journey.</li><li>Strong relationship management and ability to nurture relationships with community members as well as collaborate across teams internally.</li><li>Can demonstrate an entrepreneurial collaborative approach, bringing fresh and exciting ideas for marketing growth campaigns or new content/community initiatives.</li><li>Prior experience in working cross functionally and being able to synthesize feedback in a concise and informative manner.</li><li>Prior experience of coordinating projects, ability to prioritize and manage time efficiently.</li><li>2+ years Practical experience of collateral production and design.</li><li>Previous experience or training with CORE/AEM, Adestra/Eloqua, InFront.</li><li>Experience with promoting events and digital activities that generate engagement.</li></ul><h3>Additional Information</h3><p>Employee experience is very important to us at Informa. On top of joining a supportive, diverse and ambitious team that welcomes all types of candidates. We are also flexible with different working patterns and prioritizes promotions internally. Our benefits include:</p><ul><li>Learning and development plan to assist with your career development  </li><li>10 days PTO plus 4 days for volunteering and a day off for your birthday!  </li><li>Competitive Benefits </li><li>Paid parental leave </li><li>Work with a high quality of specialist products and service  </li><li>Bright and friendly staff who are all “expert’s experts” and additional training and development for helping you achieve your career aspiration  </li></ul><p> </p><p>We know that sometimes the 'perfect candidate' doesn't exist, and that people can be put off applying for a job if they don't fit all the requirements. If you're excited about working for us and have most of the skills or experience we're looking for, please go ahead and apply. You could be just what we need! We believe strongly in the value of diversity and creating supportive, inclusive environments where our colleagues can succeed.  As such, Informa is proud to be an Equal Opportunity Employer.  We do not discriminate on the basis of race, color, ancestry, national origin, religion, or religious creed, mental or physical disability, medical condition, genetic information, sex (including pregnancy, childbirth, and related medical conditions), sexual orientation, gender identity, gender expression, age, marital status, military or veteran status, citizenship, or other protected characteristics under federal, state or local law. </p><p> </p>",
"experience_level": "MI",
"application_url": "https://jobs.smartrecruiters.com/InformaGroupPlc/743999979184094-marketing-specialist",
"language": "en",
"clearance_required": false,
"salary_min": null,
"salary_max": null,
"salary_currency": null
},
{
"id": 5037758,
"ext_id": "743999979157108",
"company": {
"id": 12285,
"name": "Red Bull",
"logo": "https://jobdataapi.com/media/company/logo/23/11/red_bull_logo.jpeg",
"website_url": "https://www.redbull.com/",
"linkedin_url": "https://www.linkedin.com/company/red-bull/",
"twitter_handle": null,
"github_url": null
},
"title": "Trade Marketing Specialist",
"location": "Oslo, Norway",
"types": [
{
"id": 1,
"name": "Full Time"
}
],
"cities": [
{
"geonameid": 3143244,
"asciiname": "Oslo",
"name": "Oslo",
"country": {
"code": "NO",
"name": "Norway",
"region": {
"id": 3,
"name": "Europe"
}
},
"timezone": "Europe/Oslo",
"latitude": "59.91273",
"longitude": "10.74609"
}
],
"countries": [
{
"code": "NO",
"name": "Norway",
"region": {
"id": 3,
"name": "Europe"
}
}
],
"regions": [
{
"id": 3,
"name": "Europe"
}
],
"has_remote": false,
"published": "2024-04-08T15:11:57.420000Z",
"description": "<h3>Selskapsbeskrivelse</h3><p><strong>Vil du jobbe med shopper marketing i en av verdens sterkeste merkevarer? </strong></p><p> </p><p>I Red Bull jobber vi for å gi vinger til mennesker og ideer. Vi investerer i våre ansatte og gir de muligheter som inspirerer og utfordrer de til å vokse og utvikle seg i sine karrierer. Høres det ut som en arbeidsplass for deg må du fortsette å lese …</p><p> </p><p>Red Bull Norge omsetter for omtrentlig 750 MNOK og fortsetter å vokse i rekordfart. Som vår nye Trade Marketing Specialist vil du ha en viktig rolle i vår salgsavdeling for å bidra til at vi fortsetter suksessen og tilrettelegger for fremtidig vekst. Dine hovedoppgaver vil være utforming og koordinering av trade/shopper marketing aktiviteter med kunde, i tett samarbeid med salg- og markedsavdelingen. Du vil være ansvarlig for å lage aktiviseringsplaner, utvikle butikkmateriell og følge opp effekten av disse.</p><h3>Jobbeskrivelse</h3><p><strong>SHOPPER MARKETING</strong></p><p>Ansvarlig for å utvikle en tydelig plan for innsalg- og gjennomføring av aktiviseringer (for eksempel aktiviteter i butikk)</p><p>Kontinuerlig holde deg oppdatert på shopper- og kategoritrender</p><p>Drive konseptutvikling basert på shopper- og forbrukerinnsikt</p><p>Foreta analyser ved hjelp av ulike data- og innsiktskilder og formidle denne innsikten videre</p><p><strong>SAMARBEIDSPARTNER</strong></p><p>Ansvarlig for kommunikasjon med byråer og eksterne samarbeidspartnere for utvikling av lokalt og kundespesifikt butikkmateriell</p><p>Jobbe tett med resten av avdelingen og markedsavdelingen for å sikre samkjørte planer</p><p>Lede dialog og holde aktuelle kurs for salgsteamet</p><h3>Kvalifikasjoner</h3><p>Relevant høyere utdanning, minimum bachelor</p><p>Fordel med bransjeerfaring fra FMCG, gjerne innen dagligvare og/eller servicehandel</p><p>Svært gode egenskaper innen Microsoft Office. Har du også erfaring innen InDesign er det et pluss</p><p>God på å behandle komplekse data, trekke ut essensen og kommunisere funnene</p><p>Komfortabel med å utvikle presentasjoner og formidle budskapet på en overbevisende måte</p><p>Kjennskap til og erfaring med relevante analyseverktøy som for eksempel NielsenIQ er en fordel</p><p>Snakker og skriver flytende norsk og engelsk</p><p>Det viktigste for at du skal trives og lykkes i denne stillingen er at du må være glad i å jobbe med konseptutvikling, og at du evner å håndtere flere prosjekter/arbeidsoppgaver samtidig. Vi ser for oss at du kommer inn med mye nysgjerrighet, du er ikke redd for å tenke utenfor boksen og ser muligheter der kanskje andre ser hindre. Dette vil være en jobb som krever selvstendighet, men du vil også være en del av et team som jobber på tvers av organisasjonen.</p><h3>Ytterligere informasjon</h3><p>Red Bull Norway AS er en arbeidsgiver som fremmer mangfold. Vi har sterk tro på at en mangfoldig arbeidsstyrke er en viktig faktor for suksess. Vi gjør ansettelser basert på den enkeltes erfaring og ferdigheter uavhengig av alder, kjønn, funksjonsevne, seksuell legning, etnisitet og religion. </p>",
"experience_level": "EN",
"application_url": "https://jobs.smartrecruiters.com/RedBull/743999979157108-trade-marketing-specialist",
"language": "no",
"clearance_required": false,
"salary_min": null,
"salary_max": null,
"salary_currency": null
},
{
"id": 5039620,
"ext_id": "743999979100533",
"company": {
"id": 4080,
"name": "IFS",
"logo": "https://jobdataapi.com/media/company/logo/22/10/ifs.jpg",
"website_url": "https://www.ifs.com/",
"linkedin_url": "https://www.linkedin.com/company/ifs",
"twitter_handle": "ifs",
"github_url": null
},
"title": "Business Intelligence (BI) Marketing Specialist",
"location": "Staines-upon-Thames, United Kingdom",
"types": [
{
"id": 1,
"name": "Full Time"
}
],
"cities": [
{
"geonameid": 2637126,
"asciiname": "Staines",
"name": "Staines",
"country": {
"code": "GB",
"name": "United Kingdom",
"region": {
"id": 3,
"name": "Europe"
}
},
"timezone": "Europe/London",
"latitude": "51.43092",
"longitude": "-0.50606"
}
],
"countries": [
{
"code": "GB",
"name": "United Kingdom",
"region": {
"id": 3,
"name": "Europe"
}
}
],
"regions": [
{
"id": 3,
"name": "Europe"
}
],
"has_remote": false,
"published": "2024-04-08T11:24:15.225000Z",
"description": "<h3>Company Description</h3><p>IFS is a billion-dollar revenue company with 6000+ employees on all continents. We deliver award winning enterprise software solutions through the use of embedded digital innovation and a single cloud-based platform to help businesses be their best when it really matters–at the Moment of Service™.</p><p>At IFS, we're flexible, we're innovative, and we're focused not only on how we can engage with our customers but on how we can make a real change and have a worldwide impact. We help solve some of society's greatest challenges, fostering a better future through our agility, collaboration, and trust.</p><p>We celebrate diversity and accept that there are so many different perspectives in this world. As a truly international company serving people from around the globe, we realize that our success is tantamount to the respect we have for those different points of view.</p><p>By joining our team, you will have the opportunity to be part of a global, diverse environment; you will be joining a winning team with a commitment to sustainability; and a company where we get things done so that you can make a positive impact on the world.</p><p>We're looking for innovative and original thinkers to work in an environment where you can #MakeYourMoment so that we can help others make theirs.</p><p>If you want to change the status quo, we'll help you make your moment. Join Team Purple. Join IFS.</p><h3>Job Description</h3><p>Are you ready to dive into a world where data meets creativity?<br/>\nAs our <strong>Business Intelligence (BI) Marketing Specialist</strong>, you’ll be the mastermind behind the Power BI reports and dashboards, delivering insights that drive the marketing team’s strategy. You’ll work alongside the Marketing Operations Analyst to understand our marketing stakeholders' needs and expertly craft the evolution of our reporting capabilities. This role is crucial in guiding data-driven marketing decisions. You will be joining a growing community of BI developers at IFS and using the latest Microsoft technologies like Fabric.</p><p><strong>Key Responsibilities:</strong></p><ul><li>Work with the marketing team to understand their data and Analytics needs</li><li>Leverage Data Lakes to store and manage large volumes of marketing data.</li><li>Design and build self service semantic models</li><li>Create and maintain Power BI reports and dashboards for the marketing team</li><li>Use Power BI to create visualizations and reports that provide insights and analysis</li><li>Ensure data accuracy and integrity in all reports and dashboards</li><li>Implement a validation system to ensure data quality</li><li>Continuously improve and optimize reports and dashboards to meet the changing needs of the marketing team</li><li>Familiar with CI/CD processes and source code management</li></ul><h3>Qualifications</h3><ul><li>3+ year experience developing reports and dashboards using Power BI with data from CRM systems, GA4, Marketo, SharePoint, flat files and other external sources</li><li>Experience working with marketing data, data lakes, and understanding marketing metrics</li><li>Microsoft DP-203,DP-500 or PL-300 certificate</li><li>Strong analytical skills and ability to turn data into actionable insights</li><li>Excellent attention to detail and commitment to data accuracy</li><li>Strong communication skills and ability to work collaboratively with the marketing team</li><li>Excellent knowledge of database systems, reporting tools, and ETL processes.</li><li>Understanding of end-to-end BI project implementation.</li></ul><ul></ul>",
"experience_level": "EN",
"application_url": "https://jobs.smartrecruiters.com/IFS1/743999979100533-business-intelligence-bi-marketing-specialist",
"language": "en",
"clearance_required": false,
"salary_min": null,
"salary_max": null,
"salary_currency": null
},
{
"id": 5034221,
"ext_id": "bf76ae08-d629-45f8-b713-8ab413acfa05",
"company": {
"id": 6304,
"name": "AiDash",
"logo": "https://jobdataapi.com/media/company/logo/22/12/aidashinc.jpg",
"website_url": "https://www.aidash.com/",
"linkedin_url": "https://www.linkedin.com/company/aidash",
"twitter_handle": "aidashinc",
"github_url": null
},
"title": "Performance Marketing Specialist",
"location": "Bengaluru, India",
"types": [
{
"id": 1,
"name": "Full Time"
}
],
"cities": [
{
"geonameid": 1277333,
"asciiname": "Bengaluru",
"name": "Bengaluru",
"country": {
"code": "IN",
"name": "India",
"region": {
"id": 2,
"name": "Asia/Pacific"
}
},
"timezone": "Asia/Kolkata",
"latitude": "12.97194",
"longitude": "77.59369"
}
],
"countries": [
{
"code": "IN",
"name": "India",
"region": {
"id": 2,
"name": "Asia/Pacific"
}
}
],
"regions": [
{
"id": 2,
"name": "Asia/Pacific"
}
],
"has_remote": false,
"published": "2024-04-08T07:01:14Z",
"description": "Who is AiDash?   AiDash is making critical infrastructure industries climate-resilient and sustainable with satellites and AI. Using our full-stack SaaS solutions, customers in electric, gas, and water utilities, transportation, and construction are transforming asset inspection and maintenance - and complying with biodiversity net gain mandates and carbon capture goals. Our customers deliver ROI in their first year of deployment with reduced costs, improved reliability, and achieved sustainability goals. Learn more at <a href=\"http://www.aidash.com/\">www.aidash.com</a>.  What’s the Role: <br/>If you are a results-driven professional with a passion for paid advertising and a commitment to delivering exceptional values, we invite you to apply for the Performance Marketing Specialistposition at <a href=\"http://www.aidash.com/\">www.aidash.com</a>You will leverage your 2-5 years of hands-on experience in Paid advertisement coupled with your expertise in Google Ads, LinkedIn Ads, FB/Insta and Twitter Ads to drive inorganic traffic, improve website visibility, and enhance overall digital marketing performance. <br/>What will you do? Optimize and Run Paid Campaigns: 1. Plan, execute, and optimize paid advertising campaigns across Google AdWords, LinkedIn, and Meta/Instagram Ads. 2. Monitor and analyze campaign performance metrics, making data-driven decisions to improve ROI and achieve business objectives. <br/>PreformB2B Marketing Plan: 1.Leverage extensive B2B marketing experience to tailor advertising strategies that resonate with target audiences and drive business results. 2. Understand the unique challenges and opportunities associated with B2B marketing and adjust strategies accordingly. <br/>Execute Account-Based Marketing (ABM): 1. Design and implement ABM strategies to target key accounts, working closely with management/Sr. to align advertising efforts with their business objectives. 2. Collaborate with sales teams to ensure alignment between advertising campaigns and account-specific goals<br/>Implement A/B Testing: 1. Conduct A/B testing on various ad creatives, landing pages, and audience segments to identify and implement performance improvements. 2. Provide insights and recommendations based on A/B testing results to enhance campaign effectiveness. <br/>Stay Updated about Industry Trends: 1. Collaborate with the internal team to develop comprehensive paid media strategies aligned with overall marketing and business goals. 2. Stay abreast of industry trends and emerging platforms to recommend innovative strategies. <br/>Manage Ads Budget: 1. Manage and optimize advertising budgets to achieve maximum efficiency and results. 2. Provide regular budget reports and forecasting to support strategic decision-making. <br/>Prepare Weekly/Monthly Analytics Reporting: 1. Utilize analytics tools to generate detailed reports on campaignperformance, including key metrics and KPIs. 2. Present findings and insights to internal stakeholders, making recommendations for improvement. <br/>Cross Functional Collaboration: 1. Work closely with cross-functional teams, including marketing, content, and development, to align Paid strategies with overall business goals.  2. Provide regular updates on campaign performance and recommendations for optimization. <br/><br/>\n<h3>What are we looking for?</h3>\n<ul>\n<li>Bachelor's degree in Marketing, Advertising, Business, or a related field. </li><li>Proven experience in managing paid advertising campaigns on Google AdWords, LinkedIn, and Meta/Instagram Ads. </li><li>In-depth knowledge of A/B testing tools and methodologies. </li><li>Strong analytical skills and the ability to translate data into actionable insights. </li><li>Excellent communication and presentation skills. </li><li>Detail-oriented with the ability to manage multiple projects simultaneously. </li><li>Google AdWords, LinkedIn, and Meta/Instagram Ads certifications are required. </li></ul>",
"experience_level": "MI",
"application_url": "https://jobs.lever.co/aidash/bf76ae08-d629-45f8-b713-8ab413acfa05",
"language": "en",
"clearance_required": false,
"salary_min": null,
"salary_max": null,
"salary_currency": null
},
{
"id": 5034564,
"ext_id": "ddaeca682ab2",
"company": {
"id": 4814,
"name": "Genesis",
"logo": "https://jobdataapi.com/media/company/logo/22/10/gt.jpg",
"website_url": "https://gen.tech",
"linkedin_url": "https://www.linkedin.com/company/genesis-technology-partners/",
"twitter_handle": null,
"github_url": null
},
"title": "Creative Marketing Specialist (Lift)",
"location": "Kyiv, UA",
"types": [
{
"id": 1,
"name": "Full Time"
}
],
"cities": [
{
"geonameid": 703448,
"asciiname": "Kyiv",
"name": "Kyiv",
"country": {
"code": "UA",
"name": "Ukraine",
"region": {
"id": 3,
"name": "Europe"
}
},
"timezone": "Europe/Kiev",
"latitude": "50.45466",
"longitude": "30.52380"
}
],
"countries": [
{
"code": "UA",
"name": "Ukraine",
"region": {
"id": 3,
"name": "Europe"
}
}
],
"regions": [
{
"id": 3,
"name": "Europe"
}
],
"has_remote": false,
"published": "2024-04-08T05:41:23.960259Z",
"description": "<p>Привіт!</p>\n<p>Ми українська продуктова компанія Lift, заснована у 2020 році у холдингу Genesis.</p>\n<p><strong>Lift</strong> — <strong><a href=\"https://apps.apple.com/UA/app/id1505322988?l=uk\">застосунок</a></strong> у сфері фото/відеоредагування, який допомагає SMM фахівцям, власникам малого та середнього бізнесу створювати контент для просування своїх товарів і послуг в соціальних мережах.</p>\n<p>У нас 10 мільйонів завантажень та 500 тисяч активних користувачів щомісяця. Lift регулярно фічерить Apple, ми входимо в Топ-5 найкращих графічних редакторів в App Store з оцінкою 4.8 за понад 130 тисяч відгуків.</p>\n<p>Ми шукаємо результато-орієнтованого, креативного <strong>маркетолога</strong>, який обожнює рекламу та соціальні мережі, розуміє, як створити рекламний креатив, який приверне увагу користувачів та залучить релевантну аудиторію.</p>\n<p>Працюючи з нами на позиції Creative Marketing Specialist, ти зможеш не лише реалізувати свої найсміливіші креативні ідеї, а й відслідковувати результативність різних підходів в рекламі та безпосередньо впливати на їхню ефективність.</p>\n<p><strong>Обов’язки:</strong><br/></p>\n<ul><li>Розробка концепцій рекламних креативів спрямованих на платне залучення трафіку та досягнення КРІ по основних перформанс метриках: CPT (cost per trial) i CPP (cost per payer);</li><li>Організація креативного процесу, брейнштормів та командних активностей для пошуку найефективніших ідей;</li><li>Написання брифів для дизайнерів та контент-креаторів;</li><li>Затвердження готових рекламних креативів, внесення правок;</li><li>Аналіз ефективності рекламних креативів, генерація ідей щодо покращення їхньої ефективності на основі отриманих висновків;</li><li>Моніторинг і аналіз ринку реклами та конкурентів;</li><li>Знаходження нових інструментів та підходів для покращення креативного процесу та принесення найкращих результатів.</li></ul>\n<p><strong>Які знання і навички тобі потрібні на цій посаді:</strong><br/></p>\n<ul><li>Досвід роботи у performance / digital / creative marketing від 1 року;</li><li>Любов до соціальних мереж, знання трендів та розуміння як створити віральний рекламний креатив;</li><li>Креативне та нестандартне мислення, вміння знаходити нові рішення та ідеї;</li><li>Вміння проводити A/B тести та приймати ефективні рішення на підставі отриманих даних;</li><li>Досвід написання технічних завдань для дизайнерів;</li><li>Відмінні комунікативні та копірайтинг навички;</li><li>Увага до деталей;</li><li>Англійська на рівні Upper Intermediate і вище.</li></ul>\n<p><strong>Ми пропонуємо:</strong><br/></p>\n<ul><li>Комфортні офіси на київському Подолі з надійними укриттями та наявністю безперебійного інтернету, водопостачання та електроживлення. В офісах можна не турбуватися про рутину: тут на тебе чекають сніданки, обіди, безліч снеків та фруктів, лаунж-зони, масаж та інші переваги офісного життя;</li><li>Гнучкий графік роботи;</li><li>За потреби — допомога з релокацією в безпечні місця та пошуком житла;</li><li>Онлайн-послуги корпоративного лікаря, а після випробного терміну — медичне страхування в Україні;</li><li>20 робочих днів оплачуваної відпустки на рік, необмежена кількість лікарняних;</li><li>Усю необхідну для роботи техніку;</li><li>Компенсацію найкращих на ринку курсів, корпоративні онлайн-мітапи та лекції, велику бібліотеку, бізнес- та менеджмент школи для співробітників;</li><li>Безоплатні тренування з бігу, волейболу, боксу та йоги, а також корпоративні знижки на абонементи в спортзали.</li></ul>\n<p>Приєднуйся до нашої команди!</p>",
"experience_level": null,
"application_url": "https://gen-tech.breezy.hr/p/ddaeca682ab2-creative-marketing-specialist-lift",
"language": "uk",
"clearance_required": false,
"salary_min": null,
"salary_max": null,
"salary_currency": null
},
{
"id": 5025931,
"ext_id": "5886504",
"company": {
"id": 2339,
"name": "Coupang",
"logo": "https://jobdataapi.com/media/company/logo/22/04/Coupang.jpg",
"website_url": "https://www.coupang.jobs/",
"linkedin_url": "https://www.linkedin.com/company/coupang/",
"twitter_handle": "Coupang",
"github_url": "https://github.com/coupang"
},
"title": "[쿠팡플레이] Growth Marketing Specialist (Play Marketing)",
"location": "Seoul, South Korea",
"types": [
{
"id": 1,
"name": "Full Time"
}
],
"cities": [
{
"geonameid": 1835848,
"asciiname": "Seoul",
"name": "Seoul",
"country": {
"code": "KR",
"name": "South Korea",
"region": {
"id": 2,
"name": "Asia/Pacific"
}
},
"timezone": "Asia/Seoul",
"latitude": "37.56600",
"longitude": "126.97840"
}
],
"countries": [
{
"code": "KR",
"name": "South Korea",
"region": {
"id": 2,
"name": "Asia/Pacific"
}
}
],
"regions": [
{
"id": 2,
"name": "Asia/Pacific"
}
],
"has_remote": false,
"published": "2024-04-08T00:44:20Z",
"description": "<p> </p>\n<p><strong>쿠팡플레이 소개</strong></p>\n<p>쿠팡플레이 (Coupang Play)는 대한민국에서 가장 빠르게 성장하고 있는 쿠팡의 스트리밍 서비스입니다. 2020년 12월 첫 출범한 쿠팡플레이는 서울, 싱가포르, 마운틴뷰 등 다양한 오피스에 기반을 둔 젊고 강력한 글로벌 전문가와 함께 차별화된 서비스를 만들어 가고 있습니다. </p>\n<p>쿠팡플레이는 모바일 디바이스, 태블릿 PC, 스마트 TV, 그리고 시청자가 선호하는 웹 브라우저를 통해 이용할 수 있습니다. 쿠팡플레이의 경쟁력 있는 콘텐츠 라이브러리는 다양한 취향과 연령에 맞도록 TV 시리즈, 영화, 스포츠 중계, 교육 콘텐츠 등 폭넓은 선택지를 제공, 와우회원에게 다채로운 시청경험을 선사하고 있습니다.</p>\n<p><strong>성장. 성취. 문제해결.  </strong></p>\n<p><strong>이 모든 것에 즐거움을 느끼는 분들의 많은 지원 바랍니다. </strong></p>\n<p> </p>\n<p><strong>팀 소개</strong></p>\n<p>그로스 마케팅 팀은 신규 고객 유입부터 인게이지까지 고객 여정 전 과정을 데이터와 테스팅을 통해 개선하고 강화하며 쿠팡플레이 비즈니스를 빠르고 건강하게 성장시킵니다. </p>\n<p>다양한 채널을 통해 잠재 고객을 꾸준히 유입시키고, 그들을 가입과 시청으로 전환시키고, 또 다시 쿠팡플레이를 찾도록 하는 일. 그로스 마케팅 팀은 다양한 채널에서 이루어지는 다양한 캠페인을 기획, 운영하고 최적화 하는 일을 합니다.  </p>\n<p> </p>\n<p><strong>업무 내용</strong></p>\n<ul>\n<li>User Acquisition Campaign - 전환 극대화 목적의 다양한 디지털 캠페인을 기획, 운영, 성과 분석 하는 일</li>\n<li>CRM Campaign - CRM 채널을 통하여 고객 시청 빈도를 강화하는 캠페인을 기획, 운영, 성과 분석 하는 일</li>\n<li>Product Marketing - 쿠팡플레이의 핵심 Product Feature를 고객에게 알리고 더 많이 사용하게 하는 일</li>\n<li>Experiments - 캠페인의 성과 개선을 위해 A/B 테스팅을 기획하고 그를 통해 인사이트를 도출하는 일</li>\n</ul>\n<p> </p>\n<p><strong>자격 요건 </strong></p>\n<ul>\n<li>최소 6년 이상 12년 미만의 Growth Marketing 혹은 Growth Product Owner 경험</li>\n<li>다음  중 최소 1개 이상 경험 있으신 분\n<ul>\n<li>구글, 메타 등 핵심 퍼포먼스 미디어를 활용한 컨버젼 캠페인 운영 경험 </li>\n<li>CRM 채널(App push, In-app Push, MMS, eDM 등)을 활용한 캠페인 운영 경험</li>\n</ul>\n</li>\n<li>프로덕트 조직과 협업하여 CX Funnel를 개선, 강화 해 본 경험</li>\n<li>프로덕 사용 주기, 사용량 등 제품 내 활동성 지표 개선하기 위한 캠페인 기획/운영 경험</li>\n<li>시리즈, 영화, 스포츠 등 다양한 콘텐츠를 폭넓게 시청하시는 분 </li>\n<li>데이터 기반의 논리적 사고 능력을 가지신 분</li>\n<li>명확한 커뮤니케이션 능력 </li>\n</ul>\n<p> </p>\n<p><strong>우대 사항</strong></p>\n<ul>\n<li>MAU 5백만명 이상 프로덕트를 대상으로 마케팅 경험 - 웹 / 앱 / 기타 디바이스</li>\n<li>스타트업 혹은 테크 카테고리 근무 경험</li>\n<li>Braze 혹은 기타 CRM 툴 활용 숙련자</li>\n<li>비즈니스 레벨 이상의 영어 구사 – Written, Verbal</li>\n</ul>\n<p> </p>\n<p><strong>Culture Fit</strong></p>\n<ul>\n<li>Problem Solver. Self-Starter </li>\n</ul>\n<p> </p>\n<p> </p>\n<p><strong>전형 절차 및 안내 사항  </strong><strong>   </strong>  </p>\n<p><strong>전형 절차  </strong>  </p>\n<ul>\n<li>서류전형 - 1차 화상 면접 - 2차 화상면접 -  최종 합격   </li>\n<li>전형 절차는 직무별로 다르게 운영될 수 있으며, 일정 및 상황에 따라 변동될 수 있습니다. </li>\n<li>전형 일정 및 결과는 지원서에 등록하신 이메일로 개별 안내드립니다.<br/><br/></li>\n</ul>\n<p><strong>참고 사항  </strong>  </p>\n<ul>\n<li>본 공고는 모집 완료 시 조기 마감될 수 있습니다.    </li>\n<li>지원서 내용 중 허위사실이 있는 경우에는 합격이 취소될 수 있습니다.  </li>\n<li>보훈대상자 및 장애인 여부는 채용 과정에서 어떠한 불이익도 미치지 않습니다. </li>\n<li>직급과 담당 업무 범위는 후보자의 전반적인 경력과 경험 등 제반 사정을 고려하여 변경될 수 있습니다. 이러한 변경이 필요할 경우, 최종 합격 통지 전 적절한 시기에 후보자와 커뮤니케이션 될 예정입니다.</li>\n</ul>\n<p> <strong><br/>개인정보 처리방침  </strong>  </p>\n<ul>\n<li>쿠팡 그룹은 입사지원자 개인정보 처리방침(아래 링크)에 따라 귀하의 개인정보를 수집하여 처리합니다.   <a href=\"https://www.coupang.jobs/kr/privacy-policy/\">https://www.coupang.jobs/kr/privacy-policy/  </a> </li>\n</ul>\n<p> </p>\n<p><strong>서류 반환 정책 </strong>  </p>\n<ul>\n<li>본 고지는 『채용절차의 공정화에 관한 법률』 제11조 제6항에 따른 것입니다.  </li>\n<li>당사 채용에 응시한 구직자 중 최종 합격이 되지 못한 구직자는 『채용절차의 공정화에 관한 법률』에 따라 제출한 채용서류의 반환을 청구할 수 있음을 알려 드립니다. 다만, 홈페이지 또는 전자우편으로 제출된 경우나 구직자가 당사의 요구 없이 자발적으로 제출한 경우에는 그러하지 아니하며, 천재지변이나 그 밖에 당사에게 책임 없는 사유로 채용서류가 멸실된 경우에는 반환한 것으로 봅니다.  </li>\n<li>위 2항 본문에 따라 채용서류 반환 청구를 하는 구직자는 채용서류 반환청구서 [채용절차의 공정화에 관한 법률 시행규칙 별지 제3호 서식]를 작성하여 이메일 (recruitingops@coupang.com)로 제출하면, 제출이 확인된 날로부터 14일 이내에 지정한 주소지로 등기우편을 통하여 발송해 드립니다. 이 경우 등기우편요금은 수신자 부담으로 하게 되오니 유념하시기 바랍니다.  </li>\n<li>당사는 위 2항 본문에 따른 구직자의 반환 청구에 대비하여 채용 여부가 확정된 날로부터 180일간 구직자가 제출한 채용서류 원본을 보관하게 되며, 그때까지 채용서류의 반환을 청구하지 아니할 경우에는 『개인정보 보호법』에 따라 지체 없이 채용서류 일체를 파기할 예정입니다. </li>\n<li>채용 및 업무 수행과 관련하여 요구되는 법령상 자격이 갖추어지지 않은 경우 채용이 제한될 수 있습니다. </li>\n</ul>\n<p> </p>\n<p> </p>\n<p class=\"footer-end-text-header\"><strong>쿠팡은 모두에게 공평한 기회를 제공합니다</strong></p>\n<p class=\"footer-end-text\">쿠팡은 어느 누구에게나 열려 있는 회사입니다. 다양한 국가 출신 임직원이 함께 일하는 글로벌팀이 없었더라면 전례없는 성공을 이루기 어려웠을 겁니다.</p>",
"experience_level": null,
"application_url": "https://www.coupang.jobs/en/jobs/?gh_jid=5886504",
"language": "ko",
"clearance_required": false,
"salary_min": null,
"salary_max": null,
"salary_currency": null
},
{
"id": 5035188,
"ext_id": "1058003301",
"company": {
"id": 13001,
"name": "IGT",
"logo": "https://jobdataapi.com/media/company/logo/23/12/igt.jpeg",
"website_url": "https://www.igt.com/",
"linkedin_url": "https://www.linkedin.com/company/igt",
"twitter_handle": "igtnews",
"github_url": null
},
"title": "Marketing Specialist iGaming",
"location": "Sliema, MT, SLM1670",
"types": [
{
"id": 1,
"name": "Full Time"
}
],
"cities": [
{
"geonameid": 2562501,
"asciiname": "Sliema",
"name": "Sliema",
"country": {
"code": "MT",
"name": "Malta",
"region": {
"id": 3,
"name": "Europe"
}
},
"timezone": "Europe/Malta",
"latitude": "35.91250",
"longitude": "14.50194"
}
],
"countries": [
{
"code": "MT",
"name": "Malta",
"region": {
"id": 3,
"name": "Europe"
}
}
],
"regions": [
{
"id": 3,
"name": "Europe"
}
],
"has_remote": false,
"published": "2024-04-08T00:00:00Z",
"description": "<p>IGT (NYSE:IGT) is a global leader in gaming. We deliver entertaining and responsible gaming experiences for players across all channels and regulated segments, from Lotteries and Gaming Machines to Sports Betting and Digital. Leveraging a wealth of compelling content, substantial investment in innovation, player insights, operational expertise, and leading-edge technology, our solutions deliver unrivaled gaming experiences that engage players and drive growth. We have a well-established local presence and relationships with governments and regulators in more than 100 countries around the world, and create value by adhering to the highest standards of service, integrity, and responsibility. IGT has approximately 10,500 employees. For more information, please visit <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3466342-1&amp;h=1955860405&amp;u=https%3A%2F%2Fwww.igt.com%2F&amp;a=www.igt.com\" target=\"_blank\">www.igt.com</a>.</p>\n<p> </p>\n<h2>Overview:</h2>\n<p> </p>\n<p>IGT PlayDigital marketing is looking to recruit a Marketing Specialist with a focus on casino games roadmap promotions and go-to-market plan execution.<br/>\nThe Marketing Specialist will promote slots/games both to the general market and directly with operators (in collab with commercial/product), applying relevant marketing GTM tactics to maximize support for game launches and overall operator adoption.  </p>\n<h2>What You’ll Do:</h2>\n<p> </p>\n<p>•    Participates in commercial and product calls focused on product release &amp; GTM ( refer to \"go to market\") identifying product release milestones, part of the joint roadmap exercise. <br/>\n•    Plans Games GTM and breaks down tasks for other marketing stakeholders. <br/>\n•    Increases product knowledge with in-depth sessions on understanding features and client benefits.  <br/>\n•    Maximizes creative opportunities together with commercial and product teams, brainstorms. <br/>\n•    Proactively identifies opportunities to maximize product exposure, awareness and interest in the market. <br/>\n•    Builds and executes Games GTM including creative/campaign proposals and competition watch, plus rest of the GTM tactics including tiered system, all communications, events, network and direct promotions.   <br/>\n•    Selects appropriate GTM tactics (social, video, events, streamers, campaigns etc.)  <br/>\n•    Coordinates production of relevant collateral including game videos, designs, roadmaps, social media updates and website content in collaboration with design team, communications manager and other internal stakeholders.<br/>\n•    Follows competition to ensure we keep competitive differentiation and advantage.<br/>\n•    Sets and updates relevant OKRs (Objectives &amp; Key Results), produces analysis and reports back.   <br/>\n•    Maintains GTM Roadmap, regularly syncs with key commercial and product stakeholders. <br/>\n•    Ensure key messages across all touchpoints in collaboration with communications manager.</p>\n<h2>About You:</h2>\n<p> </p>\n<p>•    You are self-driven, able to work on own initiative, accountable and organized<br/>\n•    You are ambitious, looking to learn and grow as marketing professional<br/>\n•    You have a passion for promoting casino technology and games</p>\n<h2>What We’d Prefer:</h2>\n<p> </p>\n<p>•    Experience in Casino (including operator CRM or Affiliate marketing) and general Gambling knowledge is an asset</p>\n<h2>Diversity, Equity and Inclusion</h2>\n<p> </p>\n<p>We believe that a team of unique individuals creates a dynamic, modern and fun work environment. Whether language, location or life experience, IGT PlayDigital recognizes and celebrates differences between team members. Our colleagues enjoy inclusive engagement through our 7 global Employee Impact Groups; Women’s Inclusion Network (WIN), Advancing Cultural Education (ACE), PRIDE, NEXGEN, Wealth of Wisdom (WoW) and Superabilities at IGT. We’re also the three-time Top-Ranking Gaming Supplier in the All-In Diversity Project; a Best Place to Work according to the Human Rights Campaign and the Disability Equality Index; and the 2023 D&amp;I Award winner at the Women in Gaming Diversity Awards-London.</p>\n<p> </p>\n<p>#LI-SZ1<br/>\n#LI-REMOTE<br/>\n#PlayDigitalSeriousFun</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p><em>IGT is committed to sustaining a workforce that reflects the diversity of the global customers and communities we serve, and to creating a fair and inclusive culture that enables all our employees to feel valued, respected and engaged.  IGT is an equal opportunity employer. We provide equal opportunities without regard to race, color, religion, gender, sexual orientation, gender identity, gender expression, pregnancy, marital status, national origin, citizenship, covered veteran status, ancestry, age, physical or mental disability, medical condition, genetic information, or any other legally protected status in accordance with applicable local, state, federal laws or other laws. We thank all applicants for applying; however, only those selected to interview will be contacted.</em></p>\n<p><br/>\n<em>IGT (NYSE: IGT) is the global leader in gaming.  For more information, please visit <a href=\"http://www.igt.com\">www.igt.com</a>.</em></p>",
"experience_level": "MI",
"application_url": "https://jobs.igt.com/IGT/job/Sliema-Marketing-Specialist-iGaming-SLM1670/1058003301/",
"language": "en",
"clearance_required": false,
"salary_min": null,
"salary_max": null,
"salary_currency": null
},
{
"id": 5028653,
"ext_id": "299438",
"company": {
"id": 11572,
"name": "S&P Global",
"logo": "https://jobdataapi.com/media/company/logo/23/10/spglobal_logo.jpeg",
"website_url": "https://www.spglobal.com/",
"linkedin_url": "https://www.linkedin.com/company/spglobal/",
"twitter_handle": "spglobal",
"github_url": null
},
"title": "Product Marketing Specialist",
"location": "MX - MEXICO CITY JAVIER BARROS SIERRA #540",
"types": [
{
"id": 1,
"name": "Full Time"
}
],
"cities": [],
"countries": [],
"regions": [],
"has_remote": false,
"published": "2024-04-08T00:00:00Z",
"description": "<h1>About the Role:</h1><p></p><p>Grade Level (for internal use):</p>10<p>About the Role:</p><p></p><p>The Team:</p><p>As an integral member of the S&amp;P Dow Jones Indices’ global marketing team, this position is responsible for driving awareness, leads and adoption of S&amp;P DJI offerings and index-linked products.  As part of the broader commercial organization, Marketing is responsible for helping to drive market share, revenue and leads, connecting Marketing activities (advertising, digital marketing, content marketing, etc.) to specific commercial outcomes. <br/> </p><p>The position is part of S&amp;P DJI’s Product Marketing team, whose remit is to develop and execute promotional marketing strategies to drive leads, improve competitive positioning and increase awareness and educational support of S&amp;P DJI index-linked products and capabilities to targeted audiences globally. </p><p></p><p>The individual will collaborate regularly with the broader S&amp;P DJI Marketing team, Enterprise and all digital agencies (creative, media, demand gen, etc.) to ensure activations are aligned to strategic and commercial priorities and optimized for driving Marketing Qualified Leads (MQLs). </p><p></p><p><br/>Responsibilities and Impact:</p><p>This role will help promote the S&amp;P DJI brand as the world’s leading, independent, index solutions provider. This role has responsibility for the public outcomes of S&amp;P DJI’s marketing in a business that is the largest global resource for essential index-based concepts, data and research, and home to iconic financial market indicators, such as the S&amp;P 500® and the Dow Jones Industrial Average®. The individual will be responsible for helping to drive marketing and commercial outcomes across all digital promotion activations.  <br/> </p><p>You will work closely with all parts of the S&amp;P DJI organization and regularly collaborate with Commercial Data &amp; Analytics (CDA), Client Experience Team (CXT) and Inside Sales.  You will be an ambassador for S&amp;P DJI and cultivate a high-performance culture of client-centrism, disciplined execution, collaboration, innovation, and integrity.  </p><p></p><p>As part of the Product Marketing team, you will be responsible for helping to drive market share, revenue and leads, connecting Marketing activities to specific commercial outcomes, focusing on:  </p><p></p><ul><li>Paid Media. This role’s primary focus is supporting the global paid media program by leveraging techniques across the digital mix (display, sponsored content, paid search/SEM and social media advertising). Ensure that all top, mid and bottom funnel activations are employed and optimized across priority product lines and data sales initiatives to support revenue targets, drive MQLs and demonstrate Marketing Influenced Revenue (MIR).    </li></ul><p></p><ul><li>Third-Party Syndication &amp; Lead Generation. Responsible for facilitating day-to-day execution across a multitude of content delivery techniques including, but not limited to, third-party distribution (500+) and social media outreach to drive leads and promote downstream awareness of S&amp;P DJI’s underlying index-linked products and data. </li></ul><p></p><ul><li>KPI/Reporting Oversight &amp; Delivery. Oversight of KPIs in a transparent and informative manner for internal and external stakeholders and unifying reports allowing for near real-time optimization and data analysis. The role owns direct responsibility for consolidating, synthesizing and reporting metrics across the digital program and partnering directly with relevant stakeholders to ensure processes are optimized to report commercial outcomes. Manage all necessary back-end systems and campaign tracking in order to effectively deliver management-ready interactive dashboards and provide real-time access to aggregate KPIs by region, theme, partner and audience.    </li></ul><p></p><p><u>What We’re Looking For:</u></p><p></p><p>Basic Required Qualifications:</p><p></p><ul><li>3+ years of professional experience in digital marketing, experience with Financial Services preferred. </li><li>Experience with social media and analytics platforms including but not limited to Adobe Analytics, Hootsuite, LinkedIn Account Manager, Tableau, Sharepoint, etc.  </li><li>Must be able to demonstrate commercial results and actionable outcomes. </li><li>Bachelor’s degree (Marketing, Communications, Business or related field preferred). </li><li>Demonstrate interpersonal, written and verbal communication skills with a track record of driving measurable and significant results. </li><li>Must demonstrate strong organizational skills. </li></ul><p></p><p></p><p>Additional Preferred Qualifications:</p><p></p><ul><li>Experience with managing marketing campaigns and activations across digital marketing landscape including but not limited to programmatic, search, social media and display advertising. </li><li>Foundational understanding of the principals of the primary uses of indices, and index-based products by portfolio managers, financial analysis, institutional-quality asset owners and product issuers preferred. </li><li>Comprehension of the basic pillars of investment management /asset allocation and the goals of financial market participants, including institutional investors, financial advisors, etc. </li><li>Must exhibit ability to prioritize many conflicting business needs and act accordingly in a timely manner. </li><li>Must exhibit exploratory, forward thinking, solution-solving style and ability to rationalize available opportunities for the S&amp;P DJI opportunity set. </li><li>advantageous</li></ul><p></p><p></p><p>About S&amp;P Global Dow Jones Indices </p><p>At S&amp;P Dow Jones Indices, we provide iconic and innovative index solutions backed by unparalleled expertise across the asset-class spectrum. By bringing transparency to the global capital markets, we empower investors everywhere to make decisions with conviction. We’re the largest global resource for index-based concepts, data and research, and home to iconic financial market indicators, such as the S&amp;P 500® and the Dow Jones Industrial Average®. More assets are invested in products based upon our indices than any other index provider in the world. With over USD 7.4 trillion in passively managed assets linked to our indices and over USD 11.3 trillion benchmarked to our indices, our solutions are widely considered indispensable in tracking market performance, evaluating portfolios and developing investment strategies. </p><p>S&amp;P Dow Jones Indices is a division of S&amp;P Global (NYSE: SPGI). S&amp;P Global is the world’s foremost provider of credit ratings, benchmarks, analytics and workflow solutions in the global capital, commodity and automotive markets. With every one of our offerings, we help many of the world’s leading organizations navigate the economic landscape so they can plan for tomorrow, today. For more information, visit <a href=\"http://www.spglobal.com/spdji\" rel=\"noopener noreferrer\" target=\"_blank\">www.spglobal.com/spdji</a>. </p><p></p><p><u>What’s In It For </u><u>You?</u></p><p></p><p><u>Our Purpose:</u></p><p>Progress is not a self-starter. It requires a catalyst to be set in motion. Information, imagination, people, technology–the right combination can unlock possibility and change the world.<br/><br/>Our world is in transition and getting more complex by the day. We push past expected observations and seek out new levels of understanding so that we can help companies, governments and individuals make an impact on tomorrow. At S&amp;P Global we transform data into Essential Intelligence®, pinpointing risks and opening possibilities. We Accelerate Progress.</p><p><br/><u>Our People:</u></p><p>We're more than 35,000 strong worldwide—so we're able to understand nuances while having a broad perspective. Our team is driven by curiosity and a shared belief that Essential Intelligence can help build a more prosperous future for us all.<br/><br/>From finding new ways to measure sustainability to analyzing energy transition across the supply chain to building workflow solutions that make it easy to tap into insight and apply it. We are changing the way people see things and empowering them to make an impact on the world we live in. We’re committed to a more equitable future and to helping our customers find new, sustainable ways of doing business. We’re constantly seeking new solutions that have progress in mind. Join us and help create the critical insights that truly make a difference.</p><p></p><p><u>Our Values:</u><br/> </p><p>Integrity, Discovery, Partnership</p><p><br/>At S&amp;P Global, we focus on Powering Global Markets. Throughout our history, the world's leading organizations have relied on us for the Essential Intelligence they need to make confident decisions about the road ahead. We start with a foundation of integrity in all we do, bring a spirit of discovery to our work, and collaborate in close partnership with each other and our customers to achieve shared goals.<br/><br/><u>Benefits:</u> </p><p>We take care of you, so you can take care of business. We care about our people. That’s why we provide everything you—and your career—need to thrive at S&amp;P Global.<br/><br/>Our benefits include: </p><ul><li><p>Health &amp; Wellness: Health care coverage designed for the mind and body.</p></li><li><p>Flexible Downtime: Generous time off helps keep you energized for your time on.</p></li><li><p>Continuous Learning: Access a wealth of resources to grow your career and learn valuable new skills.</p></li><li><p>Invest in Your Future: Secure your financial future through competitive pay, retirement planning, a continuing education program with a company-matched student loan contribution, and financial wellness programs.</p></li><li><p>Family Friendly Perks: It’s not just about you. S&amp;P Global has perks for your partners and little ones, too, with some best-in class benefits for families.</p></li><li><p>Beyond the Basics: From retail discounts to referral incentive awards—small perks can make a big difference.</p></li></ul><p>For more information on benefits by country visit: <a href=\"https://www.spglobal.com/en/careers/our-culture/\" rel=\"noopener noreferrer\" target=\"_blank\">https://www.spglobal.com/en/careers/our-culture/</a></p><p></p><p><u>Diversity, Equity, and Inclusion at S&amp;P Global:</u><br/>At S&amp;P Global, we believe diversity fuels creative insights, equity unlocks opportunity, and inclusion drives growth and innovation – Powering Global Markets. Our commitment centers on our global workforce, ensuring that our people are empowered to bring their whole selves to work. It doesn’t stop there, we strive to better reflect and serve the communities in which we live and work, and advocate for greater opportunity for all.<br/> </p><p>-----------------------------------------------------------</p><p></p><p>Equal Opportunity Employer</p><p>S&amp;P Global is an equal opportunity employer and all qualified candidates will receive consideration for employment without regard to race/ethnicity, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, marital status, military veteran status, unemployment status, or any other status protected by law.  Only electronic job submissions will be considered for employment.  </p><p> </p><p>If you need an accommodation during the application process due to a disability, please send an email to: <a href=\"mailto:EEO.Compliance@spglobal.com\" rel=\"noopener noreferrer\" target=\"_blank\"><u>EEO.Compliance@spglobal.com</u></a> and your request will be forwarded to the appropriate person.  <br/> <br/>US Candidates Only:  The EEO is the Law Poster <a href=\"http://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf\" rel=\"noopener noreferrer\" target=\"_blank\"><u>http://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf </u></a>describes discrimination protections under federal law. </p><p></p><p>-----------------------------------------------------------</p>20 - Professional (EEO-2 Job Categories-United States of America), MRKTNG202.1 - Middle Professional Tier I (EEO Job Group), SWP Priority – Ratings - (Strategic Workforce Planning)",
"experience_level": "SE",
"application_url": "https://spgi.wd5.myworkdayjobs.com/en-US/SPGI_Careers/job/Mexico-City-MX/Product-Marketing-Specialist_299438-2",
"language": "en",
"clearance_required": false,
"salary_min": null,
"salary_max": null,
"salary_currency": null
},
{
"id": 5028734,
"ext_id": "87130",
"company": {
"id": 11605,
"name": "Gartner",
"logo": "https://jobdataapi.com/media/company/logo/23/10/gartner_logo.jpeg",
"website_url": "https://www.gartner.com/",
"linkedin_url": "https://www.linkedin.com/company/gartner/",
"twitter_handle": null,
"github_url": null
},
"title": "Sr Marketing Specialist",
"location": "Gurgaon - Cyber Park",
"types": [
{
"id": 1,
"name": "Full Time"
}
],
"cities": [
{
"geonameid": 1270642,
"asciiname": "Gurgaon",
"name": "Gurgaon",
"country": {
"code": "IN",
"name": "India",
"region": {
"id": 2,
"name": "Asia/Pacific"
}
},
"timezone": "Asia/Kolkata",
"latitude": "28.46010",
"longitude": "77.02635"
}
],
"countries": [
{
"code": "IN",
"name": "India",
"region": {
"id": 2,
"name": "Asia/Pacific"
}
}
],
"regions": [
{
"id": 2,
"name": "Asia/Pacific"
}
],
"has_remote": false,
"published": "2024-04-08T00:00:00Z",
"description": "<p>About Corporate Marketing:</p><p>Our Corporate Marketing team designs marketing programs to help prospective customers understand how Gartner’s insights, advice, and tools can help them achieve the mission-critical priorities that drive organizational performance. The team accelerates sales activity by attracting, engaging and converting prospects through the delivery of compelling Gartner insights and experiences across the buyer journey.</p><p></p><p>About the role: </p><p>We’re looking for a B2B Senior Marketing Specialist to work within the Gartner Global Marketing Team, supporting marketing efforts for aligned sales regions as well as global marketing initiatives. The Senior Marketing Specialist will be a key contributor to the ongoing growth and success of Gartner by supporting the execution of lead generation campaigns for the Global Business Sales (GBS) Marketing practice with a specific focus on the HR role. He/she will work closely with a team of geographically dispersed Marketing leaders to execute scalable, globally consistent marketing practices.</p><p></p><p>Marketing impact is measured on revenue sourced from marketing leads, brand awareness, new product launch effectiveness and overall effectiveness in coordinating with other relevant corporate functions and teams.</p><p></p><p>The marketing team in Gurgaon is a key contributor to our global marketing and sales enablement department (~60 global associates) and accelerates sales productivity by developing product messaging &amp; campaign strategy that is brought to market through experiential, digital, paid 3rd parties, unpaid media and sales channels.</p><p><br/>What You Will Do: </p><ul><li><p>Execute marketing activities to drive customer acquisition and cross-sell through integrated marketing campaigns, sales enablement materials, social media engagement and campaign reporting and analysis.</p></li><li><p>Develop compelling and concise content for our lead generation campaigns across various channels including website, email, social media etc.</p></li><li><p>Manage email marketing campaign execution by writing content, creating campaign tracking and partnering with our email deployment team.</p></li><li><p>Write and optimize public website content with a strong understanding of SEO</p></li><li><p>Support optimization efforts for paid campaigns such as third-party campaigns and other paid channels.</p></li><li><p>Support marketing collateral creation and create effective sales enablement materials to improve sales teams’ ability to authentically engage with segments</p></li><li><p>Partner with marketing leaders in the US and Europe to develop a deep understanding of messaging and product offerings.</p></li><li><p>Collaborate across business lines and with colleagues in Gurgaon to identify, leverage and integrate marketing ideas and activities.</p></li><li><p>Review marketing performance using metrics and analytics, making recommendations and adapting marketing plans to incorporate best practices</p></li><li><p>Coordinate with marketing partners (Centres of Excellence) across the larger marketing organization to develop marketing assets, digital marketing campaigns, etc.</p></li></ul><p></p><p>What You Will Need:</p><ul><li><p>BS/BA degree or MBA degree in marketing or a related field</p></li><li><p>A minimum of 3-5 years of relevant marketing experience in a B2B environment ideally with experience in a service or solutions-oriented businesses or technology</p></li><li><p>Proven experience supporting the development of successful integrated marketing or demand generation programs.</p></li><li><p>Project management, communication, analytical and interpersonal skills</p></li><li><p>Ability to define problems, collect data, establish facts, and draw valid conclusions.</p></li><li><p>An entrepreneurial orientation with the ability to apply creative approaches to marketing innovative products.</p></li><li><p>Strong analytical and communications skills</p></li><li><p>This individual must be adaptable, persuasive, tenacious, and perceptive and be able to execute a well-developed plan. </p></li><li><p>Ability to be flexible and work effectively in a collaborative fast-paced, fast-changing environment.</p></li><li><p>Proficient with MS Office (Excel and PowerPoint)</p></li></ul><p></p><p>What We Offer:</p><ul><li><p>Competitive salary, generous paid time off policy, charity match program, Group Medical Insurance, Parental Leave, Employee Assistance Program (EAP) and more!</p></li><li><p>Collaborative, team-oriented culture that embraces diversity</p></li><li><p>Professional development and unlimited growth opportunities</p></li></ul><p></p><p>Who are we?</p><p>At Gartner, Inc. (NYSE: IT), we deliver actionable, objective insight that drives smarter decisions and stronger performance on an organization’s mission-critical priorities. We’ve grown exponentially since our founding in 1979 and we're proud to have over 19,500 associates globally that support over 15,000 client enterprises in more than 100 countries.</p><p></p><p>What makes Gartner a great place to work?</p><p>Our teams are composed of individuals from different geographies, cultures, religions, ethnicities, races, genders, sexual orientations, abilities and generations. We believe that a diversity of experiences makes us stronger—as individuals, as communities and as an organization. That’s why we're recognized worldwide as a great place to work year after year. We've been recognized by Fortune as one of the World’s Most Admired Companies, named a Best Place to Work for LGBTQ Equality by the Human Rights Campaign Corporate Equality Index and a Best Place to Work for Disability Inclusion by the Disability Equality Index. Looking for a place to turn your big ideas into reality? Join #LifeAtGartner </p><p></p><p>What we offer:</p><p>Our people are our most valuable asset, so we invest in them from Day 1. When you join our team, you’ll have access to a vast array of benefits to help you live your life well. These resources are designed to support your physical, financial and emotional well-being. We encourage continued personal and professional growth through ongoing learning and development opportunities. Our employee resource groups, charity match and volunteer programs keep you connected to your internal Gartner community and causes that matter to you.</p><p></p><p></p><p><br/>The policy of Gartner is to provide equal employment opportunities to all applicants and employees without regard to race, color, creed, religion, sex, sexual orientation, gender identity, marital status, citizenship status, age, national origin, ancestry, disability, veteran status, or any other legally protected status and to affirmatively seek to advance the principles of equal employment opportunity.</p><p></p><p>Gartner is committed to being an Equal Opportunity Employer and offers opportunities to all job seekers, including job seekers with disabilities. If you are a qualified individual with a disability or a disabled veteran, you may request a reasonable accommodation if you are unable or limited in your ability to use or access the Company’s career webpage as a result of your disability. You may request reasonable accommodations by calling Human Resources at +1 (203) 964-0096 or by sending an email to <a href=\"mailto:ApplicantAccommodations@gartner.com?subject=Request%20for%20Applicant%20Accommodations\" rel=\"noopener noreferrer\" target=\"_blank\">ApplicantAccommodations@gartner.com</a>.</p><p></p><p></p>Job Requisition ID:87130<p></p><p></p><p>By submitting your information and application, you confirm that you have read and agree to the country or regional recruitment notice linked below applicable to your place of residence.</p><p></p><p>Gartner Applicant Privacy Link: <a href=\"https://jobs.gartner.com/applicant-privacy-policy\" rel=\"noopener noreferrer\" target=\"_blank\">https://jobs.gartner.com/applicant-privacy-policy</a></p><p><br/>For efficient navigation through the application, please only use the back button within the application, not the back arrow within your browser.</p>",
"experience_level": "SE",
"application_url": "https://gartner.wd5.myworkdayjobs.com/en-US/EXT/job/Gurgaon/Sr-Marketing-Specialist_87130",
"language": "en",
"clearance_required": false,
"salary_min": null,
"salary_max": null,
"salary_currency": null
},
{
"id": 5036769,
"ext_id": "1152128300",
"company": {
"id": 15184,
"name": "NextEra Energy",
"logo": "https://jobdataapi.com/media/company/logo/23/12/nextera_energy_inc_logo.jpeg",
"website_url": "https://www.nexteraenergy.com",
"linkedin_url": "https://www.linkedin.com/company/nextera-energy-inc/",
"twitter_handle": null,
"github_url": null
},
"title": "Marketing Specialist",
"location": "Juno Beach, FL, US, 33408",
"types": [
{
"id": 1,
"name": "Full Time"
}
],
"cities": [],
"countries": [
{
"code": "US",
"name": "United States",
"region": {
"id": 5,
"name": "North America"
}
}
],
"regions": [
{
"id": 5,
"name": "North America"
}
],
"has_remote": false,
"published": "2024-04-08T00:00:00Z",
"description": "<p>Requisition ID:  78557 </p>\n<p> </p>\n<p><u><a href=\"https://www.nexteraenergyresources.com/what-we-do/energy-marketing.html\">NextEra Energy Resources</a></u> is the world's largest generator of renewable energy from the wind and sun, and a world leader in battery storage. We provide energy-related products and services that grow our economy, protect the environment, support our communities and help customers meet their energy needs. We are leading the decarbonization of the U.S. economy with our goal to reach Real Zero carbon emissions from our operations by 2045 while improving customer affordability and reliability. Are you interested in creating a cleaner environment for future generations? Join our world-class, innovative team today.</p>\n<p> </p>\n<p>Position Specific Description</p>\n<p><p>The ideal Marketing Specialist is very versatile and can support the marketing department in a variety of areas. This individual will provide the necessary support to initiate, develop, implement, and/or measure projects, programs, and initiatives. The ideal candidate has excellent written and verbal communication skills, as well as being very detailed-oriented and well-organized. This role will lead the planning and execution of event details including travel, booth setup and teardown, and the ordering and shipping of swag and printed materials for conferences and trade shows.</p>\n<p> </p>\n<p>Responsibilities:</p>\n<ul>\n<li>Develops and manages a comprehensive events calendar including all components of planning and execution for conferences and trade shows</li>\n<li>Partners with business stakeholders to define marketing objectives and advertising initiatives</li>\n<li>Assists in tracking the team’s progress against the marketing operational plan</li>\n<li>Writes and edits copy – for both internal and external audiences – including, but not limited to: articles, scripts, marketing collateral, web content, forum responses, blogs, newsletters, social media posts, press releases, sales collateral, email campaigns, training, and conference materials</li>\n<li>Maintains library of marketing assets on shared drive</li>\n<li>Develops and executes a content calendar to ensure consistent social media activity (posts) that aligns with brand persona to engage target audiences</li>\n<li>Coordinates with Customer Care and Quality Assurance for handling of online reputational management issues</li>\n<li>Manages external relationships with vendors (graphic designers, printers, etc.) to ensure on-time, on-budget delivery of high-quality communications materials</li>\n<li>Stays up-to-date on the latest marketing trends, tools, technologies, and platforms as well as industry-specific news</li>\n<li>Knowledge shares with colleagues to establish a team culture of collaboration, innovation, curiosity, and passion</li>\n<li>Demonstrates discipline and organization in executing projects, while building and maintaining great relationships with co-workers, stakeholders, and agency partners</li>\n</ul>\n<p> </p>\n<p>Additional Qualifications:</p>\n<ul>\n<li>Experience with Hubpot email campaigns</li>\n<li>Experience with social media management tools</li>\n<li>Energy industry experience a plus</li>\n<li>Ability to travel occasionally for events and conferences</li>\n<li>Working knowledge of Adobe Creative Suite (InDesign, Photoshop, etc.) a plus</li>\n<li>Ability to accurately and consistently follow brand guidelines, AP style, and company communication standards</li>\n</ul></p>\n<h2>Job Overview</h2>\n<p>This job is responsible for assisting with projects from the earliest stages of concept and development through to successful, on-time completion as measured by achievement of metrics. Employees in this role provide support in developing and executing marketing plans and initiatives to support business objectives. Individuals in this position are expected to understand needs and help to develop marketing solutions.</p><h2>Job Duties &amp; Responsibilities</h2>\n<ul>\n<li>Assists with marketing planning</li>\n<li>Develops key campaign tactics using research and analytics to drive planning and messaging</li>\n<li>Follows established processes, demonstrating discipline and organization in executing assignments and plans</li>\n<li>Builds and maintains great relationships with co-workers</li>\n<li>Tracks performance and progress using quantifiable metrics</li>\n<li>Communicates frequently with cross-functional groups</li>\n<li>Works at both business unit and corporate levels</li>\n<li>Performs other job-related duties as assigned</li>\n</ul><h2>Required Qualifications</h2>\n<ul>\n<li>Bachelor's Degree</li>\n<li>Experience: 2+ years</li>\n</ul><h2>Preferred Qualifications</h2>\n<ul>\n<li>None</li>\n</ul><p> </p>\n<p>Employee Group:  Exempt<br/>\nEmployee Type:  Full Time<br/>\nJob Category:  Marketing/Communications<br/>\nOrganization:  NextEra Energy Project Management, LLC <br/>\nRelocation Provided:  No</p>\n<p> </p>\n<p>NextEra Energy is an Equal Opportunity Employer. Qualified applicants are considered for employment without regard to race, color, age, national origin, religion, marital status, sex, sexual orientation, gender identity, gender expression, genetics, disability, protected veteran status or any other basis prohibited by law. We are committed to a diverse and inclusive workplace.</p>\n<p> </p>\n<p>NextEra Energy provides reasonable accommodation in its application and selection process for qualified individuals, including accommodations related to compliance with conditional job offer requirements, consistent with federal, state, and local laws. Supporting medical or religious documentation will be required where applicable and permitted by applicable law. To request a reasonable accommodation, please send an e-mail to <a href=\"mailto:recruiting-coordinator.sharedmailbox@nexteraenergy.com\">recruiting-coordinator.sharedmailbox@nexteraenergy.com</a>, providing your name, telephone number and the best time for us to reach you. Alternatively, you may call 1-844-694-4748. Please do not use this line to inquire about your application status.</p>\n<p> </p>\n<p>NextEra Energy will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor’s legal duty to furnish information.</p>\n<p> </p>\n<p>NextEra Energy does not accept any unsolicited resumes or referrals from any third-party recruiting firms or agencies. Please see our <a href=\"https://jobs.nexteraenergy.com/content/Third-Party-Recruiters/?locale=en_US&amp;previewLink=true&amp;referrerSave=false&amp;token=a4un1TiWoTYJimvq3RG1Jw%3D%3D\" target=\"_blank\">policy</a> for more information.</p>\n<p> </p>",
"experience_level": "MI",
"application_url": "https://jobs.nexteraenergy.com/job/Juno-Beach-Marketing-Specialist-FL-33408/1152128300/",
"language": "en",
"clearance_required": false,
"salary_min": null,
"salary_max": null,
"salary_currency": null
},
{
"id": 5037924,
"ext_id": "1057790901",
"company": {
"id": 13978,
"name": "Aptar",
"logo": "https://jobdataapi.com/media/company/logo/23/12/logo_img_NK7JwyC.png",
"website_url": "https://aptar.com",
"linkedin_url": "https://www.linkedin.com/company/aptargroup-inc-/",
"twitter_handle": "aptar",
"github_url": null
},
"title": "Alternance_Digital Marketing Specialist H/F",
"location": "Louveciennes, 78, FR, 78431",
"types": [
{
"id": 4,
"name": "Internship"
}
],
"cities": [],
"countries": [],
"regions": [],
"has_remote": false,
"published": "2024-04-08T00:00:00Z",
"description": "<p>QUI SOMMES-NOUS ?</p>\n<p>Chez Aptar, nous nous appuyons sur notre expertise, en matière de design, d'ingénierie et de recherche pour développer des systèmes de distribution innovants pour l’industrie du packaging. Ces solutions valorisent la marque de nos clients et améliorent le confort de vie quotidien des habitants du monde entier en termes de fonctionnalités, design, santé et sécurité.</p>\n<p>Chaque jour, Aptar créé des « révélations » pour ses clients, ses consommateurs et ses patients en proposant régulièrement au marché des innovations qui révolutionnent l’emballage en proposant des systèmes de distribution de produits. Ces systèmes ont différentes applications, permettant aux consommateurs l’utilisation optimale de leur parfum préféré, aux enfants d’éviter les incidents liés au dosage du ketchup et aux patients de bénéficier des technologies connectées qui permettent une meilleure adaptation à leur traitement.</p>\n<p>Nos sites de production sont implantés en Amérique du Nord, en Europe, en Asie et en Amérique du Sud, avec plus de 13 000 collaborateurs officiant dans 18 pays différents.</p>\n<p> </p>\n<p>VOUS DEVRIEZ NOUS REJOINDRE CAR NOUS :</p>\n<ul>\n<li>attirons et développons les talents,</li>\n<li>offrons un environnement de travail diversifié et inclusif,</li>\n<li>transformons l’échec en expérience en admettant le droit à l’erreur dans un environnement ouvert et propice à la confiance,</li>\n<li>investissons dans le développement des collaborateurs par le biais d'opportunités de carrière locales, régionales et mondiales,</li>\n<li>contribuons aux actions locales là où nous sommes implantés.</li>\n</ul>\n<p> </p>\n<p>QUOI DE NEUF CHEZ APTAR</p>\n<p> </p>\n<p>Une opportunité passionnante s’ouvre en alternance sur le Site de Reuil Malmaison au sein du Service Marketing Digitale</p>\n<p> </p>\n<p>L’objectif de la mission consiste à mettre en œuvre la feuille de route convenue pour le marketing digitale.</p>\n<p> </p>\n<p>Vos principales missions sont : </p>\n<ul>\n<li>Aider à la mise en œuvre d’un plan Digital Marketing stratégique</li>\n</ul>\n<ul>\n<li>Participer à l’analyse des données analytiques e.g. Google, Piwik, SEMrush</li>\n</ul>\n<ul>\n<li>Élaborer un plan payant pour LinkedIn afin d'attirer de nouveaux clients </li>\n</ul>\n<ul>\n<li>Participer à l’évaluation d’un futur DAM <em>(Digital Asset Management)</em></li>\n</ul>\n<p> </p>\n<p>En fonction de votre intérêt, la participation à des missions ou des projets annexes est envisageable.</p>\n<p> </p>\n<p>VOTRE PROFIL</p>\n<p> </p>\n<p>Vous intégrez : </p>\n<ul>\n<li>Une formation en lien avec la communication marketing de type MBA Digital Marketing, MSc Digital Marketing ou MBA Marketing Management</li>\n</ul>\n<ul>\n<li>Une formation en lien avec B2B marketing qui inclure marketing digital </li>\n</ul>\n<p> </p>\n<p>Vous êtes : </p>\n<ul>\n<li>Ouvert d’esprit et rigoureux</li>\n<li>Organisé(e) et autonome</li>\n<li>Capable de travailler en équipe</li>\n</ul>\n<p> </p>\n<p>CE QUE NOUS AVONS A VOUS OFFRIR </p>\n<ul>\n<li>Salaire de base attractif, accompagné d’un système de rémunération variable basé sur la performance. </li>\n<li>Un environnement de travail valorisant, passionnant et diversifié</li>\n<li>Une université d'entreprise récompensée, offrant des possibilités de développement personnel et des formations</li>\n<li>“Be You. Be Aptar” </li>\n</ul>\n<p> </p>\n<p>Aptar est un employeur qui prône l’égalité des chances. Nous croyons qu’une main-d’œuvre diversifiée est la clé de notre succès. Nous accueillons favorablement les candidatures de tous les membres de la société, indépendamment de l’âge, du sexe, du handicap, de l’orientation sexuelle, de la nationalité, de la religion ou de la croyance. </p>\n<p> </p>\n<p>Informations complémentaires</p>\n<p class=\"MsoNoSpacing\"> </p>\n<p class=\"MsoNoSpacing\"><em>Durée de la mission : 2 années de préférence</em></p>\n<p class=\"MsoNoSpacing\"><em>Lieu : </em>Reuil Malmaison</p>\n<p class=\"MsoNoSpacing\"><em>Pour nous découvrir : </em><a href=\"https://www.aptar.com/\"><em>https://www.aptar.com/</em></a></p>\n<p class=\"MsoNoSpacing\"> </p>\n<p class=\"MsoNoSpacing\"> </p>\n<p><em>WHO ARE WE?</em></p>\n<p><em>At Aptar, we leverage our design, engineering and research expertise to develop innovative dispensing systems for the packaging industry. These solutions enhance our customers' brands and improve the daily lives of people around the world in terms of functionality, design, health and safety.</em></p>\n<p><em>Every day, Aptar creates \"revelations\" for its customers, consumers and patients by regularly bringing innovations to the market that revolutionize packaging by offering product delivery systems. These systems have different applications, allowing consumers to make the best use of their favorite fragrance, children to avoid ketchup dosing mishaps and patients to benefit from connected technologies that enable better adaptation to their treatment.</em></p>\n<p><em>Our manufacturing facilities are located in North America, Europe, Asia and South America, with over 13,000 employees operating in 18 different countries.</em></p>\n<p> </p>\n<p><em>YOU SHOULD JOIN US BECAUSE WE :</em></p>\n<p><em>- attract and develop talent,</em></p>\n<p><em>- offer a diverse and inclusive work environment,</em></p>\n<p><em>- turn failure into experience by allowing for mistakes in an open and trusting environment,</em></p>\n<p><em>- invest in employee development through local, regional and global career opportunities,</em></p>\n<p><em>- contribute to local actions where we operate.</em></p>\n<p> </p>\n<p><em>WHAT'S NEW AT APTAR</em></p>\n<p><em>An exciting opportunity has opened up for a work-study position at the </em>Reuil Malmaison<em> site within the Digital Marketing Department</em></p>\n<p><em>The objective of the assignment is to implement the agreed upon roadmap for digital marketing.</em></p>\n<p> </p>\n<p><em>Your main missions are: </em></p>\n<p><em>- Assist in the implementation of the Digital Marketing Plan</em></p>\n<p><em>-Help in the analysis of analytical data e.g. Google analytics, Piwik, SEMrush </em></p>\n<p><em>- Execute the sponsored LinkedIn plan to attract new clients</em></p>\n<p><em>- Participate in the evaluation of a future DAM (Digital Asset Management)</em></p>\n<p> </p>\n<p><em> Depending on your interest, participation in other missions or projects is possible.</em></p>\n<p> </p>\n<p><em>YOUR PROFILE</em></p>\n<p><em><u>You will integrate : </u></em></p>\n<ul>\n<li><em></em><em> An education related to marketing communication such as MBA Digital Marketing or MSc Digital Marketing or </em>MBA Marketing Management</li>\n</ul>\n<p><em>- An education related to B2B marketing which includes digital marketing </em></p>\n<p> </p>\n<p><em><u>You are : </u></em></p>\n<p><em></em><em> Open-minded and rigorous</em></p>\n<p><em></em><em> Organized and autonomous</em></p>\n<p><em></em><em> Able to work in a team</em></p>\n<p> </p>\n<p><em>WHAT WE HAVE TO OFFER YOU </em></p>\n<p><em>- An attractive base salary, with a variable compensation system based on performance. </em></p>\n<p><em>- A rewarding, exciting and diverse work environment</em></p>\n<p><em>- An award-winning corporate university, offering personal development opportunities and training</em></p>\n<p><em>- \"Be You. Be Aptar\" </em></p>\n<p><em>Aptar is an equal opportunity employer. We believe that a diverse workforce is key to our success. We welcome applications from all members of society, regardless of age, gender, disability, sexual orientation, nationality, religion or creed. </em></p>\n<p> </p>\n<p><em>Additional Information</em></p>\n<p><em>Duration of the mission : 2 years preferably</em></p>\n<p><em>Location: </em>Reuil Malmaison</p>\n<p><em>To discover us : https://www.aptar.com/</em></p>",
"experience_level": "EN",
"application_url": "https://jobs.aptar.com/job/Louveciennes-Alternance_Digital-Marketing-Specialist-HF-78-78431/1057790901/",
"language": "fr",
"clearance_required": false,
"salary_min": null,
"salary_max": null,
"salary_currency": null
},
{
"id": 5055548,
"ext_id": "JR033396",
"company": {
"id": 11539,
"name": "The E.W. Scripps Company",
"logo": "https://jobdataapi.com/media/company/logo/23/10/the_e_w_scripps_company_logo.jpeg",
"website_url": "https://scripps.com/",
"linkedin_url": "https://www.linkedin.com/company/the-e-w-scripps-company",
"twitter_handle": "EWScrippsCo",
"github_url": null
},
"title": "Digital Marketing Specialist (Remote)",
"location": "Home Office - Ohio",
"types": [
{
"id": 1,
"name": "Full Time"
}
],
"cities": [],
"countries": [
{
"code": "US",
"name": "United States",
"region": {
"id": 5,
"name": "North America"
}
}
],
"regions": [
{
"id": 5,
"name": "North America"
}
],
"has_remote": true,
"published": "2024-04-08T00:00:00Z",
"description": "<p>The E.W. Scripps Company is seeking a Digital Marketing Specialist to assist in the effective execution of promotions and marketing campaigns across multiple channels including, digital, social and email to drive viewership and retention with our product. </p><p></p><p>WHAT YOU'LL DO:</p><ul><li><p>Execute content and marketing promotions to drive viewership, retention and promotion, with a strong focus on digital, social and leading the email program execution, including fostering and growing the email database.</p></li><li><p>Assist in the development and execution of marketing brand strategy and initiatives.</p></li><li><p>Collaborate with cross-functional teams to produce assets and ensure successful marketing initiatives.</p></li><li><p>Organize marketing events, promotions, and campaigns.</p></li><li><p>Support the development and management of marketing materials.</p></li><li><p>Maintain marketing calendars, schedules, marketing performance reports, and budget management and planning documents.</p></li><li><p>Organize meetings and prepare meeting agendas.</p></li><li><p>Prepare and distribute post-meeting notes and team project status documents.</p></li><li><p>Identify and conduct tests to determine ways to optimize the brand experience, especially across digital, social and email.</p></li><li><p>Consistently look at data and analytics and provide recommendations for optimizations, including test &amp; learns and pilot programs.</p></li><li><p>Use best practices and testing to promote the brand to increase brand awareness, consumer reach and sales.</p></li><li><p>Other duties as assigned.</p></li></ul><p></p><p>WHAT YOU'LL NEED:</p><ul><li><p>BS/BA in related discipline or equivalent years of experience preferred</p></li><li><p>Generally, 3+ years of experience in related field preferred</p></li><li><p>Preferred marketing, branding or communications agency experience</p></li><li><p>Experience with marketing tools and digital platforms</p></li><li><p>Experience using data to inform strategy and execution</p></li></ul><p></p><p>WHAT YOU'LL BRING:</p><ul><li><p>Strong copywriting, content creation, data and insights, creative ideation and communications skills</p></li><li><p>Ability to handle a wide variety of tasks and assignments in a dynamic, fast-paced work environment</p></li><li><p>Big picture thinking plus relentless attention to detail</p></li><li><p>Solid strategic input, excellent execution and communication skills</p></li><li><p>Strong project management skills across diverse facets of marketing</p></li></ul><p></p><p>#LI-SM2</p><p>#LI-Remote</p><h1></h1><h1>If you are a current Scripps employee, please do not apply on this site. Please access our internal career site at Worklife &gt; My Info &gt; View Open Positions at Scripps.</h1><p></p><p></p><p></p><p>SCRIPPS' COMMITMENT TO EQUITY, DIVERSITY AND INCLUSION:<br/>At Scripps, we are committed to a diverse and inclusive culture that reflects the communities we serve. We are intentional about creating an environment where employees, our audiences and other stakeholders feel valued and inspired to reach their full potential and make authentic connections. We foster a workplace culture that embraces each person’s diversity, including the extent to which they are similar or different. Scripps leaders believe that an equitable and inclusive culture is not only the right thing to do, it is a business imperative. Read more about our commitment to equity, diversity and inclusion at <a href=\"https://scripps.com/\" rel=\"noopener noreferrer\" target=\"_blank\">scripps.com</a>.</p><p></p><p>ABOUT SCRIPPS:</p><p><a href=\"http://scripps.com/\" rel=\"noopener noreferrer\" target=\"_blank\">The E.W. Scripps Company</a> (NASDAQ: SSP) is a diversified media company focused on creating a better-informed world. As one of the nation’s largest local TV broadcasters, Scripps serves communities with quality, objective local journalism and operates a portfolio of more than 60 stations in 40+ markets. Scripps reaches households across the U.S. with national news outlets Scripps News and Court TV and popular entertainment brands ION, Bounce, Defy TV, Grit, ION Mystery and Laff. Scripps is the nation’s largest holder of broadcast spectrum. Scripps is the longtime steward of the Scripps National Spelling Bee. Founded in 1878, Scripps’ long-time motto is: “Give light and the people will find their own way.”</p><p></p><p>As an equal employment opportunity employer, The E.W. Scripps Company and its affiliates do not discriminate in its employment decisions on the basis of race, sex, sexual orientation, transgender status, gender, color, religion, age, genetic information, medical condition, disability, marital status, citizenship or national origin, and military membership or veteran status, or on any other basis which would be in violation of any applicable federal, state or local law. Furthermore, the company will make reasonable accommodations for qualified individuals with known disabilities unless doing so would result in an undue hardship for the company.</p>",
"experience_level": "MI",
"application_url": "https://scripps.wd5.myworkdayjobs.com/en-US/Scripps_Careers/job/Home-Office---Ohio/Digital-Marketing-Specialist_JR033396",
"language": "en",
"clearance_required": false,
"salary_min": null,
"salary_max": null,
"salary_currency": null
},
{
"id": 5012714,
"ext_id": "5589184",
"company": {
"id": 2339,
"name": "Coupang",
"logo": "https://jobdataapi.com/media/company/logo/22/04/Coupang.jpg",
"website_url": "https://www.coupang.jobs/",
"linkedin_url": "https://www.linkedin.com/company/coupang/",
"twitter_handle": "Coupang",
"github_url": "https://github.com/coupang"
},
"title": "[쿠팡플레이] Growth Marketing Specialist (Play Marketing)",
"location": "Seoul, South Korea",
"types": [
{
"id": 1,
"name": "Full Time"
}
],
"cities": [
{
"geonameid": 1835848,
"asciiname": "Seoul",
"name": "Seoul",
"country": {
"code": "KR",
"name": "South Korea",
"region": {
"id": 2,
"name": "Asia/Pacific"
}
},
"timezone": "Asia/Seoul",
"latitude": "37.56600",
"longitude": "126.97840"
}
],
"countries": [
{
"code": "KR",
"name": "South Korea",
"region": {
"id": 2,
"name": "Asia/Pacific"
}
}
],
"regions": [
{
"id": 2,
"name": "Asia/Pacific"
}
],
"has_remote": false,
"published": "2024-04-06T01:48:21Z",
"description": "<p><strong>회사 소개</strong></p>\n<p>쿠팡은 고객 감동 실현을 위해 존재합니다. 고객들이 \"쿠팡 없이 그동안 어떻게 살았을까?\" 라고 말할 때, 비로소 우리의 미션을 실현하고 있음을 알 수 있습니다. 고객들의 쇼핑과 식사, 생활 전반을 편하게 만들겠다는 유일한 집념으로 쿠팡은 수억 달러 규모의 이커머스 산업 전반의 혁신을 이끌고 있습니다. 쿠팡은 가장 빠르게 성장하는 이커머스 기업 중 하나로, 국내 커머스 업계에서의 독보적인 입지와, 고객 신뢰를 구축했습니다. </p>\n<p>쿠팡은 스타트업 문화를 기반으로 한 글로벌 대형 상장사라고 자부합니다. 이것이 창립 당시의 기민함을 유지하며, 신규 서비스를 끊임없이 출시하며 비즈니스를 확장해 나가는 우리의 성장 동력입니다. 쿠팡의 모든 임직원에게는 기업가 정신을 갖추고 새로운 혁신과 이니셔티브를 추진할 수 있는 기회가 주어집니다. 주저 없이 일에 뛰어들어 성과를 이루고자 하는 과감성이, 바로 쿠팡이 일하는 방식의 본질입니다. 쿠팡에서는 여러분 자신, 동료, 팀 그리고 회사 전체가 매일 성장하는 모습을 목격할 것입니다. </p>\n<p>쿠팡의 모든 직원은 커머스의 미래를 만들겠다는 쿠팡의 미션에 진심입니다. 우리는 고객의 문제를 해결해 나가고, 전통적인 관념과 통념에 맞서며 실현 가능한 한계를 뛰어넘고 있습니다. 고가용성 (always-on) 과 최첨단의 앞선 기술 (high-tech), 초연결사회 (hyper-connected world) 에서의 놀라운 업무 경험을 원하신다면, 지금 바로 쿠팡에 합류하세요. </p>\n<p> </p>\n<p> </p>\n<p><strong>쿠팡플레이 소개</strong></p>\n<p>쿠팡플레이 (Coupang Play)는 2020년 12월 시작한 쿠팡의 OTT (over-the-top) 서비스입니다. 쿠팡플레이는 쿠팡 고객들에게 더 많은 혜택을 제공하기 위한 OTT 서비스로 출범했습니다. 쿠팡플레이는 서울, 싱가포르, 마운틴뷰에 기반을 둔 강력한 PE (Product and Engineering) 팀들과 함께 차별화된 서비스를 만들어 가고 있으며 사랑받는 디지털 엔터테인먼트 플랫폼이 되기 위해 끊임없이 노력하고 있습니다.</p>\n<p>쿠팡플레이는 모바일 디바이스, 태블릿 PC, 스마트 TV, 그리고 시청자가 선호하는 웹 브라우저를 통해 이용할 수 있습니다. 쿠팡플레이의 경쟁력 있는 콘텐츠 라이브러리는 어린이를 포함하여 다양한 취향과 연령에 맞는 TV 시리즈, 영화, 스포츠 중계, 교육 콘텐츠, 등 차별화된 콘텐츠를 제공하고 있습니다. 또한, 더 풍요로운 고객경험을 위해 오리지널 자체 콘텐츠도 제작하고 있습니다.</p>\n<p>쿠팡플레이는 한국에서 가장 빠르게 성장하는 OTT 서비스 중 하나로서 고객이 디지털 엔터테인먼트를 즐기는 방식을 새롭게 정의하고 있습니다. 고객이 원하는 서비스를 만들어가고 복잡한 문제를 해결하는데 관심이 있다면 쿠팡플레이와 함께 하세요</p>\n<p> </p>\n<p> </p>\n<p><strong>팀 소개</strong></p>\n<p>Growth Marketing Team은 쿠팡플레이를 더 많은 고객이, 더 자주 이용할 수 있도록 하는 고객 여정의 전체를 책임집니다. 잠재 고객을 만나는 다양한 접점에서의 꾸준한 유입을 만들고, 유입된 고객이 첫 콘텐츠를 시청할 수 있게 하고, 그 후에도 또 다시 쿠팡플레이를 찾게 하는 일. 이러한 User Acquisition과 Lifecycle 캠페인을 통해 쿠팡플레이를 건강하게 성장 시키는 것이 Growth Marketing의 핵심 업무입니다. </p>\n<p>역동적인 엔터테인먼트 카테고리에서 가장 빠르게 성장하는 쿠팡플레이. 데이터에 기반한 인사이트와 마케터로서의 직관을 함께 발휘하여 지금보다도 더 빠르게 쿠팡플레이를 성장시키고 싶으신 분의 지원을 바랍니다.</p>\n<p> </p>\n<p> </p>\n<p><strong>업무 내용</strong></p>\n<ul>\n<li>다양한 CRM 채널을 통해 고객이 쿠팡플레이를 더 자주 찾고, 더 많은 콘텐츠를 즐기게 하는 일</li>\n<li>CRM 캠페인 운영 및 성과 분석</li>\n<li>Experiments: A/B 테스팅 기획 및 분석</li>\n</ul>\n<p> </p>\n<p> </p>\n<p><strong>자격 및 우대 요건</strong></p>\n<ul>\n<li>최소 5년 이상 CRM 혹은 User Acquisition 캠페인 경험. 혹은 Growth Product Owner 경험</li>\n<li>다양한 고객 세그먼트를 대상으로 타게티드 캠페인을 기획하고 운영 해 본 경험</li>\n<li>고객 활동성 지표를 캠페인의 KPI로 관리 운영해 본 경험</li>\n<li>MAU 5M 이상 프로덕트의 마케팅 경험 - 웹 / 앱 / 기타 디바이스</li>\n<li>프로덕트 조직과 협업하여 Funnel 강화 / CX 개선 등 경험</li>\n<li>콘텐츠, 스포츠 및 엔터테인먼트 산업에 관심이 많으신 분</li>\n<li>비즈니스 레벨 이상의 영어 구사</li>\n<li>신규 툴의 제품 내 온보딩 경험. Braze 등 CRM 툴 운영 경험 우대</li>\n</ul>\n<p> </p>\n<p> </p>\n<p><strong>쿠팡플레이 소개</strong></p>\n<p>쿠팡플레이 (Coupang Play)는 대한민국에서 가장 빠르게 성장하고 있는 쿠팡의 스트리밍 서비스입니다. 2020년 12월 첫 출범한 쿠팡플레이는 서울, 싱가포르, 마운틴뷰 등 다양한 오피스에 기반을 둔 젊고 강력한 글로벌 전문가와 함께 차별화된 서비스를 만들어 가고 있습니다. </p>\n<p>쿠팡플레이는 모바일 디바이스, 태블릿 PC, 스마트 TV, 그리고 시청자가 선호하는 웹 브라우저를 통해 이용할 수 있습니다. 쿠팡플레이의 경쟁력 있는 콘텐츠 라이브러리는 다양한 취향과 연령에 맞도록 TV 시리즈, 영화, 스포츠 중계, 교육 콘텐츠 등 폭넓은 선택지를 제공, 와우회원에게 다채로운 시청경험을 선사하고 있습니다.</p>\n<p> </p>\n<p><strong>성장. 성취. 문제해결. </strong></p>\n<p><strong>이 모든 것에 즐거움을 느끼는 분들의 많은 지원 바랍니다. </strong></p>\n<p><strong> </strong></p>\n<p><strong>팀 소개</strong></p>\n<p>그로스 마케팅 팀은 신규 고객 유입부터 인게이지까지 고객 여정 전 과정을 데이터와 테스팅을 통해 개선하고 강화하며 쿠팡플레이 비즈니스를 빠르고 건강하게 성장시킵니다. </p>\n<p>다양한 채널을 통해 잠재 고객을 꾸준히 유입시키고, 그들을 가입과 시청으로 전환시키고, 또 다시 쿠팡플레이를 찾도록 하는 일. 그로스 마케팅 팀은 다양한 채널에서 이루어지는 다양한 캠페인을 기획, 운영하고 최적화 하는 일을 합니다.  </p>\n<p> </p>\n<p> </p>\n<p><strong>업무 내용</strong></p>\n<ul>\n<li>User Acquisition Campaign - 전환 극대화 목적의 다양한 디지털 캠페인을 기획, 운영, 성과 분석 하는 일</li>\n<li>CRM Campaign - CRM 채널을 통하여 고객 시청 빈도를 강화하는 캠페인을 기획, 운영, 성과 분석 하는 일</li>\n<li>Product Marketing - 쿠팡플레이의 핵심 Product Feature를 고객에게 알리고 더 많이 사용하게 하는 일</li>\n<li>Experiments - 캠페인의 성과 개선을 위해 A/B 테스팅을 기획하고 그를 통해 인사이트를 도출하는 일</li>\n</ul>\n<p> </p>\n<p> </p>\n<p><strong>자격 요건 </strong></p>\n<ul>\n<li><strong>최소 6년 이상 12년 미만의 Growth Marketing 혹은 Growth Product Owner 경험</strong></li>\n<li>다음  중 최소 1개 이상 경험 있으신 분\n<ul>\n<li>구글, 메타 등 핵심 퍼포먼스 미디어를 활용한 컨버젼 캠페인 운영 경험 </li>\n<li>CRM 채널(App push, In-app Push, MMS, eDM 등)을 활용한 캠페인 운영 경험</li>\n</ul>\n</li>\n<li>프로덕트 조직과 협업하여 CX Funnel를 개선, 강화 해 본 경험</li>\n<li>프로덕 사용 주기, 사용량 등 제품 내 활동성 지표 개선하기 위한 캠페인 기획/운영 경험</li>\n<li>시리즈, 영화, 스포츠 등 다양한 콘텐츠를 폭넓게 시청하시는 분 </li>\n<li>데이터 기반의 논리적 사고 능력을 가지신 분</li>\n<li>명확한 커뮤니케이션 능력 </li>\n</ul>\n<p> </p>\n<p> </p>\n<p><strong>우대 사항</strong></p>\n<ul>\n<li>MAU 5백만명 이상 프로덕트를 대상으로 마케팅 경험 - 웹 / 앱 / 기타 디바이스</li>\n<li>스타트업 혹은 테크 카테고리 근무 경험</li>\n<li>Braze 혹은 기타 CRM 툴 활용 숙련자</li>\n<li>비즈니스 레벨 이상의 영어 구사 – Written, Verbal</li>\n</ul>\n<p> </p>\n<p> </p>\n<p><strong>Culture Fit</strong></p>\n<ul>\n<li>Problem Solver. Self-Starter </li>\n</ul>\n<p> </p>\n<p> </p>\n<p><strong>전형 절차 및 안내 사항  </strong><strong>   </strong>  </p>\n<p><strong>전형 절차  </strong>  </p>\n<ul>\n<li>서류전형 - 1차 화상 면접 - 2차 화상면접 -  최종 합격   </li>\n<li>전형 절차는 직무별로 다르게 운영될 수 있으며, 일정 및 상황에 따라 변동될 수 있습니다. </li>\n<li>전형 일정 및 결과는 지원서에 등록하신 이메일로 개별 안내드립니다.<br/><br/></li>\n</ul>\n<p><strong>참고 사항  </strong>  </p>\n<ul>\n<li>본 공고는 모집 완료 시 조기 마감될 수 있습니다.    </li>\n<li>지원서 내용 중 허위사실이 있는 경우에는 합격이 취소될 수 있습니다.  </li>\n<li>보훈대상자 및 장애인 여부는 채용 과정에서 어떠한 불이익도 미치지 않습니다. </li>\n<li>직급과 담당 업무 범위는 후보자의 전반적인 경력과 경험 등 제반 사정을 고려하여 변경될 수 있습니다. 이러한 변경이 필요할 경우, 최종 합격 통지 전 적절한 시기에 후보자와 커뮤니케이션 될 예정입니다.</li>\n</ul>\n<p> <strong><br/>개인정보 처리방침  </strong>  </p>\n<ul>\n<li>쿠팡 그룹은 입사지원자 개인정보 처리방침(아래 링크)에 따라 귀하의 개인정보를 수집하여 처리합니다.   <a href=\"https://www.coupang.jobs/kr/privacy-policy/\">https://www.coupang.jobs/kr/privacy-policy/  </a> </li>\n</ul>\n<p> </p>\n<p><strong>서류 반환 정책 </strong>  </p>\n<ul>\n<li>본 고지는 『채용절차의 공정화에 관한 법률』 제11조 제6항에 따른 것입니다.  </li>\n<li>당사 채용에 응시한 구직자 중 최종 합격이 되지 못한 구직자는 『채용절차의 공정화에 관한 법률』에 따라 제출한 채용서류의 반환을 청구할 수 있음을 알려 드립니다. 다만, 홈페이지 또는 전자우편으로 제출된 경우나 구직자가 당사의 요구 없이 자발적으로 제출한 경우에는 그러하지 아니하며, 천재지변이나 그 밖에 당사에게 책임 없는 사유로 채용서류가 멸실된 경우에는 반환한 것으로 봅니다.  </li>\n<li>위 2항 본문에 따라 채용서류 반환 청구를 하는 구직자는 채용서류 반환청구서 [채용절차의 공정화에 관한 법률 시행규칙 별지 제3호 서식]를 작성하여 이메일 (recruitingops@coupang.com)로 제출하면, 제출이 확인된 날로부터 14일 이내에 지정한 주소지로 등기우편을 통하여 발송해 드립니다. 이 경우 등기우편요금은 수신자 부담으로 하게 되오니 유념하시기 바랍니다.  </li>\n<li>당사는 위 2항 본문에 따른 구직자의 반환 청구에 대비하여 채용 여부가 확정된 날로부터 180일간 구직자가 제출한 채용서류 원본을 보관하게 되며, 그때까지 채용서류의 반환을 청구하지 아니할 경우에는 『개인정보 보호법』에 따라 지체 없이 채용서류 일체를 파기할 예정입니다. </li>\n<li>채용 및 업무 수행과 관련하여 요구되는 법령상 자격이 갖추어지지 않은 경우 채용이 제한될 수 있습니다. </li>\n</ul>\n<p> </p>\n<p> </p>\n<p class=\"footer-end-text-header\"><strong>쿠팡은 모두에게 공평한 기회를 제공합니다</strong></p>\n<p class=\"footer-end-text\">쿠팡은 어느 누구에게나 열려 있는 회사입니다. 다양한 국가 출신 임직원이 함께 일하는 글로벌팀이 없었더라면 전례없는 성공을 이루기 어려웠을 겁니다.</p>",
"experience_level": "SE",
"application_url": "https://www.coupang.jobs/en/jobs/?gh_jid=5589184",
"language": "ko",
"clearance_required": false,
"salary_min": null,
"salary_max": null,
"salary_currency": null
},
{
"id": 5013922,
"ext_id": "38921b7a-07a9-4149-b6c5-848eea39d2c4",
"company": {
"id": 2224,
"name": "Top Hat",
"logo": "https://jobdataapi.com/media/company/logo/22/03/TopHat.jpg",
"website_url": "https://tophat.com/",
"linkedin_url": "https://www.linkedin.com/company/top-hat-hq/",
"twitter_handle": "TopHat",
"github_url": null
},
"title": "Lifecycle Marketing Specialist",
"location": "Toronto, Ontario",
"types": [
{
"id": 1,
"name": "Full Time"
}
],
"cities": [
{
"geonameid": 6167865,
"asciiname": "Toronto",
"name": "Toronto",
"country": {
"code": "CA",
"name": "Canada",
"region": {
"id": 5,
"name": "North America"
}
},
"timezone": "America/Toronto",
"latitude": "43.70011",
"longitude": "-79.41630"
},
{
"geonameid": 5379439,
"asciiname": "Ontario",
"name": "Ontario",
"country": {
"code": "US",
"name": "United States",
"region": {
"id": 5,
"name": "North America"
}
},
"timezone": "America/Los_Angeles",
"latitude": "34.06334",
"longitude": "-117.65089"
}
],
"countries": [
{
"code": "CA",
"name": "Canada",
"region": {
"id": 5,
"name": "North America"
}
}
],
"regions": [
{
"id": 5,
"name": "North America"
}
],
"has_remote": false,
"published": "2024-04-05T19:57:45Z",
"description": "Top Hat's dynamic courseware empowers educators and students by delivering personalized, meaningful and equitable learning in every course. Providing educators with interactive course content, tools, assessment capabilities, and insights in a single, easy-to-use application.<br/>Millions of students at 750 leading North American colleges and universities use Top Hat to teach and engage with students before, during, and after class, in both in-person and online education. Are you ready to help us change the future of higher ed and deliver equitable education for millions of students?<br/>Top Hat is looking for a Lifecycle Marketing Specialist to create and launch educator and student marketing programs to nurture, acquire and retain existing and prospective customers.\n<h3>In this role, you will</h3>\n<ul>\n<li>Work with marketing team members to develop and implement programs for email, in-app, and other digital marketing channels for all of our product lines.</li><li>Develop and execute email nurture programs to ensure leads and customers are moving through the funnel efficiently.</li><li>Help execute existing email marketing programs by writing, building, and designing emails as necessary.</li><li>Run channel A/B tests to optimize program performance and report on results.</li><li>Help maintain database hygiene and support the team’s requests for various segmentation tasks.</li><li>Measure, analyze, and report on program performance and share actionable insights to drive ongoing improvements.</li><li>Leverage Salesforce Marketing Cloud to drive greater segmentation and email execution efficiency for the entire marketing team.</li><li>Work cross-functionally with our Marketing Operations, Brand and Creative, and Product Marketing teams.</li></ul>\n<h3>You have:</h3>\n<ul>\n<li>1+ years of marketing experience, SaaS is a plus!</li><li>You have hands-on experience in a marketing automation platform: Salesforce Marketing Cloud, Hubspot, Eloqua or Pardot.</li><li>Strong fundamentals in email and in-app marketing, with an eye for optimized program performance and design.</li><li>An understanding of front-end development languages, mainly HTML &amp; CSS.</li><li>The discipline to follow a QA process to ensure successful campaign &amp; program launches.</li><li>The ability to put the customer experience at the forefront of everything by minimizing friction and creating an exceptional experience.</li><li>The drive to get the most out of technology and leverage platforms (like Salesforce) to its fullest potential.</li></ul>Why team members love working at Top Hat :<br/>*A noble mission that creates meaningful, fulfilling work*A team that cares deeply for customers and for each other*We’re a company of invested owners - every Top Hatter receives stock options*Professional learning and development for all role levels*An awesome and welcoming Toronto HQ, and a growing sales hub in Austin, Texas*Competitive health benefits that start on day one*A management team focused on performance, growth, engagement and connection*Our winning strategy and market potential*Innovative PTO policy with lots of time and space for self-care*Passionate customers that believe in us—and what we do",
"experience_level": "EN",
"application_url": "https://jobs.lever.co/tophat/38921b7a-07a9-4149-b6c5-848eea39d2c4",
"language": "en",
"clearance_required": false,
"salary_min": null,
"salary_max": null,
"salary_currency": null
},
{
"id": 5021757,
"ext_id": "743999978730943",
"company": {
"id": 3827,
"name": "Informa Group Plc.",
"logo": "https://jobdataapi.com/media/company/logo/22/10/AU1W13oq_400x400.png",
"website_url": "https://www.informa.com",
"linkedin_url": "https://www.linkedin.com/company/informa",
"twitter_handle": "informaplc",
"github_url": null
},
"title": "Digital Marketing Specialist- Hybrid",
"location": "Irving, TX, United States",
"types": [
{
"id": 1,
"name": "Full Time"
}
],
"cities": [
{
"geonameid": 4700168,
"asciiname": "Irving",
"name": "Irving",
"country": {
"code": "US",
"name": "United States",
"region": {
"id": 5,
"name": "North America"
}
},
"timezone": "America/Chicago",
"latitude": "32.81402",
"longitude": "-96.94889"
}
],
"countries": [
{
"code": "US",
"name": "United States",
"region": {
"id": 5,
"name": "North America"
}
}
],
"regions": [
{
"id": 5,
"name": "North America"
}
],
"has_remote": false,
"published": "2024-04-05T18:19:55.850000Z",
"description": "<h3>Company Description</h3><p>There's no such thing as a typical Informa colleague…And that's how we like it. We're a diverse Group, with over 10,000 colleagues working in many different roles in one of six Divisions and in over 30 countries. Each of us brings something different, a unique set of abilities, experience and knowledge. It’s what makes us who we are.</p><p>All our businesses and offices share a culture based on respect and inclusiveness, and a working environment that is enjoyable, stimulating, rewarding and supportive for colleagues. One that enables everyone to fully participate in the life of the Group and its ongoing, sustainable growth.</p><p>As a division of Informa, a FTSE 100 company, Informa Markets provides customers and partners around the globe with opportunities to engage, experience and do business through live, virtual and hybrid events, specialist digital content and actionable data solutions.</p><p>People are at the heart of Informa Markets. Our business thrives on the passion and entrepreneurship of our 4,000+ colleagues, who deliver over 500 international events and brands in more than 40 countries across the globe.</p><p>Using our industry insight, comprehensive portfolio of markets, content and digital resources, we are passionate about creating platforms for our customers to connect and shaping environments that enable businesses to flourish.</p><h3>Job Description</h3><p><strong>About this job &amp; how you can make an impact:</strong></p><p><strong>Your curiosity and sharp insights will help you pave the way in this role within the Informa Market’s Infrastructure &amp; Construction group. </strong>We’re seeking a full-time Digital Marketing Specialist who will primarily oversee digital marketing activities for our sales audience for a group of events, media brands, and new product launches. You will be responsible for developing, executing, and measuring digital marketing programs to drive our sales audience growth strategies. This role requires an in-depth understanding of our customers and industries and a strong B2B marketing knowledge to build effective campaigns, deliver critical insights and achieve business goals.</p><p><strong>Key Responsibilities:</strong></p><ul><li>Develop data-driven B2B sales audience growth strategies that leverage both paid and organic acquisition channels, working with key stakeholders on defining priority channels, partners, and target audiences to drive leads, increase sales and boost engagement</li><li>Set and track key performance metrics that align with business objectives; present and communicate progress against KPIs to key stakeholders on a regular basis</li><li>Plans and executes sales email marketing programs, including segmentation, email setup, deployment, and reporting, using features including dynamic content and multi-step campaigns</li><li>Plans and executes sales social media marketing campaigns, including set up, segmentation, deployment and reporting  </li><li>Track progress and drive continuous improvement to marketing funnels via analysis and optimization; identify and validate improvements through research, internal/external feedback, best practices, and various testing methodologies (e.g., A/B)</li><li>Analyze campaign performance and deliver actionable insights and recommendations to improve future performance, efficiency, and spend</li><li>Continuous website updates to sales areas, including, but not limited to, tailored website experiences based on customer behavior, journey, technology, and demographics</li><li>Manages the sales and exhibtior sections of websites and analytics, including monitoring traffic, sources, conversions, and KPIs</li><li>Work with brand managers and other stakeholders to implement and improve SEO strategies to foster organic site growth of the sales audience for our event and media publishing sites</li><li>Establishes benchmarks across all digital campaigns to monitor campaign and performance</li><li>Travel to industry events as needed</li><li>Special projects as needed</li></ul><h3>Qualifications</h3><p><strong>What you bring to the team:</strong></p><ul><li>Bachelor’s degree in marketing/advertising or database management or equivalent work experience</li><li>At least 4-5 years experience in digital marketing campaign management and audience management, preferably with B2B audiences</li><li>Demonstrable experience leading and managing SEO/SEM, marketing database, email, social media, and/or display advertising campaigns</li><li>Previous experience in Eloqua or other automated marketing email platforms</li><li>Experience with A/B and multivariate experiments</li><li>Solid knowledge of website and marketing analytics tools (e.g., Google Analytics, Adobe Analytics, NetInsight, Omniture, WebTrends, SEMRush, etc.)</li><li>Previous experience in CMSs, Adobe Experience Manager and Drupal preferred</li><li>Previous experience with Salesforce a plus</li><li>Excellent attention to detail and organizational skills required</li><li>Experience with Adobe Creative Suite (e.g. Photoshop, Illustrator) preferred</li><li>Project management skills: Capable of multi-tasking and managing several projects at a time</li></ul><ul><li>Excellent written and oral communication skills</li><li>Analytical mindset with numerical aptitude</li><li>Initiative, ambition, self-direction, problem-solving and a deep sense of curiosity</li><li>The pay range for this position is $28/hr - $33/hr depending on experience </li><li>This posting will expire on 4/28/24</li></ul><h3>Additional Information</h3><p>Why work at Informa?</p><p>Employee experience is very important to us at Informa. On top of joining a supportive, diverse and ambitious team that welcomes all types of candidates. We are also flexible with different working patterns and prioritizes promotions internally. Our benefits include:</p><ul><li>Learning and development plan to assist with your career development </li><li>15 days PTO plus 4 days for volunteering and a day off for your birthday! </li><li>Competitive Benefits</li><li>Paid parental leave</li><li>Work with a high quality of specialist products and service </li><li>Bright and friendly staff who are all “expert’s experts” and additional training and development for helping you achieve your career aspiration </li></ul><p>We know that sometimes the 'perfect candidate' doesn't exist, and that people can be put off applying for a job if they don't fit all the requirements. If you're excited about working for us and have most of the skills or experience we're looking for, please go ahead and apply. You could be just what we need! We believe strongly in the value of diversity and creating supportive, inclusive environments where our colleagues can succeed.  As such, Informa is proud to be an Equal Opportunity Employer.  We do not discriminate on the basis of race, color, ancestry, national origin, religion, or religious creed, mental or physical disability, medical condition, genetic information, sex (including pregnancy, childbirth, and related medical conditions), sexual orientation, gender identity, gender expression, age, marital status, military or veteran status, citizenship, or other protected characteristics under federal, state or local law.</p><p> </p><p>See how Informa handles your personal data when you apply for a job here.</p>",
"experience_level": null,
"application_url": "https://jobs.smartrecruiters.com/InformaGroupPlc/743999978730943-digital-marketing-specialist-hybrid",
"language": "en",
"clearance_required": false,
"salary_min": "56000",
"salary_max": "66000",
"salary_currency": "USD"
},
{
"id": 5012254,
"ext_id": "5882519",
"company": {
"id": 9,
"name": "Cloudflare, Inc.",
"logo": "https://jobdataapi.com/media/company/logo/20/03/cloudflare.png",
"website_url": "https://www.cloudflare.com/",
"linkedin_url": null,
"twitter_handle": "cloudflare",
"github_url": "https://github.com/cloudflare"
},
"title": "Field Marketing Specialist, Benelux and Nordics (Fixed-Term)",
"location": "Amsterdam, Netherlands",
"types": [
{
"id": 1,
"name": "Full Time"
},
{
"id": 3,
"name": "Temporary"
}
],
"cities": [
{
"geonameid": 2759794,
"asciiname": "Amsterdam",
"name": "Amsterdam",
"country": {
"code": "NL",
"name": "Netherlands",
"region": {
"id": 3,
"name": "Europe"
}
},
"timezone": "Europe/Amsterdam",
"latitude": "52.37403",
"longitude": "4.88969"
}
],
"countries": [
{
"code": "NL",
"name": "Netherlands",
"region": {
"id": 3,
"name": "Europe"
}
}
],
"regions": [
{
"id": 3,
"name": "Europe"
}
],
"has_remote": false,
"published": "2024-04-05T18:17:16Z",
"description": "<strong>About Us</strong>\n<p>At Cloudflare, we have our eyes set on an ambitious goal: to help build a better Internet. Today the company runs one of the world’s largest networks that powers approximately 25 million Internet properties, for customers ranging from individual bloggers to SMBs to Fortune 500 companies. Cloudflare protects and accelerates any Internet application online without adding hardware, installing software, or changing a line of code. Internet properties powered by Cloudflare all have web traffic routed through its intelligent global network, which gets smarter with every request. As a result, they see significant improvement in performance and a decrease in spam and other attacks. Cloudflare was named to Entrepreneur Magazine’s Top Company Cultures list and ranked among the World’s Most Innovative Companies by Fast Company. </p>\n<p>We realize people do not fit into neat boxes. We are looking for curious and empathetic individuals who are committed to developing themselves and learning new skills, and we are ready to help you do that. We cannot complete our mission without building a diverse and inclusive team. We hire the best people based on an evaluation of their potential and support them throughout their time at Cloudflare. Come join us! </p>\n<p><strong>This is a fixed-term 11 months role.</strong></p>\n<p><strong>About the Role</strong></p>\n<p>We are looking for a Field Marketing Associate to support marketing efforts in the Benelux and Nordics. Working closely with the regional Marketing Manager for Northern Europe, you will help to create, deliver and execute impactful marketing programs to drive awareness and develop qualified pipeline for Cloudflare’s sales team — specifically targeting Enterprise, Field and Mid-Market accounts within the region. In this position you’ll positively contribute to developing and executing campaigns and events to generate leads that contribute to sales pipeline, revenue and brand awareness.</p>\n<p>The right candidate will have a builder mindset, a strong knowledge of B2B demand generation best practices, be digitally savvy, have a natural inclination to measure the effectiveness of marketing activities, strong project management skills, and the ability to drive program execution while managing the expectations of various stakeholders.</p>\n<p><strong>Key Responsibilities</strong></p>\n<ul>\n<li>Reporting into the Northern Europe Field Marketing Manager, based in the UK</li>\n<li>Demand generation – Work closely with the EMEA Centers of Excellence, EMEA Business Development Team and EMEA Sales Team to support demand and lead generation programs for Benelux and Nordics ensuring operational success</li>\n<li>Design and execute on regional marketing activities to excite and enable sales teams and ensure growth in the region. Activities to include but not limited to; events, direct mailers, webinars, call-out campaigns, digital, email campaigns, content development, brand awareness</li>\n<li>Events - Work closely with the EMEA Events team to identify appropriate events across target markets, ensure success of events from messaging, branding, promotions, and follow-up.</li>\n<li>Manage supporting logistics for field events &amp; webinars, including printing, promotional items, supporting materials, shipping and receiving, as well as supporting on site.</li>\n<li>Optimise, research and assess new ways to drive new leads, leveraging various media, targeted lists, scheduled meeting programs and other opportunities</li>\n<li>Support and track regional success of partner activities (lead generations, opportunities created)</li>\n<li>Provide regular reporting cadence on all marketing activities to track performance, contribution to pipeline and ROI, and adjust where necessary</li>\n<li>Execute inbound and outbound marketing campaigns targeting specific personas to increase awareness of Cloudflare and generate demand, thereby contributing to pipeline and revenue for the region.</li>\n<li>Manage development of localised demand generation assets with content and product marketing</li>\n</ul>\n<p><strong>Required skills, knowledge and experience</strong></p>\n<ul>\n<li>Excellent written and verbal communication skills </li>\n<li>3+ years of events and field marketing with campaign execution, ideally in the Benelux or Nordic Previous experience in field marketing to large enterprise prospects, ideally within B2B SaaS or cyber security </li>\n<li>Knowledge and experience of Salesforce</li>\n<li>Data-driven marketer who has the passion to learn best practices from the industry and implement in campaign strategies</li>\n<li>Exceptional organizational skills, with rigorous attention to detail</li>\n<li>Ability to work effectively in a fast-paced and ever-changing environment with tight deadline</li>\n<li>Skills in effective outreach messaging and content creation</li>\n<li>Excellent written and verbal communication skills and stellar presentation skills</li>\n<li>Preferred but not required: Knowledge of the Benelux or Nordics markets </li>\n</ul>\n<p><strong>Other attributes:</strong></p>\n<ul>\n<li>Motivated, positive and above all a team player</li>\n<li>Extreme curiosity</li>\n<li>Builder mindset</li>\n</ul><p><strong>What Makes Cloudflare Special?</strong></p>\n<p>We’re not just a highly ambitious, large-scale technology company. We’re a highly ambitious, large-scale technology company with a soul. Fundamental to our mission to help build a better Internet is protecting the free and open Internet.</p>\n<p><a href=\"https://blog.cloudflare.com/protecting-free-expression-online/\"><strong>Project Galileo</strong></a>: We equip politically and artistically important organizations and journalists with powerful tools to defend themselves against attacks that would otherwise censor their work, technology already used by Cloudflare’s enterprise customers--at no cost.</p>\n<p><strong><a href=\"https://www.cloudflare.com/athenian/\">Athenian Project</a></strong>: We created Athenian Project to ensure that state and local governments have the highest level of protection and reliability for free, so that their constituents have access to election information and voter registration.</p>\n<p><a href=\"https://blog.cloudflare.com/tag/path-forward/\"><strong>Path Forward Partnership</strong></a>: Since 2016, we have partnered with Path Forward, a nonprofit organization, to create 16-week positions for mid-career professionals who want to get back to the workplace after taking time off to care for a child, parent, or loved one.</p>\n<p><a href=\"https://1.1.1.1/\"><strong>1.1.1.1</strong></a>: We released<a href=\"https://1.1.1.1/\"> 1.1.1.1</a> to help fix the foundation of the Internet by building a faster, more secure and privacy-centric public DNS resolver. This is available publicly for everyone to use - it is the first consumer-focused service Cloudflare has ever released. Here’s the deal - we don’t store client IP addresses never, ever. We will continue to abide by our<a href=\"https://developers.cloudflare.com/1.1.1.1/privacy/public-dns-resolver\"> privacy commitment</a> and ensure that no user data is sold to advertisers or used to target consumers.</p>\n<p>Sound like something you’d like to be a part of? We’d love to hear from you!</p>\n<p>This position may require access to information protected under U.S. export control laws, including the U.S. Export Administration Regulations. Please note that any offer of employment may be conditioned on your authorization to receive software or technology controlled under these U.S. export laws without sponsorship for an export license.</p>\n<p>Cloudflare is proud to be an equal opportunity employer.  We are committed to providing equal employment opportunity for all people and place great value in both diversity and inclusiveness.  All qualified applicants will be considered for employment without regard to their, or any other person's, perceived or actual race, color, religion, sex, gender, gender identity, gender expression, sexual orientation, national origin, ancestry, citizenship, age, physical or mental disability, medical condition, family care status, or any other basis protected by law. We are an AA/Veterans/Disabled Employer.</p>\n<p>Cloudflare provides reasonable accommodations to qualified individuals with disabilities.  Please tell us if you require a reasonable accommodation to apply for a job. Examples of reasonable accommodations include, but are not limited to, changing the application process, providing documents in an alternate format, using a sign language interpreter, or using specialized equipment.  If you require a reasonable accommodation to apply for a job, please contact us via e-mail at hr@cloudflare.com or via mail at 101 Townsend St. San Francisco, CA 94107.</p>",
"experience_level": "SE",
"application_url": "https://boards.greenhouse.io/cloudflare/jobs/5882519?gh_jid=5882519",
"language": "en",
"clearance_required": false,
"salary_min": null,
"salary_max": null,
"salary_currency": null
},
{
"id": 5019391,
"ext_id": "9202247110232_1",
"company": {
"id": 22900,
"name": "ServiceMaster",
"logo": "https://jobdataapi.com/media/company/logo/24/02/servicemaster_logo.jpeg",
"website_url": "https://www.servicemaster.com/",
"linkedin_url": "https://www.linkedin.com/company/servicemasterbrands/",
"twitter_handle": null,
"github_url": null
},
"title": "Marketing Specialist",
"location": "REMOTE - United States, Remote, US",
"types": [
{
"id": 1,
"name": "Full Time"
}
],
"cities": [],
"countries": [
{
"code": "US",
"name": "United States",
"region": {
"id": 5,
"name": "North America"
}
}
],
"regions": [
{
"id": 5,
"name": "North America"
}
],
"has_remote": true,
"published": "2024-04-05T18:14:00Z",
"description": "<p id=\"isPasted\"><strong><em>Ready to be part of a dynamic and growing company?</em></strong></p><p>Merry Maids is looking for talented people to join our team! Come join SMB where we promote from within.</p><p><br/></p><p><strong><u>Marketing Specialist</u></strong></p><p>Merry Maids is currently looking for a Marketing Specialist to contribute to the development, design, planning, and implementation of marketing promotions and campaigns with the goal of supporting system wide sales. In this role, you'll have the opportunity to coordinate, implement, and support marketing projects, processes, and programs, especially for the marketing and sales enablement of the franchise network. A significant  part of your role will be consulting with franchisees on phone calls or online meetings, where you will have the opportunity to impact change at a local level. You will work with third-party business partners and agencies to develop and produce marketing materials, and facilitate and coordinate the approval, production schedule, invoicing, and inventory of marketing materials.</p><br/><p><strong>What you'll do:</strong></p><ul><li>Guide local marketing strategy and advise franchisees on tactics and budget applicable to their unique market utilizing the approved marketing mix. </li><li>Consult with franchisees to support local marketing initiatives and lead generation programs.</li><li>Monitor marketing support requests daily.</li><li>Coordinate, implement, and support marketing projects, processes, and programs.</li><li>Coordinate with third-party business partners and agencies to develop and produce marketing materials.</li><li>Facilitate and coordinate the approval, production schedule, invoicing and reimbursement requests, and inventory of marketing materials.</li><li>Gather and report sales and marketing data, and help franchisees understand their local marketing analytics.</li><li>Serve as internal SME on specific areas of marketing (e.g., branding, local marketing,, etc.).</li><li>Develop, execute, and measure brand gift card initiative, encouraging research participation, and ensure successful franchise adoption of programs.</li><li>Manage monthly invoices, accruals, and financial reports and keep records for tracking.</li><li>Contribute to the development, design, planning and implementation of marketing promotions and themes.</li><li>Participate in events, webinars, conferences, etc. as relevant to role </li></ul><p> </p><p> <strong>What you bring:</strong></p><ul><li>Knowledge of marketing and a basic understanding of print production</li><li>Communication or customer support experience preferred</li><li>Project management skills</li><li>Computer skills with Microsoft Office (Word, Excel, PowerPoint, Outlook); with a heavy emphasis on Excel and PowerPoint</li><li>Computer skills with Dropbox, Smartsheet, and SharePoint a plus</li><li>Ability to prioritize multiple projects </li><li>Bachelor’s degree in a related field </li><li>1-2 years of marketing experience, or equivalent education</li></ul><p><strong> </strong></p><p><strong>Work Location: </strong></p><p>This is 100% remote role with up to 10% travel required.</p><p> </p><p><strong>About Merry Maids®</strong></p><p>Merry Maids is the largest home cleaning franchise network in the United States. Merry Maids provides services in 48 states and the District of Columbia through approximately 450 company-owned locations and franchised outlets. The company also provides home cleaning services in Canada, Ireland and the United Kingdom and has licensing arrangements whereby licensees provide these services in Hong Kong, Japan, South America, South Korea, Southeast Asia and Australia. Through its company-owned and franchise locations, Merry Maids employs more than 8,000 home cleaning professionals that service homes on four continents, including more than 200,000 homes in North America every month. Merry Maids is a business unit of ServiceMaster Brands, a leading provider of essential residential and commercial services. Go to www.merrymaids.com for more information about Merry Maids or follow us at twitter.com/MerryMaids and facebook.com/MerryMaids.</p><p><strong>About ServiceMaster Brands</strong></p><p>ServiceMaster® Brands® is a leading franchise provider of needs-based residential and commercial services in the restoration, cleaning, moving, and bioremediation industries. Founded in 1929, the company is home to over 3,200 franchisees across 4,600+ locations serving over 1,000,000 homes and businesses each year. ServiceMaster was founded with a deep commitment to integrity and customer service and does business under seven brands today across 50 states and nine countries that generate more than $3.5B in system-wide sales: ServiceMaster Restore®, ServiceMaster Clean®, Merry Maids®, TWO MEN AND A TRUCK®, Aftermath Services®, Indoor Science.</p><p>While each brand maintains a distinct identity, we share a commitment to our mission to <strong>Making Everyday Heroes More Heroic</strong>™. From our franchisee experience to career development to our community outreach efforts, our values – <strong>We Serve, We Care, We Deliver, We Do</strong> - guide us.</p><p>Working as part of our team means bringing your best ideas to work every day and seeing the impact of your contributions. Stars in our company at all levels are builders—they love to create, lead and see their plan come to life. Our best people understand that while great ideas are important, they require incredible focus and teamwork to execute. Life inside our company is the opportunity to do the best work of your career.</p><p>ServiceMaster Brands is headquartered in Atlanta, Georgia.</p><p>Roark Capital Group acquired ServiceMaster Brands in October 2020. Roark focuses on investing in the consumer and business services sectors, with a specialization in multi-location and franchised businesses. Since inception, affiliates of Roark have invested in 100 multi-location, franchised brands, which collectively generate $62 billion in annual system revenues from 66,000 locations in 50 states and 89 countries. Please visit www.roarkcapital.com to learn more.</p><p><em>It is the policy of ServiceMaster Brands, in accordance with all applicable laws, to recruit, hire, train, and promote persons in all job titles without regard to race, color, national origin, genetic information, religious beliefs, sex, gender identity, sexual orientation, age, marital status, pregnancy, disability, protected veteran status, or any other protected classifications, activities, or conditions as required by federal, state and local laws.</em><em> </em></p><p> </p>",
"experience_level": "MI",
"application_url": "https://workforcenow.adp.com/mascsr/default/mdf/recruitment/recruitment.html?cid=8810b829-9150-4ee3-8d66-0c5686b6d449&jobId=502529",
"language": "en",
"clearance_required": false,
"salary_min": null,
"salary_max": null,
"salary_currency": null
},
{
"id": 5016084,
"ext_id": "gZ-oEVZ6libu",
"company": {
"id": 12134,
"name": "Simera",
"logo": "https://jobdataapi.com/media/company/logo/23/11/simera_human_capital_llc_logo.jpeg",
"website_url": "https://simera.io/",
"linkedin_url": "https://www.linkedin.com/company/simera-human-capital-llc",
"twitter_handle": null,
"github_url": null
},
"title": "Digital Marketing Specialist GT (Remote)",
"location": "San Francisco, United States of America",
"types": [
{
"id": 1,
"name": "Full Time"
}
],
"cities": [
{
"geonameid": 5391959,
"asciiname": "San Francisco",
"name": "San Francisco",
"country": {
"code": "US",
"name": "United States",
"region": {
"id": 5,
"name": "North America"
}
},
"timezone": "America/Los_Angeles",
"latitude": "37.77493",
"longitude": "-122.41942"
}
],
"countries": [
{
"code": "US",
"name": "United States",
"region": {
"id": 5,
"name": "North America"
}
}
],
"regions": [
{
"id": 5,
"name": "North America"
}
],
"has_remote": true,
"published": "2024-04-05T17:10:15Z",
"description": "Unlock your remote work journey: you shine, we match you! Once you apply, you will be receiving your profile link in the next 24hrs. After applying you will need to complete your profile, receive follow-ups from our talent advisors, and our AI platform will do the rest. <br/><strong>Summary:</strong><br/>We are looking for a highly motivated and skilled Marketing Specialist with expertise in content writing, SEO strategies, and executing lead generation campaigns. The ideal candidate will have a passion for creating engaging content, optimizing it for search engines, and converting leads into customers through strategic marketing initiatives.<br/><strong>Key Responsibilities</strong><br/><ul><li>Develop and implement comprehensive content marketing strategies to attract and engage our target audience.</li><li>Create high-quality, compelling content for various channels including website, blog posts, social media, email campaigns, and more.</li><li>Conduct keyword research and optimize content for search engines to improve organic visibility and drive traffic.</li><li>Manage and execute lead generation campaigns across multiple platforms to capture and nurture leads throughout the sales funnel.</li><li>Analyze campaign performance metrics and make data-driven recommendations to optimize marketing efforts and maximize ROI.</li><li>Collaborate with cross-functional teams including Sales, Product, and Design to ensure alignment of marketing initiatives with overall business objectives.</li><li>Stay updated on industry trends, best practices, and emerging technologies in content marketing, SEO, and lead generation.</li></ul><br/><strong>Qualifications</strong><br/><ul><li>Bachelor's degree in Marketing, Communications, or a related field</li><li>2+ years of in content writing, SEO, and executing lead generation campaigns.</li><li>Strong understanding of SEO principles and best practices.</li><li>Excellent written and verbal communication skills with a keen eye for detail.</li><li>Proficiency in using SEO tools such as Google Analytics, SEMrush, Moz, etc.</li><li>Ability to work independently and manage multiple projects simultaneously.</li><li>Analytical mindset with the ability to interpret data and draw actionable insights.</li><li>Creative thinker with a passion for storytelling and driving results through innovative marketing strategies.</li></ul>",
"experience_level": "MI",
"application_url": "https://simera-talent.freshteam.com/jobs/gZ-oEVZ6libu/digital-marketing-specialist-gt-remote",
"language": "en",
"clearance_required": false,
"salary_min": null,
"salary_max": null,
"salary_currency": null
},
{
"id": 5020990,
"ext_id": "743999978692253",
"company": {
"id": 23132,
"name": "Renesas Electronics",
"logo": "https://jobdataapi.com/media/company/logo/24/03/renesas_logo.jpeg",
"website_url": "https://www.renesas.com",
"linkedin_url": "https://www.linkedin.com/company/renesas",
"twitter_handle": null,
"github_url": null
},
"title": "Channel Marketing Specialist",
"location": "Plano, TEXAS, United States",
"types": [
{
"id": 1,
"name": "Full Time"
}
],
"cities": [
{
"geonameid": 4719457,
"asciiname": "Plano",
"name": "Plano",
"country": {
"code": "US",
"name": "United States",
"region": {
"id": 5,
"name": "North America"
}
},
"timezone": "America/Chicago",
"latitude": "33.01984",
"longitude": "-96.69889"
}
],
"countries": [
{
"code": "US",
"name": "United States",
"region": {
"id": 5,
"name": "North America"
}
}
],
"regions": [
{
"id": 5,
"name": "North America"
}
],
"has_remote": false,
"published": "2024-04-05T15:49:11.001000Z",
"description": "<h3>Company Description</h3><p>Renesas is one of the top global semiconductor companies in the world. We strive to develop a safer, healthier, greener, and smarter world, and our goal is to make every endpoint intelligent by offering product solutions in the automotive, industrial, infrastructure and IoT markets. Our robust product portfolio includes world leading MCUs, SoCs, analog and power products, plus Winning Combination solutions that curate these complementary products. We are a key supplier to the world’s leading manufacturers of electronics you rely on every day; you may not see our products, but they are all around you.</p><p>Renesas employs roughly 21,000 people in more than 30 countries worldwide. As a global team, our employees actively embody the Renesas Culture, our guiding principles based on five key elements: Transparent, Agile, Global, Innovative, and Entrepreneurial. Renesas believes in, and has a commitment to, diversity and inclusion, with initiatives and a leadership team dedicated to its resources and values. At Renesas, we want to build a sustainable future where technology helps make our lives easier. Join us and build your future by being part of what’s next in electronics and the world.</p><h3>Job Description</h3><p>The Channel Marketing Specialist, New Product Introduction (NPI) Campaigns will play an instrumental part in launching new Renesas products to the mass market, frequently working with internal stakeholders and external distribution partners to execute joint marketing activities and new product introductions.  This role enables individuals to develop critical marketing and business skills—including digital marketing and program management.</p><p>What sets this role apart from other entry-level marketing positions is the opportunity to gain additional exposure to supply chain management and sales operations. As a global company, Renesas is also a great place to gain international and cross-cultural exposure.</p><p>The ideal candidate for this role has a keen interest in B2B product marketing within a global organization. They are process-oriented, organized, and professional while being able to adapt to change and problem-solve quite quickly.</p><p><strong>Roles &amp; Responsibilities:</strong></p><ul><li>Work with channel distributor partners on co-op marketing activities.</li><li>Coordinate with cross-functional internal teams on new product introductions.</li><li>Prepare planning documents and reports. </li><li>Write copy for ads and other digital marketing content.</li><li>Help maintain shared file drive.</li></ul><h3>Qualifications</h3><ul><li>BS or BA in marketing, communications preferred.</li><li>Prior internship experience preferred, but not required.</li><li>Successful time management, organizational and problem-solving skills.</li><li>Excellent communication skills, both written and verbal, with ability to communicate effectively and professionally in a business setting.</li><li>Self-motivator who enjoys working in a fast-paced environment.</li><li>Ability to collaborate and operate within a team.</li><li>Ability to complete projects, tasks, and deliverables on time.</li><li>Proficiency in using Microsoft Office applications such as Word, PowerPoint, Excel and SharePoint (or similar applications).</li></ul><p> </p><h3>Additional Information</h3><p>The expected annual pay range for this position is $67,000 - $100,500. This position is also eligible for bonus pay. Please note that final offer amount will be dependent on geographic location, applicable experience, and skillset of the candidate.</p><p>Renesas offers a full range of elective benefits including medical, health savings account (with applicable medical plan), dental, vision, health and/or dependent care flexible spending accounts, pre-tax commuter benefits, life insurance, AD&amp;D, and pet insurance. In addition to elective benefit options, benefited employees receive company-paid life insurance and AD&amp;D, LTD, short term medical benefits as well as paid sick time, paid holidays, and accrued paid vacation. New employees will attend a detailed benefit orientation to learn more about our many benefits and resources.</p><p>Renesas Electronics Corporation empowers a safer, smarter and more sustainable future where technology helps make our lives easier. The leading global provider of microcontrollers, Renesas combines our expertise in embedded processing, analog, power and connectivity to deliver complete semiconductor solutions. These Winning Combinations accelerate time to market for automotive, industrial, infrastructure and IoT applications, enabling billions of connected, intelligent devices that enhance the way people work and live. Learn more at <a href=\"http://www.renesas.com\">renesas.com</a>.<br/>\n<br/>\nRenesas’ mission, To Make Our Lives Easier, is underpinned by our company culture, TAGIE. TAGIE stands for Transparent, Agile, Global, Innovative and Entrepreneurial. Our goal is to embed this unique culture in everything we do to succeed as a company and create trust with our diverse colleagues, customers and stakeholders.<br/>\n<br/>\nRenesas Electronics is an equal opportunity and affirmative action employer, committed to celebrating diversity and fostering a work environment free of discrimination on the basis of sex, race, religion, national origin, gender, gender identity, gender expression, age, sexual orientation, military status, veteran status, or any other basis protected by federal, state or local law.</p>",
"experience_level": "EN",
"application_url": "https://jobs.smartrecruiters.com/RenesasElectronics/743999978692253-channel-marketing-specialist",
"language": "en",
"clearance_required": false,
"salary_min": "67000",
"salary_max": "100500",
"salary_currency": "USD"
},
{
"id": 5012696,
"ext_id": "5945356003",
"company": {
"id": 23490,
"name": "Clark Schaefer Strategic HR",
"logo": "https://jobdataapi.com/media/company/logo/24/03/logo_img_kqUZhla.png",
"website_url": "https://strategichrinc.com",
"linkedin_url": "https://www.linkedin.com/company/csstrategichr/",
"twitter_handle": null,
"github_url": null
},
"title": "Customer Success Marketing Specialist",
"location": "Cincinnati, Ohio",
"types": [
{
"id": 1,
"name": "Full Time"
}
],
"cities": [
{
"geonameid": 4508722,
"asciiname": "Cincinnati",
"name": "Cincinnati",
"country": {
"code": "US",
"name": "United States",
"region": {
"id": 5,
"name": "North America"
}
},
"timezone": "America/New_York",
"latitude": "39.12711",
"longitude": "-84.51439"
}
],
"countries": [
{
"code": "US",
"name": "United States",
"region": {
"id": 5,
"name": "North America"
}
}
],
"regions": [
{
"id": 5,
"name": "North America"
}
],
"has_remote": false,
"published": "2024-04-05T14:20:15Z",
"description": "<h2><strong>Career Opportunity: </strong><strong>Customer Success Marketing Specialist</strong><strong> – Organized Living in Cincinnati, OH</strong></h2>\n<p> </p>\n<h2><strong>Do you have </strong><strong>marketing and communication strategies experience</strong><strong>? Do you enjoy collaborating with Dealers to educate them on the services offered? If so, we have an exciting opportunity for you!</strong> </h2>\n<p> </p>\n<p>Organized Living is seeking a <strong>Customer Success Marketing Specialist</strong> who is dedicated to growing our Dealer network by providing marketing, communication, and software support. The Customer Success Marketing Manager will play an important role by work collaboratively to support our Dealer partners and attract additional Dealers as it relates to marketing, communications, and software support. <br/><br/>As a key member of our team, you will oversee short-term and long-term marketing and communication strategies by producing marketing campaigns that engage our current and future partners. Several of the chief tasks include creating marketing support materials, executing campaigns, conducting customer interviews, and providing valuable insights and feedback to the strategic initiative team.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Partner with sales to manage and expand existing partner relationships while identifying new opportunities to grow our partner network.</li>\n<li>Develop and execute comprehensive marketing strategies in collaboration with the strategic initiative team to support our Dealer partners and target new partners.</li>\n<li>Plan, create, and manage marketing campaigns that drive engagement and align with our current and target partners' needs and our strategic objectives.</li>\n<li>Design and produce marketing support materials, including brochures, presentations, training resources, and digital content, to assist with our strategic objectives.</li>\n<li>Assist with sales at trade shows/events and other marketing activities to enhance partner engagement.</li>\n<li>Conduct interviews and gather feedback from Dealer partners to gain insights into their needs and challenges. Translate these insights into actionable strategies.</li>\n<li>Identifying new Dealer partner opportunities.</li>\n<li>Link and promote the adoption and use of software features and functionality to help partners achieve key business outcomes, take findings back to the Product Management team.</li>\n<li>Lead product-specific marketing campaigns, ensuring effective communication of product features, benefits, and unique selling points.</li>\n<li>Monitor the performance of marketing campaigns and communication efforts, providing data-driven insights and recommendations for improvement.</li>\n<li>Collaborate cross-functionally with sales, marketing, and customer support teams to ensure seamless communication and alignment of strategies.</li>\n</ul>\n<p><strong>Requirements:</strong></p>\n<ul>\n<li>Bachelor’s Degree in marketing, business, software or a related field.</li>\n<li>Proven experience in marketing, with a strong understanding of software adoption.</li>\n<li>Outstanding communication and organization skills with a strong attention to detail.</li>\n<li>Analytical mindset with the ability to translate data into actionable insights.</li>\n<li>Ability to meet deadlines in a fast-paced environment while managing multiple projects and multiple versions.</li>\n<li>Proficiency in marketing tools and platforms.</li>\n<li>Strong project management skills.</li>\n</ul>\n<p>This position will receive a competitive benefits package including medical, dental, vision, short- and long-term disability, 401k match, and profit sharing. Apply today to be a part of a company culture that is exciting, results driven, open-minded and caring. You will be expected to learn every day, innovate, and develop new skills in our fast-paced environment.</p>\n<p>Organized Living has been making quality products for the home for more than 100 years. Our long-term success is the result of our passion and commitment to our quality products, innovative programs, and unmatched support. As a growing family company, we manufacture and market quality storage and organization products. We serve the Single Family and Multifamily markets through our nationwide network of independent dealers. </p>\n<p>If you want to join a company that continues to build a solid strategic advantage and is quickly becoming America’s leading brand for high-quality home storage and organization systems, this is your chance. Our passion and market focus has led us to develop the right products, for every project, budget and need supported by our industry-leading software to continue achieving strong market share growth and exceptional future opportunities.</p>\n<p>To learn more about Organized Living please visit our website and LinkedIn page:</p>\n<p><a href=\"https://organizedliving.com/\">https://organizedliving.com/</a></p>\n<p><a href=\"https://www.linkedin.com/company/organized-living/\">https://www.linkedin.com/company/organized-living/</a></p>\n<p>If you have the desire to be a significant contributor to a profitable expanding company with a strong and supportive ownership group, please apply online today! </p>\n<p>AAP/ EEO: M/F/H/V/D, Drug-free workplace. No third-party candidates please.</p>\n<p>#ZR</p>",
"experience_level": "MI",
"application_url": "https://careers.strategichrinc.com/job-application/?gh_jid=5945356003",
"language": "en",
"clearance_required": false,
"salary_min": null,
"salary_max": null,
"salary_currency": null
},
{
"id": 5013760,
"ext_id": "4a010463-5cbf-485d-a519-64ba86f2be46",
"company": {
"id": 536,
"name": "R3",
"logo": "https://jobdataapi.com/media/company/logo/20/06/inside_r3.jpg",
"website_url": "https://www.r3.com/",
"linkedin_url": "https://www.linkedin.com/company/r3cev-llc/",
"twitter_handle": "inside_r3",
"github_url": ""
},
"title": "Campaign Marketing Specialist",
"location": "London",
"types": [
{
"id": 1,
"name": "Full Time"
}
],
"cities": [
{
"geonameid": 2643743,
"asciiname": "London",
"name": "London",
"country": {
"code": "GB",
"name": "United Kingdom",
"region": {
"id": 3,
"name": "Europe"
}
},
"timezone": "Europe/London",
"latitude": "51.50853",
"longitude": "-0.12574"
}
],
"countries": [
{
"code": "GB",
"name": "United Kingdom",
"region": {
"id": 3,
"name": "Europe"
}
}
],
"regions": [
{
"id": 3,
"name": "Europe"
}
],
"has_remote": false,
"published": "2024-04-05T10:53:38Z",
"description": "At R3 our vision is a world where value moves freely, and business is done safely. Our mission is to enable an open, trusted, and enduring digital economy. We are a scale up with a startup’s grit. We encourage a workforce where no idea is too small, and no two days are the same.<br/>About the RoleWe are seeking a proactive and detail-oriented Campaign Marketing Specialist to support our marketing efforts globally. As a key member of the marketing team, you will assist in the execution of field marketing initiatives to drive brand awareness, lead generation, and customer engagement. Your role will involve collaborating with cross-functional teams, organizing events, managing partnership marketing opportunities, and implementing effective marketing campaigns to achieve business objectives.\n<h3>Your Responsibilities:</h3>\n<ul>\n<li>Assist in the development and implementation of global marketing campaigns and programs to drive lead generation, customer acquisition, and revenue growth.</li><li>Work closely with our Business Resources team to support the planning, organization, and execution of various events, including conferences, webinars, workshops, and networking events, to showcase our products/services and engage with prospects and customers.</li><li>Identify potential partners and assist in establishing strategic partnerships with industry associations, financial institutions, technology providers, and other stakeholders to expand market reach and enhance brand visibility.</li><li>Work closely with our Content Lead to leverage compelling content, including presentations, case studies, whitepapers, and blog posts, to support sales efforts, educate prospects, and reinforce brand messaging.</li><li>Work closely with the sales team to provide marketing support, develop sales collateral, and ensure alignment between marketing initiatives and sales objectives.</li><li>Conduct market research and analysis to identify market trends, competitive landscape, and customer insights, and provide recommendations for marketing strategies and tactics.</li><li>Assist in managing the field marketing budget, tracking expenses, and ensuring cost-effectiveness and optimal allocation of resources.</li><li>Monitor and analyse campaign performance, track marketing metrics, and prepare reports to evaluate effectiveness, identify areas for improvement, and provide insights to stakeholders.</li></ul>\n<h3>Your Experience:</h3>\n<ul>\n<li>Bachelor's degree in Marketing, Business Administration, or a related field.</li><li>At least 3 years’ experience in a similar role.</li><li>Strong organizational and time management skills, with the ability to prioritize tasks, meet deadlines, and manage multiple projects simultaneously.</li><li>Excellent communication skills, both written and verbal, with attention to detail and accuracy.</li><li>Ability to work effectively in a collaborative team environment and build relationships with internal and external stakeholders.</li><li>Proficiency in Microsoft Office Suite, marketing automation tools, Vimeo, Sales Force and Pardot systems.</li><li>Interest in the fintech industry and willingness to learn and adapt in a fast-paced, dynamic environment.</li></ul>R3 is a leading enterprise technology firm specialising in digital solutions for regulated financial markets. Our technology enables financial markets to operate with greater efficiency, transparency and enhanced connectivity. Our focus is on progressing markets and fostering an open, trusted and enduring digital economy.  R3ers center around our core values – Collaborative, Ownership, Bold and Customer First – as a result our flagship DLT platform, Corda, and R3 Digital Markets product suite is trusted by the world’s leading financial market infrastructures (FMIs), exchanges, central banks and commercial banks. R3 is proud to be an equal opportunity workplace. We are a diverse and inclusive team that supports all ethnicities, races, genders, sexual orientations, origins, disability and veteran status and cultures. At R3, we’re committed to fostering an environment where individuality–not conformity–is embraced and valued because we believe our collective differences are what make us better together. For more information, visit <a class=\"postings-link\" href=\"https://nam04.safelinks.protection.outlook.com/?url=https%3A%2F%2Furldefense.proofpoint.com%2Fv2%2Furl%3Fu%3Dhttp-3A__www.r3.com_%26d%3DDwMF-g%26c%3DeuGZstcaTDllvimEN8b7jXrwqOf-v5A_CdpgnVfiiMM%26r%3DOI7PvC7WM9tfA75WlHgBXXeCQFtptDh-x1xMLITa6HE%26m%3DD_mfNXCoH3narMMuqhCS8WW19VFPgdye--IL-fTYW-k%26s%3DVPzhIaEeezofUnME4AUlaNOw6Gnuf1Ctcn3YaNHgtVI%26e%3D&amp;data=05%7C02%7Cwenqi.foo%40r3.com%7C74a1929b5ea74571844d08dc54a67cc7%7Ca4be1f2e2d10419587cd736aca9b672c%7C0%7C0%7C638478321252582750%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C0%7C%7C%7C&amp;sdata=OaQxkiFpIIJHF8DTVaEumn5LcTc26VHrBRrdHme26T8%3D&amp;reserved=0\">www.r3.com</a> or connect with us on <a class=\"postings-link\" href=\"https://nam04.safelinks.protection.outlook.com/?url=https%3A%2F%2Furldefense.proofpoint.com%2Fv2%2Furl%3Fu%3Dhttps-3A__twitter.com_inside-5Fr3%26d%3DDwMF-g%26c%3DeuGZstcaTDllvimEN8b7jXrwqOf-v5A_CdpgnVfiiMM%26r%3DOI7PvC7WM9tfA75WlHgBXXeCQFtptDh-x1xMLITa6HE%26m%3DD_mfNXCoH3narMMuqhCS8WW19VFPgdye--IL-fTYW-k%26s%3DuUylGy2byv-rrxNSy4QTfF7jNa8yVI7_wyPEnJ4ybrE%26e%3D&amp;data=05%7C02%7Cwenqi.foo%40r3.com%7C74a1929b5ea74571844d08dc54a67cc7%7Ca4be1f2e2d10419587cd736aca9b672c%7C0%7C0%7C638478321252597394%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C0%7C%7C%7C&amp;sdata=BbpEZDQm5mN%2BriNkASElzO9MqBCDTT1Q%2B8H7rqfUfYc%3D&amp;reserved=0\">Twitter</a> or <a class=\"postings-link\" href=\"https://nam04.safelinks.protection.outlook.com/?url=https%3A%2F%2Furldefense.proofpoint.com%2Fv2%2Furl%3Fu%3Dhttps-3A__www.linkedin.com_company_r3cev-2Dllc_%26d%3DDwMF-g%26c%3DeuGZstcaTDllvimEN8b7jXrwqOf-v5A_CdpgnVfiiMM%26r%3DOI7PvC7WM9tfA75WlHgBXXeCQFtptDh-x1xMLITa6HE%26m%3DD_mfNXCoH3narMMuqhCS8WW19VFPgdye--IL-fTYW-k%26s%3DA5IclxHD-mzdZacfRqTfFKXeNAEp2U_iJu62RzVzv1w%26e%3D&amp;data=05%7C02%7Cwenqi.foo%40r3.com%7C74a1929b5ea74571844d08dc54a67cc7%7Ca4be1f2e2d10419587cd736aca9b672c%7C0%7C0%7C638478321252610684%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C0%7C%7C%7C&amp;sdata=c9nmCkmJAOqF5Q%2FjXlB%2Ft19fpr3vWcSmpmIwiIhEbB8%3D&amp;reserved=0\">LinkedIn</a>. If you don’t meet all of the above criteria, but you think you’d be a great addition to R3, send us your CV/resume. We’re always interested in meeting bold, collaborative people who are excited to work with us.",
"experience_level": null,
"application_url": "https://jobs.lever.co/r3.com/4a010463-5cbf-485d-a519-64ba86f2be46",
"language": "en",
"clearance_required": false,
"salary_min": null,
"salary_max": null,
"salary_currency": null
},
{
"id": 5021237,
"ext_id": "743999978551393",
"company": {
"id": 12285,
"name": "Red Bull",
"logo": "https://jobdataapi.com/media/company/logo/23/11/red_bull_logo.jpeg",
"website_url": "https://www.redbull.com/",
"linkedin_url": "https://www.linkedin.com/company/red-bull/",
"twitter_handle": null,
"github_url": null
},
"title": "Field Marketing Specialist - South West",
"location": "Bristol, United Kingdom",
"types": [
{
"id": 1,
"name": "Full Time"
}
],
"cities": [
{
"geonameid": 2654675,
"asciiname": "Bristol",
"name": "Bristol",
"country": {
"code": "GB",
"name": "United Kingdom",
"region": {
"id": 3,
"name": "Europe"
}
},
"timezone": "Europe/London",
"latitude": "51.45523",
"longitude": "-2.59665"
}
],
"countries": [
{
"code": "GB",
"name": "United Kingdom",
"region": {
"id": 3,
"name": "Europe"
}
}
],
"regions": [
{
"id": 3,
"name": "Europe"
}
],
"has_remote": false,
"published": "2024-04-05T09:21:21.661000Z",
"description": "<h3>Company Description</h3><p><strong>Red Bull UK are recruiting for a Field Marketing Specialist to be based across South West, UK.</strong></p><p>You will be responsible for growing sales and consumption of Red Bull through field marketing in your region. You’ll spend your days working in locations and communities across your region, growing brand visibility, product availability, brand experiences and product consumption in key moments when people need energy. You will increase product consideration through initiatives that grow trial, availability and visibility using Red Bull’s four key pillars of the field marketing mix (Consumer Collecting, Sports, Culture and Communications). You will work closely with the sales teams in both the On Premise and Off Premise as well as finding new business opportunities, impacting the heart of local consumers, ultimately leading to the successful development of the business. This isn’t your average 9-5 office job as you will be out in the field ensuring Red Bull is relevant and present in the right places on any day of the week and at a time when people need energy.</p><h3>Job Description</h3><p><strong>Support Strategic Direction</strong></p><p>Work closely with the Field Marketing Manager on the creation of the field strategy, defining ideas to build brand image and increase understanding of product functionality on a local level. <br/>\nDrive relevance across a variety of moments of need through when people need energy, through tailored messaging, amplification of occasion campaigns and activating the right big moments in the region. <br/>\nWork in conjunction with the local sales team to build mental availability hand in hand with physical availability within image driving outlets, On Premise, Off Premise and new business environments. Ensuring the product is readily available in every field marketing activity. <br/>\nSet clear goals together with the Consumer Collecting Manager and Field Marketing Manager to drive trial that engages new users, offering the right product mix to expand the consumer base to seize all opportunities in your region especially among students. <br/>\nUse programme tools and reporting features to track performance, find opportunities for improving targeting and other important strategic input (e.g. consumer perceptions), which will help to drive a smarter programme. </p><p> </p><p><strong>Implementation of Regional Marketing Plan</strong></p><p>Activate national and international best practices with students encompassing the core programme objectives.<br/>\nIncorporate in-direct sampling initiatives into the plan to broaden reach in occasions which are difficult to sample and where we can surprise our consumers.<br/>\nEnsure the delivery of the sampling programme for the region by leading your team of Student Marketeers to success. <br/>\nDeliver brand activations at 3rd party events within the region. Adding value by determining the appropriate level of Red Bull brand  support &amp; visibility with the objective of increasing brand attribution and product usage in relevant scenes.<br/>\nBuild and activate relationships with key opinion leaders and important local networks within key sport and cultural scenes for the region.<br/>\nSecure, manage and activate new distribution points within the region for Red Bull through premium and relevant image led outlets that will buy Red Bull and sell it to their visitors.  <br/>\nExecute the Event Vehicle programme to excite &amp; surprise consumers.<br/>\nSupport national teams &amp; Field Marketing Manager in organizing events by taking over defined parts of bigger projects and realising small scale regionally important titled events where appropriate. <br/>\nBring national marketing assets such as brand campaigns, titled events, student projects, athletes and media house projects closer to consumers in your region by implementing activation plans set by the Field Marketing Manager.<br/>\nMaximize opportunities to create consumer touch points in earned and owned media through creating locally relevant stories/experiences and having a superb media network.</p><p> </p><p><strong>Marketing Innovation</strong></p><p>Support the Field Marketing Manager in developing, owning and executing new ideas that are locally relevant, complementing the activation of global and national initiatives.<br/>\nIdentify and selectively support cross-marketing (with sales, marketing &amp; Red Bull Media House) opportunities with integrated 360 plans that fit the needs of the region.<br/>\nLead the creative process with Student Marketeers for a constant flow of new ideas to build loyalty within the student audience.</p><p> </p><p><strong>Organisational Capabilities and Enabling Structure</strong></p><p>Act as a role model and display the Red Bull values with a consistent tone of voice that is motivating and inspiring.<br/>\nEnsure you have the right programme set up, in the right areas to reach your target group, be flexible with resources so that we are always aligned with business opportunities. <br/>\nMaintain consistency with other field marketing regions regarding recruitment, on-boarding and training. <br/>\nSource and hire with no compromise the best, highly diverse Student Marketeers who have the right skills &amp; attitude towards all business priorities. <br/>\nSet every new Student Marketeer hire up for success with a dedicated and consistent onboarding process.<br/>\nTrain and lead Student Marketeers with an ‘empowerment’ approach so they take ownership of their own targets that impact the business and give opportunities for development to the shining stars.<br/>\nLead and inspire Student Marketeers by sharing the strategy and explaining how they fit into it, spend time in the field coaching on the job and inspiring them to focus on building brand and can love. <br/>\nMaintain a growth environment and coach Student Marketeers towards development.<br/>\nPlan and conduct regular idea generation sessions, planning sessions and team building activities. </p><p><strong>Driving Efficiencies</strong></p><p>Manage the regional budget with the support of the Field Marketing Manager.<br/>\nSupport the national operations team to manage product stock with discipline.<br/>\nMaintenance and management of programme tools, Point Of Sales Materials, cars and other branded items in a premium manner.<br/>\nRegularly review the environmental impact of your marketing activity working with the wider field marketing team to develop a year round plan and new initiatives to keep it to a minimum, ensuring we leave the playgrounds we operate in better than we found them. </p><h3>Qualifications</h3><p>Understands the core scenes in the region and has strong networking skills.<br/>\nHas already built and sustained personal relationships in local scenes (e.g. University, Culture, Sports, etc.).<br/>\nWork experience in the sports and or culture industry, events or marketing agency having an in depth understanding of the sport and or culture landscape. <br/>\nSome experience in leading teams and managing people.<br/>\nSome experience in sales and working with commercial teams. <br/>\nA strategic thinker who takes initiative and ownership and “makes things happen”.<br/>\nA ‘connector’ who has excellent communication and networking skills, who can open doors and excite people of an idea.<br/>\nStrong ‘can do’ attitude, strives for perfection and love for the detail in every project.<br/>\nLeadership, motivation and ability to cultivate a team environment.<br/>\nAnalytical, planning, budgetary and project management competencies.<br/>\nCreative mind with a track record of putting new ideas into practice and assessing results.<br/>\nExcellent communication skills, including presenting and training abilities.<br/>\nIs willing to learn and commit to people management and their development.<br/>\nSelf-confident, self-motivated, friendly, loyal, interested in working with people and capable of handling stressful situations. </p><h3>Additional Information</h3><p>At Red Bull, we exist to give people wiiings. To achieve that, we recognise the value that comes from having a highly diverse workforce that has the freedom and responsibility to realise their ideas and seize opportunities. We make recruiting decisions based on experience, skills, potential and talent: everyone is welcome here.</p>",
"experience_level": "EN",
"application_url": "https://jobs.smartrecruiters.com/RedBull/743999978551393-field-marketing-specialist-south-west",
"language": "en",
"clearance_required": false,
"salary_min": null,
"salary_max": null,
"salary_currency": null
},
{
"id": 5016337,
"ext_id": "31416392F8",
"company": {
"id": 16154,
"name": "COBS Bread",
"logo": "https://jobdataapi.com/media/company/logo/23/12/logo_img_TrxBpN1.png",
"website_url": "https://www.cobsbread.com",
"linkedin_url": "https://www.linkedin.com/company/cobs-bread/",
"twitter_handle": "COBSBread",
"github_url": null
},
"title": "Marketing Specialist",
"location": "Vancouver, British Columbia, Canada",
"types": [
{
"id": 1,
"name": "Full Time"
}
],
"cities": [
{
"geonameid": 6173331,
"asciiname": "Vancouver",
"name": "Vancouver",
"country": {
"code": "CA",
"name": "Canada",
"region": {
"id": 5,
"name": "North America"
}
},
"timezone": "America/Vancouver",
"latitude": "49.24966",
"longitude": "-123.11934"
}
],
"countries": [
{
"code": "CA",
"name": "Canada",
"region": {
"id": 5,
"name": "North America"
}
}
],
"regions": [
{
"id": 5,
"name": "North America"
}
],
"has_remote": false,
"published": "2024-04-05T00:00:00Z",
"description": "<p>Great Place to Work® Certified</p><p><strong>Marketing Specialist </strong></p><p>Reports to: Senior Marketing Manager, Brand &amp; Retail Experience </p><p>Location: Vancouver, BC</p><p>Annual Salary: $65,000 - $70,000 based on experience</p><ul> <li>Are you interested in playing a key role in shaping the growth of a dynamic company? </li> <li>Are you passionate about omni-channel marketing and are constantly looking for ways to improve and maximize opportunities? </li> <li>Do you love to drive results and celebrate in the success of your team? </li> <li>Are you an interdisciplinary marketing expert?  </li> </ul><p>We are looking for an experienced individual who thrives in a fast-paced environment to join the COBS Bread Marketing Team. This position specializes in omni-channel marketing campaign strategy, to deliver campaigns that achieve set KPIs through various marketing initiatives. </p><p></p><p><strong>Key responsibilities include: </strong></p><ul> <li>Support execution of Marketing Campaign Calendar to develop a marketing plan that maximizes ROI and achieves set KPIs </li> <li>Manage Marketing Campaign Timeline to ensure key milestones are met from development to post-launch </li> <li>Support Marketing Campaign Budget to ensure marketing initiatives are within scope </li> <li>Drive Support Office Team and Franchise network campaign briefings regularly to ensure effective execution   </li> <li>Assist with the roll out strategy for all advertising platforms  </li> <li>Assist with creative review and artwork sign-off of all campaign materials including in-bakery POS, digital (advertising, signage, POS system, website), and local </li> <li>Provide regular campaign results to Operations Team and Franchise network </li> <li>Support in campaign evaluation execution </li> <li>Manage execution and delivery of Breaducate e-learning module for each campaign </li> <li>Provide support for Marketing projects as required </li> </ul><p><strong>Requirements</strong></p><p><strong>What You Bring to the Table: </strong></p><ul> <li>3 years experience as a Specialist / Assistant Marketing Manager / Associate Marketing Manager in leading the omni-channel marketing campaign strategies from concept to execution </li> <li>Strong project management skills in overseeing multiple projects and meeting tight deadlines </li> <li>Excellent verbal communication skills with strength in presentations </li> <li>Excellent written communication skills with strength in short and long form copywriting </li> <li>Bachelor’s Degree with concentration in Marketing, Communications or Advertising is an asset </li> <li>Knowledge of Retail, Consumer Packaged Goods and/or Franchising is an asset </li> <li>Experience in SEM and paid media channels is an asset </li> <li>A keen omni-channel marketing lens that optimizes for digital as well as in-store </li> </ul><p><strong>Benefits</strong></p><p><strong>What’s in it for You</strong></p><p>Not only do we have fresh COBS Bread product delivered daily to our Vancouver Support Office, we offer some pretty sweet perks too! </p><ul> <ul> <li>A flexible work arrangement and a one-time work from home reimbursement to ensure you're set up for success </li> <li>Competitive salary, company bonus and vacation plan</li> </ul> <ul> <li>A great Extended Health &amp; Dental Benefit, Group RRSP Matching, and Health Spending Account </li> <li>Paid sick, mental health and personal leave days </li> <li>Paid day for community service or volunteer opportunity </li> <li>Subsidized wellness program and an on-site gym facility </li> <li>An open, ‘continuous-learning’ environment where professional development and career progression is encouraged </li> </ul> <ul> <li>Work within a dynamic, driven, high-achieving, close-knit and fun-loving team </li> <li>High level of autonomy and responsibility </li> <li>Complimentary self-serve kitchen of fresh produce, deli meats and of course, COBS Bread and treats!</li> </ul> </ul><p>We thank all applicants for their interest in COBS Bread but would like to advise that only applicants shortlisted for interview will be contacted.</p><p>We are an equal opportunity employer and value diversity at our company.</p><p></p><p><strong>About COBS Bread</strong></p><p>With over 160 locations, COBS Bread serves fresh and delightful baked goods to communities across Canada. Any unsold items are donated daily to various local charities and food banks. The company's success can be attributed to the quality of our product, the development of our people and our warm and friendly customer service.</p><p>COBS Bread is part of Bakers Delight – Established in 1980 operating as Bakers Delight in Australia and New Zealand, and since 2003 as COBS Bread in Canada and the USA. Together we have grown to more than 700 bakeries across Australia, New Zealand, Canada and the USA. The entire network employs over 15,000 people, serving more than 2.1 million customers each week.</p><p><strong>Accessibility</strong></p><p>Accommodation is available upon request for applicants and employees with disabilities. If you are contacted for a job opportunity, please advise us of any accommodations needed to ensure you have access to a fair and equitable process. Any information received relating to accommodation will be addressed confidentially.</p><p>#INDCOB2</p>",
"experience_level": "MI",
"application_url": "https://apply.workable.com/j/31416392F8/apply",
"language": "en",
"clearance_required": false,
"salary_min": "65000",
"salary_max": "70000",
"salary_currency": "USD"
},
{
"id": 5014540,
"ext_id": "3A3CB3E65B",
"company": {
"id": 4664,
"name": "Bayut | dubizzle",
"logo": "https://jobdataapi.com/media/company/logo/22/10/HN_M4kbT_400x400.png",
"website_url": "https://www.bayut.com",
"linkedin_url": "https://www.linkedin.com/company/bayut-com",
"twitter_handle": "bayut",
"github_url": null
},
"title": "Lifecycle Marketing Specialist",
"location": "Dubai, Dubai, United Arab Emirates",
"types": [
{
"id": 1,
"name": "Full Time"
}
],
"cities": [
{
"geonameid": 292223,
"asciiname": "Dubai",
"name": "Dubai",
"country": {
"code": "AE",
"name": "United Arab Emirates",
"region": {
"id": 4,
"name": "Middle East"
}
},
"timezone": "Asia/Dubai",
"latitude": "25.07725",
"longitude": "55.30927"
}
],
"countries": [
{
"code": "AE",
"name": "United Arab Emirates",
"region": {
"id": 4,
"name": "Middle East"
}
}
],
"regions": [
{
"id": 4,
"name": "Middle East"
}
],
"has_remote": false,
"published": "2024-04-05T00:00:00Z",
"description": "<p>Bayut &amp; dubizzle have the unique distinction of being iconic, homegrown brands with a strong presence across the seven emirates in the UAE. Connecting millions of users across the country, we are committed to delivering the best online search experience.</p><p>As part of Dubizzle Group, we are alongside some of the strongest classified brands in the market. With a collective strength of 8 brands, we have more than 160 million monthly users that trust in our dedication to providing them with the best platform for their needs.</p><p>As a CLM Specialist, you will be responsible for creating, shaping, and optimizing CLM campaigns (consisting of email, push, in-app and web notifications) while also working with various internal teams to create end-to-end marketing strategies and user lifecycle journey.</p><p><strong>In this role, you will:</strong></p><ul> <li>Developing a strategy to engage, retain and re-engage customers during key milestones of the customer lifecycle segments.</li> <li>Creation and running of email, in-app and push notifications; assisting in copywriting, email design and user performance of all C2C and B2C campaigns</li> <li>A/B Testing and optimizing CLM campaigns with strategic content, frequency and audience variations</li> <li>Working closely with all teams to understand the customer base through insight segmentation and data analysis</li> <li>Leading new product features, testing side by side with Product managers and leveraging email marketing &amp; push notifications</li> <li>Increase CLM’s traffic &amp; engagement contribution, while maintaining the high quality of relevant and personalized messaging.</li> <li>Constantly analysing data to plan strategies and execute campaigns.</li> <li> Audience building, segmentation and testing</li> <li>Project management and help BI/Tech teams with API based campaigns </li> </ul><p><strong>Requirements</strong></p><ul> <li>Bachelor’s degree or BSC from a reputable university</li> <li>3 – 5 years of experience in a similar field</li> <li>Knowledge of basic digital marketing &amp; advance CLM tools</li> <li>Practical knowledge of digital platforms and some of the CLM tools; Braze, Airship, Lean Plum, Accoustic, Moengage, Twillio, Sendgrid, and SendinBlue (experience with at least one email automation platform)</li> <li>Understanding of web analytics (experience with Google Analytics is preferred)</li> <li>Strong understanding of current online marketing concepts, strategies, and best practices</li> <li>Strong critical thinking, technical, and data analysis skills</li> <li>Strong skills in MS Office Suite (Excel, PowerPoint)</li> <li>Sharp strategic thinking and ability to translate quantitative &amp; qualitative data/insights into a strong targeted marketing strategy</li> <li>Self – motivated &amp; willing to take on new challenges </li> </ul><p><strong>Benefits</strong></p><ul> <li>A fast paced, high performing team.</li> <li>Multicultural environment with over 50 different nationalities</li> <li>Competitive Tax-free Salary</li> <li>Comprehensive Health Insurance</li> <li>Annual Air Ticket Allowance</li> <li>Employee discounts at multiple vendors across the emirates</li> <li>Rewards &amp; Recognitions</li> <li>Learning &amp; Development<br/> </li> </ul><p>Bayut &amp; dubizzle is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees.</p><p>#Bayut</p>",
"experience_level": "MI",
"application_url": "https://apply.workable.com/j/3A3CB3E65B/apply",
"language": "en",
"clearance_required": false,
"salary_min": null,
"salary_max": null,
"salary_currency": null
},
{
"id": 5016251,
"ext_id": "61E73BAD64",
"company": {
"id": 1638,
"name": "Hack The Box",
"logo": "https://jobdataapi.com/media/company/logo/22/02/hackthebox_eu.jpg",
"website_url": "https://www.hackthebox.com/",
"linkedin_url": "https://www.linkedin.com/company/hackthebox/",
"twitter_handle": "hackthebox_eu",
"github_url": "https://github.com/hackthebox"
},
"title": "Field Marketing Specialist - APAC",
"location": "Sydney, New South Wales, Australia",
"types": [
{
"id": 1,
"name": "Full Time"
}
],
"cities": [
{
"geonameid": 2147714,
"asciiname": "Sydney",
"name": "Sydney",
"country": {
"code": "AU",
"name": "Australia",
"region": {
"id": 2,
"name": "Asia/Pacific"
}
},
"timezone": "Australia/Sydney",
"latitude": "-33.86785",
"longitude": "151.20732"
}
],
"countries": [
{
"code": "AU",
"name": "Australia",
"region": {
"id": 2,
"name": "Asia/Pacific"
}
},
{
"code": "GB",
"name": "United Kingdom",
"region": {
"id": 3,
"name": "Europe"
}
}
],
"regions": [
{
"id": 2,
"name": "Asia/Pacific"
},
{
"id": 3,
"name": "Europe"
}
],
"has_remote": false,
"published": "2024-04-05T00:00:00Z",
"description": "<h3>Ready to embark on the quest of joining Hack The Box?</h3><p>At the end of this thrilling journey, you'll become a proud member of Hack The Box, with the ultimate mission to help redefine cybersecurity expertise. Get ready for an exciting adventure into the world of cybersecurity! 🚀🔒💻<br/><br/></p><p><strong>✨The core mission of the Field Marketing Specialist:<br/></strong>This is an exciting opportunity to join a growing marketing team within a global growth marketing team and be our first marketing hire in the APAC region. The first 6 months of this role will be focused on establishing a regional focussed demand strategy, and optimizing the program as a second phase. More specifically, you will focus on:</p><ul> <li>Work closely with the APAC Regional Sales Team, developing marketing programs and integrated demand generation campaigns which align directly to their goals.</li> <li>Influence lead generation and attributed revenue goals from APAC focussed partners</li> <li>Support of broader global demand generation campaigns, including large Exhibition and other onsite events,</li> <li>Event logistics and management (ANZ + Singapore based)<br/> </li> </ul><p><strong>🍺 The fellowship you’ll be joining:<br/></strong>You will join a team of over 30 marketers, working closely with 8 other growth marketers on the demand generation function. You will report directly to the Head of Enterprise Growth Marketing. You will also collaborate closely with the APAC regional sales team.</p><p></p><p><strong>⚔️ Technology tools &amp; weapons you’ll be using:<br/></strong>Hubspot, event marketing experience, knowledge and experience working closely with sales, referrals, third party vendors and advertisers.</p><p></p><p><strong>🚀 The adventures that await you after becoming Field Marketing Specialist at Hack The Box:</strong></p><ul> <li>Developing marketing campaigns and executing these plans with clear objectives, key metrics, and outcomes with our APAC Sales Team</li> <li>Creating and managing our regional APAC marketing campaigns, programs, and strategic field events in coordination with global stakeholders</li> <li>Provide consistent communication on campaign performance and key metrics to stakeholders, including marketing and sales teams</li> <li>Collaborate with the wider marketing team to incorporate APAC campaigns across multiple routes to market in field events as well as other pillar campaigns (ex: Global CTFs) </li> <li>Build relationships with and work closely with key stakeholders on the global &amp; regional marketing teams to develop go-to-market plans that create and accelerate demand with partners</li> </ul><p></p><p><strong>🏆 Skills, knowledge, and experience points required to unlock the role of Field Marketing Specialist at Hack The Box:</strong></p><ul> <li>A minimum of 5 years professional marketing experience is required, ideally in B2B SaaS, especially cybersecurity</li> <li>Experience in field marketing is required</li> <li>Can balance both analytical and creative thinking, comfortable working with tight deadlines in a fast-paced environment </li> <li>Hands-on experience building marketing campaigns and using tools like HubSpot </li> <li>Comfortable creating strategies and rolling up the sleeves to deliver, ensuring we execute with the greatest impact.</li> <li>Great collaborator, track record of successfully working close with cross-functional teams, especially in close collaboration with sales</li> </ul><p></p><h3>🕹️ What your Hack The Box adventure will have in store:</h3><ul> <li>🎯You'll have the exhilarating opportunity to contribute to a product that is highly appreciated by users and the cybersecurity community at large.</li> <li>🎯 You'll experience a highly supportive and caring environment, fostering growth, flexibility, and autonomy.</li> <li>🎯 You'll embark on an exciting journey of continuous learning and problem-solving, leveling up as our organization grows.</li> <li>🎯 Most importantly, you'll have a blast at HTB 🥳 because fun is an essential ingredient in our recipe for success! Just wait until you see our global meet-ups!</li> </ul><h3>💰The gems you’ll be enjoying as Field Marketing Specialist :</h3><ul> <li>Private insurance, Dental &amp; Vision, 401K </li> <li>Paid paternity &amp; maternity leave </li> <li>25 annual leave days </li> <li>Home Office Allowance </li> <li>Dedicated budget for training and professional development, participation in conferences </li> <li>State-of-the-art equipment </li> <li>Full access to the Hack The Box lab offerings; so you can learn how to hack 😉 </li> </ul><p></p><h3>🗺️ The Quest of Becoming Hack The Box’s Field Marketing Specialist:</h3><ul> <li>Level 1: Like in any game, you start as a Noob. Level one’s objective: submit your application. After applying, you unlock the Script Kiddie rank!</li> <li>Level 2: Now you’re officially ranked as Hacker and you’re ready to meet the Talent Acquisition team. Level’s objective: highlight your past achievements, ambitions, and values.</li> <li>Level 3: As a Pro-Hacker at level 3, you’ll unlock the “boss level”, which involves meeting the hiring manager. Level’s objective: connect with the hiring manager and share with them your achievements.</li> <li>Level 4: Now you’re an Elite Hacker! Level’s objective: complete an assignment that aligns with day-to-day job-related tasks and responsibilities.</li> <li>Level 5: Congratulations, you're now a Guru! Not many reach this level 💪. Level’s objective: have a constructive, final conversation with senior leadership to explore the role and your future at HTB.</li> <li>Level 6: You've achieved the Omniscient rank and officially received an offer from HTB! To complete the last level and the Quest, all you need to do is accept the offer.</li> <li>QUEST COMPLETE. Congratulations, you’re officially one of us 🥳🎉🎇Your next quest: complete the onboarding.</li> </ul><p></p><h3>Hack Your Career, Today. Join us in this epic adventure of cybersecurity at Hack The Box! 🚀🔒💻</h3><p><em>At Hack The Box, we are on a quest to find the most exceptional and enthusiastic talent to join our team. Whether or not you consider yourself a gamer, we value what makes you unique and want to know more about you. This job post provides just a glimpse of the incredible gamified experience our business and consumer customers enjoy through our platforms. So, if you're ready to embark on a journey of disruption, growth, and adventure, we can't wait to meet you!<br/></em><br/></p><h3>ABOUT HACK THE BOX</h3><p>Hack The Box is a leading gamified cybersecurity upskilling, certification, and talent assessment platform enabling individuals, businesses, government institutions, and universities to sharpen their offensive and defensive security expertise.</p><p>Launched in 2017, Hack The Box brings together the largest global cybersecurity community of more than 2m platform members and is on a mission to create and connect cyber-ready humans and organizations through highly engaging hacking experiences that cultivate out-of-the-box thinking.</p><p>Offering a fully guided and exploratory skills development environment, Hack The Box is the ideal solution for cybersecurity professionals and organizations to continuously enhance their cyber-attack readiness by improving their red, blue, and purple team capabilities.</p><p>Rapidly growing its international footprint and reach, Hack The Box is headquartered in the UK, with additional offices in Greece and the US.<br/></p><p><strong>🚨 Exciting News:</strong></p><ul> <li>Read about HTB’s <a class=\"external\" href=\"https://www.hackthebox.com/blog/htb-turns-seven?utm_campaign=HTB+Birthday-Oktopost&amp;utm_content=https%3A%2F%2Fwww.linkedin.com%2Ffeed%2Fupdate%2Furn%3Ali%3Ashare%3A7181282824363122692&amp;utm_medium=social&amp;utm_source=LinkedIn&amp;utm_term=\" rel=\"nofollow noreferrer noopener\" target=\"_blank\">latest year</a>!</li> <li>We are super proud to share that HTB’s all three entities across the UK, <a class=\"external\" href=\"https://www.greatplacetowork.com/certified-company/119000578\" rel=\"nofollow noreferrer noopener\" target=\"_blank\">US</a>, and <a class=\"external\" href=\"https://www.greatplacetowork.gr/certified-company/hack-the-box/\" rel=\"nofollow noreferrer noopener\" target=\"_blank\">Greece</a> have been Certified as a <strong>Great Place to Work </strong>(Oct 2023-Oct 2024).</li> </ul>",
"experience_level": "MI",
"application_url": "https://apply.workable.com/j/61E73BAD64/apply",
"language": "en",
"clearance_required": false,
"salary_min": null,
"salary_max": null,
"salary_currency": null
},
{
"id": 5001343,
"ext_id": "1057148701",
"company": {
"id": 14027,
"name": "Arjo",
"logo": "https://jobdataapi.com/media/company/logo/23/12/logo_img_erPjJLU.png",
"website_url": "https://www.arjo.com/",
"linkedin_url": "https://www.linkedin.com/company/arjoglobal/",
"twitter_handle": null,
"github_url": null
},
"title": "Digital Marketing Specialist - Medical Devices, Sydney, Australia",
"location": "Macquarie Park NSW (AUS), New South Wales, AU - Australia",
"types": [
{
"id": 1,
"name": "Full Time"
}
],
"cities": [],
"countries": [
{
"code": "AU",
"name": "Australia",
"region": {
"id": 2,
"name": "Asia/Pacific"
}
},
{
"code": "GB",
"name": "United Kingdom",
"region": {
"id": 3,
"name": "Europe"
}
}
],
"regions": [
{
"id": 2,
"name": "Asia/Pacific"
},
{
"id": 3,
"name": "Europe"
}
],
"has_remote": false,
"published": "2024-04-05T00:00:00Z",
"description": "<p></p>\n<p> </p>\n<p> </p>\n<p>Empowering careers at ARJO </p>\n<p><br/>\nArjo is a Great Place to Work and we are always looking for more great people to join us.</p>\n<p> </p>\n<p>At Arjo, we know what moves us. We go above and beyond for people facing mobility challenges. We take every opportunity to work and grow as one team and take pride in sharing our knowledge and experience. Does that sound like something that moves you too?</p>\n<p> </p>\n<p>The growth and success of Arjo depend on the trust of our employees, customers, shareholders and the local communities where we operate. </p>\n<p><br/>\nTo find out more about ‘Our Foundation’ see link below: https://www.arjo.com/globalassets/qbankimages/2023/07/our-foundation-228381a890191817c22042429863c89794d640.pdf</p>\n<p><br/>\nThis could be your opportunity to begin a challenging and rewarding career in a healthcare company that empowers movement for people with mobility challenges.</p>\n<p> </p>\n<p>What is the Opportunity?</p>\n<p> </p>\n<p>We have a fantastic opportunity for an energetic, passionate and experienced Digital Marketing Specialist, to join our successful MARCOMS Team, based out of our Macquarie Park Office, in Sydney, NSW.</p>\n<p><br/>\nAbout the Role</p>\n<p><br/>\nThe Digital Marketing Specialist will work closely with the Marketing Communications Manager, and be responsible for executing digital marketing and communication activities from multi-channel digital campaigns, to creating impactful digital content, and focusing on how to improve and strengthen our overall digital performance.</p>\n<p><br/>\nThe ideal candidate should have a passion for all things digital! Be creative, data driven and enthusiastic by bringing your expertise/ experiences in digital marketing, to ensure the continued engagement and growth of the business.</p>\n<p><br/>\nYou will also work closely with our internal stakeholders, to ensure best-in-class content and messaging for all customer events and accompanying communications.</p>\n<p> </p>\n<p>To be successful in the role, you will have:</p>\n<p> </p>\n<p>•    At least 3 years’ experience in digital and marketing including, content creation; pharma or medical devices industry is desirable but not essential;<br/>\n•    Basic to intermediate knowledge of design software (e.g Adobe, InDesign); desirable;<br/>\n•    Experience working with marketing automation software (Salesforce account engagement/Pardot, Hubspot, or similar), <br/>\n•    Experience working with social media management platforms (Sprout, Hootsuit, or similar), and Website builder Wix or similar.<br/>\n•    CMS/CRM experience.<br/>\n•    Can analyse and interpret Google Analytics, Google Ads, and SEO tools.<br/>\n•    Excellent communication, presentation skills and attention to detail;<br/>\n•    Creative and innovative;<br/>\n•    Ability to multitask, prioritise and efficiently meet deadlines;<br/>\n•    Ability to work independently as well as work together as a team;<br/>\n•    A ‘can do’ attitude, takes the initiatives, and the ability to manage your workload.<br/>\n </p>\n<p>What We Will Offer In Return</p>\n<p><br/>\nAt Arjo, our vision is to be the most trusted partner in driving healthier outcomes for people facing mobility challenges. <br/>\nIn return, we recognise and value our global employees. You will also have the opportunity to work in a highly engaged and vibrant workplace culture, which includes:</p>\n<p><br/>\n•    A flexible work environment.<br/>\n•    Great Place to Work Certified 2024.<br/>\n•    Best Workplaces for Women – May 2023 <br/>\n•    Paid Parental Leave Scheme<br/>\n•    Community volunteering opportunities<br/>\n•    Total Employee Wellbeing Program<br/>\n•    Free onsite parking<br/>\n•    Our Guiding Principles Reward and Recognition<br/>\n•    Continuing education and career development plan</p>\n<p><br/>\nWe offer a competitive remuneration package and incentive plan, with the prospect of building a long-term career, whilst encouraging growth and leadership within this global company.<br/>\n </p>\n<p>Why diversity matters to us</p>\n<p><br/>\nAt Arjo, we believe in the power of diversity. We strongly encourage applicants from all parts of society, which means building a more diverse, equitable, inclusive and engaging environment – not only in the workplace, but also within the communities that we serve, work and live in. We achieve this through a culture and mind-set that values the uniqueness of all our people.</p>\n<p> </p>\n<p>Aboriginal and Torres Strait Islander are encouraged to apply and explore a career with Arjo.</p>\n<p> </p>\n<p>Successful applicants will be required to undergo relevant reference checks, national police and a pre-employment medical check (including a drug &amp; alcohol screening), and be up to date with their Covid-19 vaccinations prior to appointment.</p>\n<p> </p>\n<p>For those with a passion to improve mobility outcomes for others, a rewarding career at Arjo awaits.</p>\n<p><br/>\nWe look forward to receiving your application!<br/>\n </p>\n<p> </p>\n<p>About Arjo</p>\n<p>At Arjo, we believe that empowering movement within healthcare environments is essential to quality care. Our products and solutions are designed to promote a safe and dignified experience through patient handling, medical beds, personal hygiene, disinfection, diagnostics, and the prevention of pressure injuries and venous thromboembolism. With over 6500 people worldwide and 65 years caring for patients and healthcare professionals, we are committed to driving healthier outcomes for people facing mobility challenges.</p>\n<p>For more information about Arjo visit <a href=\"http://www.arjo.com\">www.arjo.com</a></p>",
"experience_level": null,
"application_url": "https://jobs.arjo.com/job/Macquarie-Park-NSW-%28AUS%29-Digital-Marketing-Specialist-Medical-Devices%2C-Sydney%2C-Australia-New/1057148701/",
"language": "en",
"clearance_required": false,
"salary_min": null,
"salary_max": null,
"salary_currency": null
},
{
"id": 5017059,
"ext_id": "5689AF4733",
"company": {
"id": 22597,
"name": "Sanction Scanner",
"logo": "https://jobdataapi.com/media/company/logo/24/02/logo_img_t16YCyk.png",
"website_url": "https://sanctionscanner.com",
"linkedin_url": "https://www.linkedin.com/company/sanctionscanner/",
"twitter_handle": "SanctionScanner",
"github_url": "https://github.com/sanctionscanner"
},
"title": "Digital Marketing Specialist",
"location": "İstanbul, İstanbul, Turkey",
"types": [
{
"id": 1,
"name": "Full Time"
}
],
"cities": [
{
"geonameid": 745044,
"asciiname": "Istanbul",
"name": "Istanbul",
"country": {
"code": "TR",
"name": "Turkey",
"region": {
"id": 4,
"name": "Middle East"
}
},
"timezone": "Europe/Istanbul",
"latitude": "41.01384",
"longitude": "28.94966"
}
],
"countries": [
{
"code": "TR",
"name": "Turkey",
"region": {
"id": 4,
"name": "Middle East"
}
}
],
"regions": [
{
"id": 4,
"name": "Middle East"
}
],
"has_remote": false,
"published": "2024-04-05T00:00:00Z",
"description": "<p>Hi there! We are Sanction Scanner, a B2B SaaS Fintech company that prevents Financial Crime for its clients around the world. We are providing different Intelligent software with AI and Machine Learning technologies.</p><p></p><p>Sanction Scanner is trusted by 300+ brands from high-growth fintech to legacy high street banks and many prestigious companies like Iron Source, Unity, Papara, Koc, DLL, and the list goes on.</p><p></p><p>Our team believes in Innovation and keeps updating themselves always. We work closely with other Departments with agile teams, and we are not afraid of getting our hands dirty.</p><p>We are looking for Performance Marketing Specialist for accessing new Brands and countries, who will help and explain to them how Sanction Scanner prevents new clients from Financial Crime.</p><p><strong>Requirements</strong></p><ul> <li>Managing ad channels (LinkedIn, Instagram, Facebook, Twitter) Accounts</li> <li>Developing creative ideas with other teams for related channels</li> <li>Ability to manage strategies and processes in studies on new customer acquisition</li> <li>Tracking and reporting of customers' traffic and conversions with web analytics tools</li> </ul><ul> <li>Experienced in the use of reporting and tracking tools such as Google Search Console, Google Analytics, Google Tag Manager, Hubspot, Semrush, Ahrefs, GTMetrix, LightHouse.</li> <li>Experienced in SEO.</li> <li>Experienced in social media (LinkedIn, Instagram, Facebook) management and reporting.</li> <li>Experienced HTML editing is a plus</li> <li>Excellent written and oral communication skills in English.</li> </ul><p><strong>Benefits</strong></p><p></p><ul> <li> <strong>A Competitive Compensation Package </strong>-  NET Salary payment with additional fringe benefits.</li> <li> <strong>A meal compensation</strong> that is actually enough for a decent &amp; nutritious lunc</li> <li> <strong>Inclusive Health Benefits</strong> - We are here for you with comprehensive support whenever you need it</li> <li> <strong>Strong Appreciation and Reward Culture</strong> - Your impact on Sanction Scanner’s grow will be appreciated</li> <li> <strong>Digital Membership Support </strong>- A balance you can use for your digital memberships.</li> <li> <strong>Learning never ends! </strong>Training budget to help you grow in your role, gain new skills, and learn new things!</li> <li> <strong>No Dress Code. </strong>Dress as you like.</li> <li> <strong>Dream Team</strong>. Be a part of great team and grow together</li> <li> <strong>Software support.</strong> Subscription to any software you might need to perform at your best</li> <li> <strong>Experience an international work environment</strong> that fosters positive energy through a caring team.</li> <li> <strong>Be a part of shaping the future of Sanction Scanner </strong>by joining our innovative creators.</li> </ul><p> </p><p>We provide equal opportunity to all, we do not discriminate based on gender, sexual orientation, disabilities, religion, or social origin.</p><p></p><ul><li>If you are interested in this job, you can apply via LinkedIn with an updated CV.</li></ul>",
"experience_level": "SE",
"application_url": "https://apply.workable.com/j/5689AF4733/apply",
"language": "en",
"clearance_required": false,
"salary_min": null,
"salary_max": null,
"salary_currency": null
},