[
  {
    "id": 5037166,
    "ext_id": "743999979275403",
    "company": {
      "id": 11254,
      "name": "Epworth",
      "logo": "https://jobdataapi.com/media/company/logo/23/10/logo_img_tzcu3QC.png",
      "website_url": "https://www.epworth.org.au",
      "linkedin_url": "https://www.linkedin.com/company/epworth-",
      "twitter_handle": "Epworth",
      "github_url": null
    },
    "title": "Critical Care Registered Nurse - Coronary Care Unit",
    "location": "Geelong, Australia",
    "types": [
      {
        "id": 1,
        "name": "Full Time"
      }
    ],
    "cities": [
      {
        "geonameid": 2165798,
        "asciiname": "Geelong",
        "name": "Geelong",
        "country": {
          "code": "AU",
          "name": "Australia",
          "region": {
            "id": 2,
            "name": "Asia/Pacific"
          }
        },
        "timezone": "Australia/Melbourne",
        "latitude": "-38.14711",
        "longitude": "144.36069"
      }
    ],
    "countries": [
      {
        "code": "AU",
        "name": "Australia",
        "region": {
          "id": 2,
          "name": "Asia/Pacific"
        }
      }
    ],
    "regions": [
      {
        "id": 2,
        "name": "Asia/Pacific"
      }
    ],
    "has_remote": false,
    "published": "2024-04-09T03:29:40.406000Z",
    "description": "<h3>Company Description</h3><p>Epworth HealthCare is Victoria’s largest not-for-profit private health care group, renowned for excellence in diagnosis, treatment, care and rehabilitation. Epworth is an innovator in Australia’s health system, embracing the latest in evidence-based medicine to pioneer treatments and services for our patients. </p><p>Our values and purpose define Epworth's approach and delivery. We pride ourselves on communicating and delivering them in a real and meaningful way. Every Patient Matters.</p><h3>Job Description</h3><p>Working in a full time or part time capacity you will be part of a dynamic team in a growing Coronary Care Unit at Epworth Geelong in a modern environment. Offering a wide variety of cardiac services to the community, the team strives for excellence in patient care and providing an individual patient experience. </p><ul><li>We are a highly skilled team caring for patients with acute cardiac conditions and procedures such as Interventions/EP</li><li>8 acute cardiac beds + 15 cardiology/ Neuroscience telemetry beds</li><li>We manage patients with high acute cardiac and respiratory conditions that require monitoring and cardiac monitoring</li><li>We offer a supportive and friendly environment, and our focus is to deliver excellence in patient care in partnership with multidisciplinary teams, care givers and the wider community.</li><li>We provide ongoing training and development including post graduate education. </li></ul><p><strong>You will make an impact by:</strong></p><ul><li>Delivering an exceptional patient experience within the critical care environment</li><li>Providing a high standard of nursing care</li><li>Demonstrating empathy and compassion to patients, families and medical consultants</li></ul><p><strong>To be successful...</strong></p><p>You are a patient-centred Critical Care Registered Nurse who wants to join a friendly and welcoming team and is willing to grow as our service expands. You seek career satisfaction through working in a state-of-the-art environment, access to an abundance of education opportunities and opportunity for leadership development. </p><p><strong>You will have:</strong></p><ul><li>Current nursing registration with AHPRA</li><li>Post Graduate qualifications in Critical Care Nursing</li><li>Relevant acute experience</li><li>A valid Working With Children's Check </li><li>Cardiology experience essential</li></ul><p><a href=\"https://c.smartrecruiters.com/sr-company-attachments-prod-aws-dc5/628da3b877ce4f07a431c451/85bed9ce-32a3-430e-8e50-e5425fc272ab?r=s3-eu-central-1\">Position Description</a>       <a href=\"https://c.smartrecruiters.com/sr-company-attachments-prod-aws-dc5/628da3b877ce4f07a431c451/377af7c4-e47a-4c2c-8d57-1c413c3424ef?r=s3-eu-central-1\">Inherent Requirements</a></p><p><strong>About Epworth Geelong</strong></p><p>Epworth Geelong, located adjacent to Deakin University’s Medical School in Waurn Ponds, is developing an environment of world-class health care and education to meet the needs of the expanding population of Geelong and South West Victoria. Providing exciting career opportunities to doctors, nurses, allied health professionals and support staff. It features contemporary design, cutting-edge medical technology and best practice patient care, whilst offering a wide range of inpatient and outpatient medical, surgical and rehabilitation services.</p><h3>Additional Information</h3><p>At Epworth, it’s a community. It’s the sense of belonging and being part of an organisation that puts the patient in the centre of all that is done. In addition to this, you will have access to:</p><ul><li>Epworth’s enhanced Not for Profit status (and not available in the public sector) provides the opportunity for employees to salary package up to $15,900 pre-tax annually, leading to greater take home pay</li><li>The largest educational scholarship program of its kind in Australia</li><li>Ability to purchase up to four additional weeks of leave</li><li>Reduced cost of health services for you and your family at Epworth</li><li>Relocation assistance is available for approved candidates</li></ul><p><strong>At Epworth, we care.</strong></p><p>We care about our patients and we care about our people.  We care about keeping everyone safe.  We care about valuing and empowering our people, and growing careers.  And we care about giving our people support and flexibility to thrive, and contribute to our communities.</p><p><strong>Enquire/ Apply </strong></p><p>Sound interesting? To apply, click the <strong>I'm Interested </strong>button and attach your CV and cover letter.</p><p>For more information, refer to the attached position description or contact <strong>Epworth Talent </strong>on <strong>(03) 9426 0606 </strong></p><p><strong>Please Note: </strong> Applications will be reviewed as they are received, and the position may be filled before the application closing date.</p><p><em>It is a condition of employment with Epworth HealthCare, subject to reasonable exemptions, that you have had COVID-19 vaccinations, including where recommended by public health authorities and booster vaccinations.</em></p><p><em>As a child safe organisation, all successful applicants are required to satisfactorily clear a National Police Check (conducted by Epworth) and hold a valid employee Working with Children Check (provided by you).</em></p><p><em>At Epworth, we believe inclusion and diversity are essential to our culture and values. We focus on fairness and opportunity for all – across race, ability, ethnicity, gender, age, sexuality, cultures and beliefs – that reflect the communities we work in. At Epworth, we</em><em> care.</em></p>",
    "experience_level": "MI",
    "application_url": "https://jobs.smartrecruiters.com/Epworth/743999979275403-critical-care-registered-nurse-coronary-care-unit",
    "language": "en",
    "clearance_required": false,
    "salary_min": null,
    "salary_max": null,
    "salary_currency": null
  },
  {
    "id": 5054885,
    "ext_id": "R100075803",
    "company": {
      "id": 11694,
      "name": "University of Miami",
      "logo": "https://jobdataapi.com/media/company/logo/23/11/um.jpeg",
      "website_url": "https://www.miami.edu/",
      "linkedin_url": "https://www.linkedin.com/company/university-of-miami",
      "twitter_handle": "univmiami",
      "github_url": null
    },
    "title": "Registered Nurse 2 - Part time -Bascom Palmer Eye Institute",
    "location": "ABLEC/BPEI",
    "types": [
      {
        "id": 2,
        "name": "Part Time"
      }
    ],
    "cities": [],
    "countries": [],
    "regions": [],
    "has_remote": false,
    "published": "2024-04-09T00:00:00Z",
    "description": "<h2><u>Current Employees:</u></h2><p>If you are a current Staff, Faculty or Temporary employee at the University of Miami, please click <a href=\"https://www.myworkday.com/umiami/d/task/1422$7248.htmld\" rel=\"noopener noreferrer\" target=\"_blank\">here</a> to log in to Workday to use the internal application process. To learn how to apply for a faculty or staff position using the Career worklet, please review this <a href=\"https://my.it.miami.edu/wda/erpsec/tipsheets/ER_eRecruiting_ApplyforaJob.pdf\" rel=\"noopener noreferrer\" target=\"_blank\">tip sheet</a>.</p><p></p><p>The Bascom Palmer Eye Institute is currently seeking a part time Registered Nurse 2 to work in Miami. The Registered Nurse 2 delivers patient-family centered care in a culturally competent manner utilizing evidence-based standards of quality, safety, and service while ensuring population-specific patient care. The Registered Nurse 2 oversees nurses and allied health staff in their daily practice.</p><p></p><p>CORE JOB FUNCTIONS                </p><ul><li><h2>Assesses assigned patients and evaluates plans to include documentation of nursing care. Reports symptoms and changes in patients’ condition and vital signs.  Modifies patient treatment plans as indicated by patients’ responses, conditions and physician orders.</h2></li><li><h2>Reviews, evaluates and reports diagnostic tests to assess patient’s condition.</h2></li><li><h2>Consults with physicians and other healthcare professionals related to assigned patients to assess, plan, implement and evaluate patient care plans. </h2></li><li><h2>Prepares patients for, and assists with examinations, procedures and treatments.  Considers patient age and culture during patient treatments and provides any needed information regarding treatment plan.  Nurtures a compassionate environment by providing psychological support.</h2></li><li><h2>Performs appropriate patient tests and safely administers medications within the scope of practice.  Administers and maintains accurate records related to medications and treatments as per regulatory bodies, policies, procedures and physician orders.</h2></li><li><h2>Communicates plan of care in a timely manner to patient and family, as well as the appropriate team members, ensuring compliance with all regulatory guidelines (i.e. HIPAA).</h2></li><li><h2>Uses best practices for transition of patient care. Uses available resources to assist in discharge planning.</h2></li><li><h2>Plans, prioritizes, and adjusts assignments to accomplish goals and render superior patient care; seeks assistance when needed.</h2></li><li><h2>Adapts to changing work demands and environment. Safely operates medical equipment.</h2></li><li><h2>Serves as a preceptor and assists new staff in the provision of care in order to help them acclimate to the healthcare environment, and a direct patient care role. Provides concise and constructive feedback when needed.</h2></li><li><h2>Adheres to University and unit-level policies and procedures and safeguards University assets.</h2></li></ul><p></p><p>This list of duties and responsibilities is not intended to be all-inclusive and may be expanded to include other duties or responsibilities as necessary.</p><p></p><p>CORE QUALIFICATIONS                                                                                                          </p><p>Education:</p><p>Bachelor of Science in nursing</p><p></p><p>Certification and Licensing:</p><p>State of Florida Registered Nurse License</p><p>Basic Life Support Certification (BLS)</p><p></p><p>Experience:</p><p>Minimum 2 years of nursing experience</p><p></p><p>Knowledge, Skills and Attitudes:</p><ul><li><p>Knowledge of medical terminology</p></li><li><p>Knowledge of nursing care methods and procedures</p></li><li><p>In-depth knowledge of health and safety guidelines and procedures (i.e. sanitation, decontamination etc.)</p></li><li><p>Excellent patient experience skills</p></li><li><p>Ability to recognize, analyze, and solve a variety of problems.</p></li><li><p>Ability to maintain effective interpersonal relationships</p></li><li><p>Ability to communicate effectively in both oral and written form</p></li></ul><p></p><p>The University of Miami offers competitive salaries and a comprehensive benefits package including medical, dental, tuition remission and more.</p><p></p><p>UHealth-University of Miami Health System, South Florida's only university-based health system, provides leading-edge patient care powered by the ground breaking research and medical education at the Miller School of Medicine. As an academic medical center, we are proud to serve South Florida, Latin America and the Caribbean. Our physicians represent more than 100 specialties and sub-specialties, and have more than one million patient encounters each year. Our tradition of excellence has earned worldwide recognition for outstanding teaching, research and patient care. We're the challenge you've been looking for.</p><p></p><p>Patient safety is a top priority. As a result, during the Influenza (\"the flu\") season (September through April), the University Of Miami Miller School Of Medicine requires all employees who provide ongoing services to patients, work in a location (all Hospitals and clinics) where patient care is provided, or work in patient care or clinical care areas, to have an annual influenza vaccination. Failure to meet this requirement will result in rescinding or termination of employment.</p><p></p><p>The University of Miami is an Equal Opportunity Employer - Females/Minorities/Protected Veterans/Individuals with Disabilities are encouraged to apply. Applicants and employees are protected from discrimination based on certain categories protected by Federal law. Click <a href=\"https://www.hr.miami.edu/careers/eo-ada/index.html\" rel=\"noopener noreferrer\" target=\"_blank\">here</a> for additional information.</p><p></p><p>Job Status:</p>Part time<p></p><p>Employee Type:</p>Staff<p></p><p>Pay Grade:</p>H12",
    "experience_level": "MI",
    "application_url": "https://umiami.wd1.myworkdayjobs.com/en-US/UMCareerStaff/job/Miami-FL/Registered-Nurse-2---Part-time--Bascom-Palmer-Eye-Institute_R100075803",
    "language": "en",
    "clearance_required": false,
    "salary_min": null,
    "salary_max": null,
    "salary_currency": null
  },
  {
    "id": 5051850,
    "ext_id": "R0139939",
    "company": {
      "id": 11773,
      "name": "Fresenius Group",
      "logo": "https://jobdataapi.com/media/company/logo/23/11/fresenius_se_logo.jpeg",
      "website_url": "https://www.fresenius.com/",
      "linkedin_url": "https://www.linkedin.com/company/fresenius-se/",
      "twitter_handle": "Fresenius",
      "github_url": null
    },
    "title": "Outpatient Registered Nurse- RN",
    "location": "St Marys, GA",
    "types": [
      {
        "id": 1,
        "name": "Full Time"
      }
    ],
    "cities": [],
    "countries": [],
    "regions": [],
    "has_remote": false,
    "published": "2024-04-09T00:00:00Z",
    "description": "<p><u>PURPOSE AND SCOPE:</u></p><p>The professional registered nurse Outpatient RN CAP 1 is an entry level designation into the Clinical Advancement Program (CAP). This position is accountable and responsible for the provision and coordination of clinically competent care including assessment, planning, intervention and evaluation for an assigned group of patients. This may include delegation of appropriate tasks to direct patient care staff including but not limited to RNs, LVN/LPNs and Patient Care Technicians. As a member of the End Stage Kidney Disease (ESKD) health care team, this position participates in decision-making, teaching, leadership functions, and quality improvement activities that enhance patient care outcomes and facility operations.</p><p></p><p><u>PRINCIPAL DUTIES AND RESPONSIBILITIES:</u></p><p>All duties and responsibilities are expected to be performed in accordance with Fresenius Kidney Care policy, procedures, standards of nursing practice, state and federal regulations.</p><p></p><ul><li>Performs all essential functions under the direction of the Supervisor and with guidance from the Clinical Educator, Preceptor or in collaboration with other Registered Nurses.</li><li>Performs ongoing, systematic collection and analysis of patient data pre – during – post hemodialysis treatment for assigned patients and documents in the patient medical record, makes adjustments or modifications to treatment plan as indicated and notifies Team Leader, Charge Nurse, Supervisor or Physician as needed.</li><li>Assesses, collaborates, and documents patient/family’s basic learning needs to provide initial and ongoing education to patients and family.</li><li>Directs and provides, in collaboration with direct and ancillary patient care staff, all aspects of the daily provision of safe and effective delivery of hemodialysis therapy to assigned patients.</li><li>Administers medications as prescribed or in accordance with approved algorithm(s), and documents appropriate medical justification and effectiveness.</li><li>Initiates or assists with emergency response measures.</li><li>Serves as a resource for health care team, participates in staff training and orientation of new staff as assigned.</li><li>Ensures correct laboratory collection, processing and shipping procedures are performed and reschedules missed or insufficient laboratory collections.</li><li>Identifies expected outcomes, documents and updates the nursing assessment and plan of care for assigned patients through collaboration with the Interdisciplinary Team.</li><li>Ensures patient awareness related to transplant and treatment modality options.</li><li>Required to complete CAP requirements to advance.  </li><li>Performs all other duties as assigned by Supervisor.</li></ul><p></p><h2><u>PHYSICAL DEMANDS AND WORKING CONDITIONS:</u></h2><p>The physical demands and work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.</p><ul><li>The position provides direct patient care that regularly involves heavy lifting, moving of patients and assisting with ambulation.  Equipment aids and/or coworkers may provide assistance.</li><li>This position requires frequent, prolonged periods of standing and the employee must be able to bend over.</li><li>The employee may occasionally be required to move, with assistance, machines and equipment of up to 200 lbs., and may lift chemical and water solutions of up to 30 lbs. as high as 5 feet.</li><li>The work environment is characteristic of a health care facility with air temperature control and moderate noise levels.</li><li>May be exposed to infectious and contagious diseases/materials.</li><li>Day to day work includes desk work, computer work, interaction with patients, facility/hospital staff and physicians.</li><li>The position may require travel to training sites or other facilities.</li><li>May be asked to provide essential functions of this position in other locations with the same physical demands and working conditions as described above.</li><li>Employees are required to take the Ishihara's Color Blindness test as a condition of employment. Note that: Failing the Ishihara Test for Color Blindness does not preclude employment. The Company will consider whether reasonable accommodation can be made.</li></ul><p></p><p><u>SUPERVISION:</u></p><p>Assigned oversight of Patient Care Technicians/LPNs/LVNs/RNs as a Team Leader or designated Nurse in Charge, after meeting all the following:</p><ul><li>Successful completion of all FKC education and training requirements for new employees.</li><li>Must have a minimum of 9 months experience as a RN.</li><li>Must have a minimum of 3 months experience in chronic/acute hemodialysis as a RN.</li></ul><p></p><p><u>EDUCATION and LICENSURE: </u></p><ul><li>Graduate of an accredited School of Nursing.</li><li>Current appropriate state licensure.</li><li>Current or successful completion of CPR BLS Certification.</li><li>Must meet the practice requirements in the state in which he or she is employed.</li></ul><p></p><p><u>EXPERIENCE AND REQUIRED SKILLS:</u></p><ul><li>Entry level for RNs with less than 1 year of Nephrology Nursing experience in the last two years as a RN.</li><li>Minimum of 9 months experience as a Registered Nurse (preferred).</li><li>Chronic/acute hemodialysis experience (preferred).</li></ul><p></p><p></p><p><u>ACKNOWLEDGEMENT:</u></p><p>I acknowledge that I have read and accepted this job description. I understand what is expected of me in this position, and I am able to perform the essential functions as outlined with or without reasonable accommodation.  Furthermore, I understand that the duties and responsibilities listed in this job description are intended only as illustrations of the various types of work that may be performed.  The omission of specific statements of duties does not exclude them from the position if the work is similar, related, or a logical assignment to the position.  If I have any questions about duties and responsibilities not specified in this job description that I am asked to perform, I should discuss them with my immediate Supervisor or my Human Resources representative.</p><p></p><p></p><p></p><p>EO/AA Employer: Minorities/Females/Veterans/Disability/Sexual Orientation/Gender Identity</p><p> </p><p>Fresenius Medical Care North America maintains a drug-free workplace in accordance with applicable federal and state laws.</p><p>\"</p><p></p><p></p><p>EO/AA Employer: Minorities/Females/Veterans/Disability/Sexual Orientation/Gender Identity</p><p> </p><p>Fresenius Medical Care North America maintains a drug-free workplace in accordance with applicable federal and state laws.</p>",
    "experience_level": "MI",
    "application_url": "https://freseniusmedicalcare.wd3.myworkdayjobs.com/en-US/fme/job/St-Marys-GA-USA/Outpatient-Registered-Nurse--RN_R0139939",
    "language": "en",
    "clearance_required": false,
    "salary_min": null,
    "salary_max": null,
    "salary_currency": null
  },
  {
    "id": 5039440,
    "ext_id": "1050505766",
    "company": {
      "id": 15388,
      "name": "The Royal Children's Hospital",
      "logo": "https://jobdataapi.com/media/company/logo/23/12/logo_img_ECWRj0B.png",
      "website_url": "https://www.rch.org.au",
      "linkedin_url": "https://www.linkedin.com/company/the-royal-children's-hospital/",
      "twitter_handle": "RCHMelbourne",
      "github_url": null
    },
    "title": "Registered Nurse - Medical Care",
    "location": "50 Flemington Rd, AU",
    "types": [
      {
        "id": 1,
        "name": "Full Time"
      }
    ],
    "cities": [],
    "countries": [],
    "regions": [],
    "has_remote": false,
    "published": "2024-04-09T00:00:00Z",
    "description": "<p> </p>\n<p>The Hospital:</p>\n<p> </p>\n<p>The Royal Children’s Hospital’s (RCH) Vision is “A world where all kids thrive”.</p>\n<p>RCH is a cornerstone member of the Melbourne Children’s Campus, partnering with Murdoch Children’s Research Institute, The University of Melbourne Department of Paediatrics and The Royal Children’s Hospital Foundation. </p>\n<p>RCH has cared for the children and young people of Victoria for more than 150 years since it was founded in 1870. A full range of paediatrics and adolescent health services are provided plus tertiary and quaternary care for the most critically ill and medically complex patients in Victoria, Tasmania, southern NSW and other states around Australia and overseas. The Hospital has more than 6,000 staff, a budget of $850M, 12 wards and 350 beds. Annually, the RCH has 300,000+ Specialist Clinic appointments, 90,000+ Emergency Department presentations and 20,000 elective surgeries.</p>\n<p>The RCH is committed to the <a href=\"https://www.rch.org.au/quality/child-safety/\">Child Safe Standards</a>.  </p>\n<p>RCH enjoys high employee engagement and is committed to staff safety and a positive culture through enactment of our Compact.</p>\n<p>For further Information on RCH is available <a href=\"https://www.rch.org.au/home\">here</a>.</p>\n<p> </p>\n<p> </p>\n<ul>\n<li>Hub of the medical precinct and leading Children’s Hospital</li>\n<li>Fabulous employee benefits including salary packaging and onsite parking</li>\n<li>Friendly and supportive team environment</li>\n</ul>\n<p> </p>\n<p>About the Role:</p>\n<p> </p>\n<p>This is a Permanent Full Time or Part Time position up to 80 hours per fortnight within the Sugar Glider, Medical Care ward.</p>\n<p>In this role you will be responsible for ensuring that clinical practice and delivery of care is consistent with RCH and Australian Nursing and Midwifery Board standards. You will provide comprehensive, safe, evidence-based practice to facilitate optimal health outcomes for our patients. This opportunity within the Sugar Glider ward will use your integrated health care knowledge and skills to provide safe and effective care. We offer excellent professional development to enhance your nursing practice and conduct comprehensive and systematic nursing assessments to improve the quality of our nursing care.<br/>\n <br/>\nWhat you’ll achieve:</p>\n<p> </p>\n<ul>\n<li>Integrates nursing and health care knowledge, skills and attitudes to provide safe and effective care</li>\n<li>Participate in quality improvement activities</li>\n<li>Participate in professional development to enhance nursing practice</li>\n<li>Demonstrate analytical skills in accessing and evaluating health information and research evidence</li>\n<li>Practice within a professional &amp; ethical nursing framework</li>\n</ul>\n<p> <br/>\nClassification for this position with range from Grade 2 Year 2 to Grade 2 Year 8 (YP3-YP9) (FTE $71,333 to $95,378 per annum, plus superannuation).<br/>\n <br/>\nYour skills and experience:</p>\n<p> </p>\n<ul>\n<li>Current registration as a Registered Nurse with the Nursing and Midwifery Board of Australia (NMBA) administered though the Australian Health Practitioner Regulation Agency (APHRA)</li>\n<li>Demonstrated commitment to ongoing personal and professional development, as evidenced in a Continuing Professional Development (CPD) record/Profession al practice Portfolio (PPP)</li>\n<li>Recent acute paediatric nursing is desirable</li>\n</ul>\n<p> <br/>\nIf this sounds like you, click <a href=\"https://www.rch.org.au/uploadedFiles/Main/Content/successfactors/rn-pd-sugar-glider-oct-2022.pdf\">here</a> to view the position description.<br/>\n </p>\n<p>About Sugar Glider Ward, Medical Care ward:</p>\n<p> </p>\n<p>A specialist medical unit where a multidisciplinary team cares for children and infants with a diverse range of acute and chronic illnesses. The unit has four medical specialties: General Medicine, Respiratory medinie, ENT and Neuri Developmental Disability. Within these disciplines Sugar Glider cares for a variety of clinical conditions such as Bronchiolitis, Croup, Asthma and other respiratory illnesses through to chronic conditions such as Cystic Fibrosis. We also care for children who required chest drain insertion as well as infants and children with feeding difficulties. Children who have had a tracheostomy are cared for on the unit and Sugar Glider is also home to children who require ongoing ventilatory support such as CPAP, BiPAP and full ventilation via tracheostomy. In conjunction with the department of Respiratory Medicine sleep studies are conducted on this unit.</p>\n<p>The unit staff are friendly, supportive, take pride in their clinical skills, and are committed to family centered care that seeks to minimise the effects of hospitalization. Children whose admissions are prolonged or who have especially complex needs receive a modified primary nursing model of care led by our Nurse Coordinators.</p>\n<p> </p>\n<p>Registered Nurses are supported and encouraged to practice autonomously and to participate in ongoing professional development. A unit education program compliments the hospital program and is developed by the Clinical Support Nurses.</p>\n<p>Sugar Glider staff are comprised of a dedicated team of nurses. Comprehensive orientation is available for new staff on the unit with additional support available for those wishing to make the transition from adult to paediatric nursing.</p>\n<p>Sugar Glider - Medical Care also plays an important role in the support of <a href=\"javascript:void(0);\">undergraduate student nurse</a> placements, the  <a href=\"javascript:void(0);\">Graduate Nurse Program</a> and students undertaking the <a href=\"javascript:void(0);\">Postgraduate Diploma</a> in Nursing Practice - Paediatric stream.<br/>\n <br/>\nWhat we offer:</p>\n<p> </p>\n<ul>\n<li>Salary Packaging – Increase your take home pay!</li>\n<li>Staff Wellbeing Hub</li>\n</ul>\n<p> <br/>\nOther requirements:</p>\n<p> </p>\n<ul>\n<li>Current National Criminal Record Check, or willing to obtain</li>\n<li>Valid Working with Children Check</li>\n<li>Compliance with RCHs “Staff Immunisation - Prevention of Vaccine Preventable Diseases” procedure</li>\n</ul>\n<p> <br/>\nApplication process:</p>\n<p><br/>\nTo apply, you will need a resume and a tailored cover letter outlining your skills, experience, and suitability for the position in line with the requirements of the position description<br/>\nShortlisting for this position will commence immediately, we encourage you to apply promptly!<br/>\nFor more information about this position please contact Elise Dixon, Nurse Unit Manager on Ph: 0435 968 836 or Email: elise.dixon@rch.org.au</p>\n<p> </p>\n<p> </p>\n<p>Why work at the RCH?</p>\n<p> </p>\n<p>RCH enjoys high employee engagement and is committed to staff safety and a positive culture through enactment of our Compact. We offer the opportunity to work in world-class facilities,  surrounded by Royal Park and only a short tram trip from the heart of Melbourne city.</p>\n<p>We also offer discounted staff parking, salary packaging, and an award-winning health and wellbeing program.</p>\n<p><em>The RCH is committed to a diverse and inclusive workforce. We encourage applications from Aboriginal and Torres Strait Islander people, people from culturally and/or linguistically diverse background,  all members of the LGBTQI community and people with disability.</em></p>\n<p>It is a requirement of your employment that you be fully vaccinated against Covid-19, and Influenza annually for Category A and B roles, in compliance with any public health orders in place at the relevant time, unless you have a medical exception in line with those public health orders, which has been accepted by The Royal Children’s Hospital.  Applicants will be required to provide their Australian Government Immunisation History Statement, it is a requirement of the RCH to collect, record and hold vaccination information.</p>\n<p>It is also a requirement of your employment that you comply with any direction given by The Royal Children’s Hospital that you be vaccinated against, or prove immunity to, any other disease, unless you have a relevant exemption</p>\n<p> </p>\n<p>Are you ready to join our team? </p>\n<p> Apply online by clicking on the “Apply” button</p>\n<p>Applications close 7 May 2024</p>\n<p> </p>",
    "experience_level": null,
    "application_url": "https://careers.rch.org.au/job/50-Flemington-Rd-Registered-Nurse-Medical-Care/1050505766/",
    "language": "en",
    "clearance_required": false,
    "salary_min": "71333",
    "salary_max": "95378",
    "salary_currency": "USD"
  },
  {
    "id": 5033663,
    "ext_id": "c84aa4be-584a-4b93-8624-8f33d5aa78be",
    "company": {
      "id": 21519,
      "name": "Mission Healthcare",
      "logo": "https://jobdataapi.com/media/company/logo/24/02/logo_img_DDRDvmW.png",
      "website_url": "https://www.homewithmission.com/",
      "linkedin_url": "https://www.linkedin.com/company/homewithmission",
      "twitter_handle": "homewithmission",
      "github_url": null
    },
    "title": "Registered Nurse Case Manager (RNCM) – Home Health",
    "location": "Carson City, NV",
    "types": [
      {
        "id": 1,
        "name": "Full Time"
      }
    ],
    "cities": [
      {
        "geonameid": 5501344,
        "asciiname": "Carson City",
        "name": "Carson City",
        "country": {
          "code": "US",
          "name": "United States",
          "region": {
            "id": 5,
            "name": "North America"
          }
        },
        "timezone": "America/Los_Angeles",
        "latitude": "39.16380",
        "longitude": "-119.76740"
      }
    ],
    "countries": [
      {
        "code": "US",
        "name": "United States",
        "region": {
          "id": 5,
          "name": "North America"
        }
      }
    ],
    "regions": [
      {
        "id": 5,
        "name": "North America"
      }
    ],
    "has_remote": false,
    "published": "2024-04-08T21:50:43Z",
    "description": "<u>Be part of providing an exceptional patient experience.</u><br/>About Us:Healthy Living at Home is a leading home healthcare provider committed to delivering high-quality, compassionate care to our patients. We are dedicated to improving the health and well-being of individuals in the comfort of their homes. Join our team and be a part of making a positive impact on the lives of those we serve.<br/>Position Overview:We are currently seeking a skilled and experienced Home Health RN Case Manager to join our team in Carson City. As an RN Case Manager, you will play a crucial role in coordinating and providing comprehensive home health services to our patients. <br/><br/>This is a Full-Time position with a competitive compensation package ranging from $104,000-$115,000 per hour, based on a Pay Per Visit Model.\n<h3>Responsibilities:</h3>\n<ul>\n<li>Conduct initial assessments and develop individualized care plans for patients.</li><li>Coordinate and provide skilled nursing care in a home setting.</li><li>Collaborate with interdisciplinary healthcare teams to ensure the best possible patient outcomes.</li><li>Educate patients and their families on healthcare management and promote self-care.</li><li>Monitor and evaluate patients' progress and adjust care plans as needed.</li></ul>\n<h3>Qualifications:</h3>\n<ul>\n<li>Current and valid Registered Nurse (RN) license in the state of Nevada.</li><li>Minimum of 1 year of experience in home health or a related field.</li><li>Strong clinical and assessment skills.</li><li>Excellent communication and interpersonal skills.</li><li>Ability to work independently and as part of a collaborative team.</li></ul><br/><br/><br/><br/>Mission Healthcare Family of Companies includes Mission Home Health, Mission Hospice, Moniker Hospice, Healthy Living at Home, Tender Care, Sun Tree, Hands of Hope, Advanced Healthcare Services, One Care and Compass at Home. EOE - M/F/Disabled/Veterans - Reasonable AccommodationIt is our business philosophy and practice to provide reasonable accommodations, according to applicable state and federal laws, to all qualified individuals with physical or mental disabilities.",
    "experience_level": "MI",
    "application_url": "https://jobs.lever.co/missionhh/c84aa4be-584a-4b93-8624-8f33d5aa78be",
    "language": "en",
    "clearance_required": false,
    "salary_min": "104000",
    "salary_max": "115000",
    "salary_currency": "USD"
  },
  {
    "id": 5040778,
    "ext_id": "743999979218843",
    "company": {
      "id": 8836,
      "name": "Northwestern Memorial Healthcare",
      "logo": "https://jobdataapi.com/media/company/logo/23/07/NorthwesternMed.jpg",
      "website_url": "https://www.nm.org",
      "linkedin_url": "https://www.linkedin.com/company/northwestern-medicine",
      "twitter_handle": "NorthwesternMed",
      "github_url": null
    },
    "title": "Registered Nurse PACU Full Time Days",
    "location": "McHenry, IL, United States",
    "types": [
      {
        "id": 1,
        "name": "Full Time"
      }
    ],
    "cities": [
      {
        "geonameid": 4901663,
        "asciiname": "McHenry",
        "name": "McHenry",
        "country": {
          "code": "US",
          "name": "United States",
          "region": {
            "id": 5,
            "name": "North America"
          }
        },
        "timezone": "America/Chicago",
        "latitude": "42.33335",
        "longitude": "-88.26675"
      }
    ],
    "countries": [
      {
        "code": "US",
        "name": "United States",
        "region": {
          "id": 5,
          "name": "North America"
        }
      }
    ],
    "regions": [
      {
        "id": 5,
        "name": "North America"
      }
    ],
    "has_remote": false,
    "published": "2024-04-08T20:22:31.965000Z",
    "description": "<h3>Company Description</h3><p>At Northwestern Medicine, every patient interaction makes a difference in cultivating a positive workplace. This patient-first approach is what sets us apart as a leader in the healthcare industry. As an integral part of our team, you'll have the opportunity to join our quest for better healthcare, no matter where you work within the Northwestern Medicine system. At Northwestern Medicine, we pride ourselves on providing competitive benefits: from tuition reimbursement and loan forgiveness to 401(k) matching and lifecycle benefits, we take care of our employees. Ready to join our quest for better?</p><h3>Job Description</h3><p>The <u><strong>Staff Nurse Inpatient </strong></u>reflects the mission, vision, and values of NM, adheres to the organization’s Code of Ethics and Corporate Compliance Program, and complies with all relevant policies, procedures, guidelines and all other regulatory and accreditation standards.</p><p>The Staff Nurse Inpatient is a clinically competent, registered, professional nurse who prescribes, delegates and coordinates nursing care to the acutely ill patient through the nursing process of assessment, planning, intervention, implementation and evaluation. Effectively interacts with patient, significant others, and other health team members, while maintaining ANA standards of professional nursing practice.</p><p><strong><u>Responsibilities:</u></strong></p><ul><li>Collects and analyzes data, identifies expected outcomes, develops and implements an individualized plan, coordinates care delivery and evaluates progress toward attainment of outcomes.</li><li>Directs care and determines the appropriate utilization of any assistant involved in providing direct patient care.</li><li>Collaborates with patient, family, physicians and ancillary staff. Creates a documented plan, focused on outcomes and decisions related to the care and delivery of services that indicates communications with patients, families, and others.</li><li>Participates in shared governance, committee work, and unit projects.</li><li>Evaluates and documents the patient’s responses to nursing interventions in the health record and properly individualizes the plan of care based on the evaluation of findings.</li><li>Utilizes the best available evidence, including research findings to guide practice decisions.</li></ul><h3>Qualifications</h3><p><strong><u>Required</u>:</strong></p><ul><li>Bachelor of Science in Nursing (BSN)</li><li>Current State of Illinois Registered Professional Nurse</li><li>American Heart Association Basic Life Support (BLS)</li><li>ACLS</li><li>Strong interpersonal skills</li><li>Ability to collaborate with others</li><li>Strong analytic abilities</li><li>Associate Degree Nursing (ADN) acceptable with commitment to obtain a BSN from an accredited program within three years of first day of employment in clinical nurse role.</li></ul><p><strong><u>Preferred: </u></strong></p><ul><li>Experience in specific clinical area</li><li>BSN</li></ul><h3>Additional Information</h3><p>Northwestern Medicine is an affirmative action/equal opportunity employer and does not discriminate in hiring or employment on the basis of age, sex, race, color, religion, national origin, gender identity, veteran status, disability, sexual orientation or any other protected status.</p>",
    "experience_level": "MI",
    "application_url": "https://jobs.smartrecruiters.com/NorthwesternMedicine/743999979218843-registered-nurse-pacu-full-time-days",
    "language": "en",
    "clearance_required": false,
    "salary_min": null,
    "salary_max": null,
    "salary_currency": null
  },
  {
    "id": 5031666,
    "ext_id": "7323820002",
    "company": {
      "id": 16931,
      "name": "BAYADA Home Health Care",
      "logo": "https://jobdataapi.com/media/company/logo/23/12/logo_img_PRpAEwu.png",
      "website_url": "https://www.bayada.com/",
      "linkedin_url": "https://www.linkedin.com/company/bayada-home-health-care/",
      "twitter_handle": "joinbayada",
      "github_url": null
    },
    "title": "Registered Nurse Case Manager- Hospice",
    "location": "Harrisburg, PA 17102 | 40.271443625 | -76.890113107",
    "types": [
      {
        "id": 1,
        "name": "Full Time"
      }
    ],
    "cities": [
      {
        "geonameid": 5192726,
        "asciiname": "Harrisburg",
        "name": "Harrisburg",
        "country": {
          "code": "US",
          "name": "United States",
          "region": {
            "id": 5,
            "name": "North America"
          }
        },
        "timezone": "America/New_York",
        "latitude": "40.27370",
        "longitude": "-76.88442"
      }
    ],
    "countries": [
      {
        "code": "US",
        "name": "United States",
        "region": {
          "id": 5,
          "name": "North America"
        }
      }
    ],
    "regions": [
      {
        "id": 5,
        "name": "North America"
      }
    ],
    "has_remote": false,
    "published": "2024-04-08T19:55:53Z",
    "description": "<h3> </h3>\n<h3>We have a Full Time <strong>Registered Nurse Case Manager </strong>opportunity available now</h3>\n<h3><strong>with our </strong>Pennsylvania Harrisburg Hospice Office</h3>\n<h3><strong>throughout Dauphin and Cumberland Counties. </strong></h3>\n<h3><strong><em>Flexible schedules, 1:1 care, and great work/life balance. Join us today!</em></strong></h3>\n<h3> </h3>\n<p> </p>\n<p></p>\n<p> </p>\n<p> </p>\n<p><strong>Registered Nurse (RN) Benefits:</strong></p>\n<ul>\n<li>BAYADA offers a comprehensive benefits plan that includes the following: Paid holidays, vacation and sick leave, vision, dental and medical health plans, employer paid life insurance, 401k with company match, direct deposit and employee assistance program</li>\n<li>To learn more about BAYADA Benefits, <a href=\"https://www.bayada.com/benefits/\">click here</a></li>\n<li>Enjoy being part of a team that cares and a company that believes in leading with our values.</li>\n<li><strong>Feel confident, safe, and supported with PPE supplies, comprehensive infection prevention protocol, daily pre-screens, and close monitoring of the COVID-19 outbreak.</strong></li>\n<li>Develop your skills with training and scholarship opportunities.</li>\n<li>Advance your career with specially designed career tracks.</li>\n<li>Be recognized and rewarded for your compassion, excellence, and reliability.</li>\n<li>Benefits may include medical, dental, vision, and life insurance; mileage reimbursement; paid time off; weekly pay and direct deposit; scholarship opportunities; one-on-one training; recognition programs; referral bonuses; 401(k) with company match; and opportunities for career advancement.</li>\n</ul>\n<p><strong>Registered Nurse (RN) Responsibilities:</strong></p>\n<ul>\n<li>Follow a designated care plan in accordance with patient's needs </li>\n<li>Make home visits to clients in designated geographic territories</li>\n<li>Perform assigned duties, including administration of medication, wound care, treatments, and procedures</li>\n<li>Monitor clients' conditions; reporting changes to Clinical or Client Services Manager</li>\n<li>Follow up with, execute, and properly document doctors' orders</li>\n<li>Perform client assessments as necessary</li>\n<li>Case management and coordination</li>\n<li>Accurately document observations, interventions, and evaluations pertaining to client care management and services provided, utilizing a state-of-the-art touch pad tablet</li>\n</ul>\n<p><strong>Qualifications for a Registered Nurse (RN):</strong></p>\n<ul>\n<li>A current license as a Registered Nurse in <strong>Pennsylvania.</strong></li>\n<li>A minimum of one year of recent, verifiable clinical (medical/surgical) experience.</li>\n<li>Prior home care experience strongly preferred, but not required.</li>\n<li>Graduation from an accredited and approved nursing program, as indicated by school transcript or diploma.</li>\n<li>Ability to work independently and manage time effectively.</li>\n<li>Strong interpersonal skills.</li>\n<li>Solid computer skills; prior experience with electronic medical records (EMR) preferred.</li>\n<li>Ability to travel to cases as assigned. </li>\n</ul>\n<p>BAYADA recognizes and rewards our RNs who set and maintain the highest standards of excellence. Join our caring team today!</p><p><strong>As an accredited, regulated, certified, and licensed home health care provider, BAYADA complies with all state/local mandates.</strong></p>\n<p>BAYADA Home Health Care, Inc., and its associated entities and joint venture partners, are Equal Opportunity Employers. All employment decisions are made on a non-discriminatory basis without regard to sex, race, color, age, disability, pregnancy or maternity, sexual orientation, gender identity, citizenship status, military status, or any other similarly protected status in accordance with federal, state and local laws.  Hence, we strongly encourage applications from people with these identities or who are members of other marginalized communities.</p>",
    "experience_level": "MI",
    "application_url": "https://jobs.bayada.com/en/jobs?gh_jid=7323820002",
    "language": "en",
    "clearance_required": false,
    "salary_min": null,
    "salary_max": null,
    "salary_currency": null
  },
  {
    "id": 5031667,
    "ext_id": "7323492002",
    "company": {
      "id": 16931,
      "name": "BAYADA Home Health Care",
      "logo": "https://jobdataapi.com/media/company/logo/23/12/logo_img_PRpAEwu.png",
      "website_url": "https://www.bayada.com/",
      "linkedin_url": "https://www.linkedin.com/company/bayada-home-health-care/",
      "twitter_handle": "joinbayada",
      "github_url": null
    },
    "title": "Registered Nurse, Home Health-Sr Living, Full Time",
    "location": "Silver Spring, MD 20901 | 39.019055805 | -77.007781249",
    "types": [
      {
        "id": 1,
        "name": "Full Time"
      }
    ],
    "cities": [
      {
        "geonameid": 4369596,
        "asciiname": "Silver Spring",
        "name": "Silver Spring",
        "country": {
          "code": "US",
          "name": "United States",
          "region": {
            "id": 5,
            "name": "North America"
          }
        },
        "timezone": "America/New_York",
        "latitude": "38.99067",
        "longitude": "-77.02609"
      }
    ],
    "countries": [
      {
        "code": "US",
        "name": "United States",
        "region": {
          "id": 5,
          "name": "North America"
        }
      }
    ],
    "regions": [
      {
        "id": 5,
        "name": "North America"
      }
    ],
    "has_remote": false,
    "published": "2024-04-08T19:46:02Z",
    "description": "<h3>We have a <strong>Registered Nurse </strong>opportunity open now doing visits in Senior Living communities in<strong> the Montgomery County – Bethesda/Silver Spring area. </strong></h3>\n<h3><strong><em>Flexible schedules, 1:1 care, and great work/life balance. Join us today!</em></strong></h3>\n<h3> </h3>\n<p><strong></strong></p>\n<p><strong>Registered Nurse (RN) Benefits:</strong></p>\n<ul>\n<li>BAYADA offers a comprehensive benefits plan that includes the following: Paid holidays, vacation and sick leave, vision, dental and medical health plans, employer paid life insurance, 401k with company match, direct deposit and employee assistance program</li>\n<li>To learn more about BAYADA Benefits, <a href=\"https://www.bayada.com/benefits/\">click here</a></li>\n<li>Enjoy being part of a team that cares and a company that believes in leading with our values.</li>\n<li><strong>Feel confident, safe, and supported with PPE supplies, comprehensive infection prevention protocol, daily pre-screens, and close monitoring of the COVID-19 outbreak.</strong></li>\n<li>Develop your skills with training and scholarship opportunities.</li>\n<li>Advance your career with specially designed career tracks.</li>\n<li>Be recognized and rewarded for your compassion, excellence, and reliability.</li>\n<li>Benefits may include medical, dental, vision, and life insurance; mileage reimbursement; paid time off; weekly pay and direct deposit; scholarship opportunities; one-on-one training; recognition programs; referral bonuses; 401(k) with company match; and opportunities for career advancement.</li>\n</ul>\n<p><strong>Registered Nurse (RN) Responsibilities:</strong></p>\n<ul>\n<li>Follow a designated care plan in accordance with patient's needs </li>\n<li>Make home visits to clients in designated geographic territories</li>\n<li>Perform assigned duties, including administration of medication, wound care, treatments, and procedures</li>\n<li>Monitor clients' conditions; reporting changes to Clinical or Client Services Manager</li>\n<li>Follow up with, execute, and properly document doctors' orders</li>\n<li>Perform client assessments as necessary</li>\n<li>Case management and coordination</li>\n<li>Accurately document observations, interventions, and evaluations pertaining to client care management and services provided, utilizing a state-of-the-art touch pad tablet</li>\n</ul>\n<p><strong>Qualifications for a Registered Nurse (RN):</strong></p>\n<ul>\n<li>A current license as a Registered Nurse in <strong>MD.</strong></li>\n<li>A minimum of one year of recent, verifiable clinical (medical/surgical) experience.</li>\n<li>Prior home care experience strongly preferred, but not required.</li>\n<li>Graduation from an accredited and approved nursing program, as indicated by school transcript or diploma.</li>\n<li>Ability to work independently and manage time effectively.</li>\n<li>Strong interpersonal skills.</li>\n<li>Solid computer skills; prior experience with electronic medical records (EMR) preferred.</li>\n<li>Ability to travel to cases as assigned. </li>\n</ul>\n<p>BAYADA recognizes and rewards our RNs who set and maintain the highest standards of excellence. Join our caring team today!</p><p><strong>As an accredited, regulated, certified, and licensed home health care provider, BAYADA complies with all state/local mandates.</strong></p>\n<p>BAYADA Home Health Care, Inc., and its associated entities and joint venture partners, are Equal Opportunity Employers. All employment decisions are made on a non-discriminatory basis without regard to sex, race, color, age, disability, pregnancy or maternity, sexual orientation, gender identity, citizenship status, military status, or any other similarly protected status in accordance with federal, state and local laws.  Hence, we strongly encourage applications from people with these identities or who are members of other marginalized communities.</p>",
    "experience_level": "SE",
    "application_url": "https://jobs.bayada.com/en/jobs?gh_jid=7323492002",
    "language": "en",
    "clearance_required": false,
    "salary_min": null,
    "salary_max": null,
    "salary_currency": null
  },
  {
    "id": 5040853,
    "ext_id": "9200742151453_1",
    "company": {
      "id": 22834,
      "name": "BrightStar Care",
      "logo": "https://jobdataapi.com/media/company/logo/24/02/brightstarcare_logo.jpeg",
      "website_url": "https://www.brightstarcare.com/",
      "linkedin_url": "https://www.linkedin.com/company/brightstarcare/",
      "twitter_handle": null,
      "github_url": null
    },
    "title": "Registered Nurse",
    "location": "FL - Pensacola, Pensacola, FL, US",
    "types": [
      {
        "id": 1,
        "name": "Full Time"
      }
    ],
    "cities": [
      {
        "geonameid": 4168228,
        "asciiname": "Pensacola",
        "name": "Pensacola",
        "country": {
          "code": "US",
          "name": "United States",
          "region": {
            "id": 5,
            "name": "North America"
          }
        },
        "timezone": "America/Chicago",
        "latitude": "30.42131",
        "longitude": "-87.21691"
      }
    ],
    "countries": [
      {
        "code": "US",
        "name": "United States",
        "region": {
          "id": 5,
          "name": "North America"
        }
      }
    ],
    "regions": [
      {
        "id": 5,
        "name": "North America"
      }
    ],
    "has_remote": false,
    "published": "2024-04-08T19:46:00Z",
    "description": "<p>Join the BrightStar Team as a Registered Nurse (RN) and Shine! </p><p><br/></p><p>Do you enjoy spending more time with your patients?  Our RN’s bring compassion and comfort to home care by giving personalized One-to-One care that makes a noticeable difference in the lives of our patients.  Our nurses are the heart of our company - the BrightSTARS to our patients. </p><p><br/></p><p id=\"isPasted\"><strong>Pensacola, FL</strong></p><p><strong>FT Night Position - 12/hr shifts </strong></p><p><strong>Pediatric patient between 2-5 years old</strong></p><p><strong>Trach - G-tube - Oxygen </strong></p><p><br/></p><p>Registered Nurse (RN) Responsibilities: </p><ul><li><p>Provide 1:1 care in the patient’s home. </p></li><li><p>Implement treatment and plan of care using sound judgment and critical thinking. </p></li><li><p>Maintain accurate, detailed, and timely documentation consistent with the care plan and nursing processes. </p></li><li><p>Perform all skills, treatments, and procedures to the scope of practice defined in the Nurse Practice Act in the state of clinical practice and adhere to the company policy, procedures, and protocols. </p></li></ul><p>Here are some of the perks: </p><ul><li><p>Weekly pay w/direct deposit </p></li><li><p>Flexible scheduling </p></li><li><p>Growth opportunities </p></li></ul><p>Registered Nurse (RN) Qualifications: </p><ul><li><p>An unencumbered license as a Registered Nurse (RN) in the state where care is provided </p></li><li><p>Minimum of (1) year nursing experience </p></li><li><p>Excellent problem-solving skills and organizational and multi-tasking skills </p></li><li><p>In-depth knowledge of health and safety guidelines and procedures (sanitation, decontamination, etc.) and willingness to follow them at all times </p></li><li><p>Valid Driver's License, Auto Insurance, BLS CPR card, and an up-to-date TB skin test or Chest X-Ray </p></li><li><p>Must be able to stand, walk, squat, bend, kneel, reach, twist, push, and pull </p></li><li><p>Must be able to lift or transfer up to 50 pounds </p></li></ul><p> </p><p>Candidate must have demonstrated alignment and experience in successfully living the BrightStar Care Core Values: </p><ul><li><p>Be Open and Honest: Approachable, Fun, Unflappable, Kind, Empathetic </p></li><li><p>Serve with Passion: Help First, Confident Yet Humble, For the Greater Good, Make a Real Difference </p></li><li><p>Do the Right Thing: Honest, Ethical, Tell the Truth </p></li><li><p>Do What You Say: On Time, Finish What You Start, Accountable, Take Responsibility </p></li><li><p>Make it Great: Continuous Improvement, Exceed Expectations, Bring Out the Best in Others, Detail Oriented </p></li></ul><p> </p><p>Equal Opportunity Employer </p><p>BrightStar Care is proud to be an equal opportunity employer and is committed to maintaining a diverse and inclusive work environment. All qualified applicants will receive considerations for employment without regard to race, color, religion, sex, age, disability, marital status, familial status, sexual orientation, pregnancy, genetic information, gender identity, gender expression, national origin, ancestry, citizenship status, veteran status, and any other legally protected status under federal, state, or local anti-discrimination laws.  BrightStar Care participates in E-Verify. </p><p>Disability Accommodation </p><p>For individuals with disabilities that need additional assistance at any point in the application and interview process, please email <a href=\"mailto:BrightStarHR@brightstarcare.com\" rel=\"noreferrer noopener\" target=\"_blank\">BrightStarHR@brightstarcare.com</a>.  </p>",
    "experience_level": "MI",
    "application_url": "https://workforcenow.adp.com/mascsr/default/mdf/recruitment/recruitment.html?cid=448700bd-e79c-46c5-93d8-185b819e9acb&jobId=503880",
    "language": "en",
    "clearance_required": false,
    "salary_min": null,
    "salary_max": null,
    "salary_currency": null
  },
  {
    "id": 5040858,
    "ext_id": "9200742138578_1",
    "company": {
      "id": 22834,
      "name": "BrightStar Care",
      "logo": "https://jobdataapi.com/media/company/logo/24/02/brightstarcare_logo.jpeg",
      "website_url": "https://www.brightstarcare.com/",
      "linkedin_url": "https://www.linkedin.com/company/brightstarcare/",
      "twitter_handle": null,
      "github_url": null
    },
    "title": "Pediatric Registered Nurse (RN)",
    "location": "FL - Pensacola, Pensacola, FL, US | Defuniak Springs, FL, DeFuniak Springs, FL, US",
    "types": [
      {
        "id": 1,
        "name": "Full Time"
      }
    ],
    "cities": [
      {
        "geonameid": 4168228,
        "asciiname": "Pensacola",
        "name": "Pensacola",
        "country": {
          "code": "US",
          "name": "United States",
          "region": {
            "id": 5,
            "name": "North America"
          }
        },
        "timezone": "America/Chicago",
        "latitude": "30.42131",
        "longitude": "-87.21691"
      }
    ],
    "countries": [
      {
        "code": "US",
        "name": "United States",
        "region": {
          "id": 5,
          "name": "North America"
        }
      }
    ],
    "regions": [
      {
        "id": 5,
        "name": "North America"
      }
    ],
    "has_remote": false,
    "published": "2024-04-08T19:24:00Z",
    "description": "<p>Join the BrightStar Team as a Registered Nurse (RN) and Shine! </p><p><br/></p><p>Do you enjoy spending more time with your patients?  Our RN’s bring compassion and comfort to home care by giving personalized One-to-One care that makes a noticeable difference in the lives of our patients.  Our nurses are the heart of our company - the BrightSTARS to our patients. </p><p><br/></p><p id=\"isPasted\"><strong>Defuniak Springs, FL - FT/Days 12/hr shifts</strong></p><p><strong>Twins w/developmental delays</strong></p><p><strong>Respiratory complexity</strong></p><p><strong>g-tube/continuous night feeds</strong></p><p><br/></p><p>Registered Nurse (RN) Responsibilities: </p><ul><li><p>Provide 1:1 care in the patient’s home. </p></li><li><p>Implement treatment and plan of care using sound judgment and critical thinking. </p></li><li><p>Maintain accurate, detailed, and timely documentation consistent with the care plan and nursing processes. </p></li><li><p>Perform all skills, treatments, and procedures to the scope of practice defined in the Nurse Practice Act in the state of clinical practice and adhere to the company policy, procedures, and protocols. </p></li></ul><p>Here are some of the perks: </p><ul><li><p>Weekly pay w/direct deposit </p></li><li><p>Flexible scheduling </p></li><li><p>Growth opportunities </p></li></ul><p>Registered Nurse (RN) Qualifications: </p><ul><li><p>An unencumbered license as a Registered Nurse (RN) in the state where care is provided </p></li><li><p>Minimum of (1) year nursing experience </p></li><li><p>Excellent problem-solving skills and organizational and multi-tasking skills </p></li><li><p>In-depth knowledge of health and safety guidelines and procedures (sanitation, decontamination, etc.) and willingness to follow them at all times </p></li><li><p>Up-to-date Level 2 AHCA Background, Valid Driver's License, Auto Insurance, BLS CPR card, and an up-to-date TB skin test or Chest X-Ray </p></li><li><p>Must be able to stand, walk, squat, bend, kneel, reach, twist, push, and pull </p></li><li><p>Must be able to lift or transfer up to 50 pounds </p></li></ul><p> </p><p>Candidate must have demonstrated alignment and experience in successfully living the BrightStar Care Core Values: </p><ul><li><p>Be Open and Honest: Approachable, Fun, Unflappable, Kind, Empathetic </p></li><li><p>Serve with Passion: Help First, Confident Yet Humble, For the Greater Good, Make a Real Difference </p></li><li><p>Do the Right Thing: Honest, Ethical, Tell the Truth </p></li><li><p>Do What You Say: On Time, Finish What You Start, Accountable, Take Responsibility </p></li><li><p>Make it Great: Continuous Improvement, Exceed Expectations, Bring Out the Best in Others, Detail Oriented </p></li></ul><p> </p><p>Equal Opportunity Employer </p><p>BrightStar Care is proud to be an equal opportunity employer and is committed to maintaining a diverse and inclusive work environment. All qualified applicants will receive considerations for employment without regard to race, color, religion, sex, age, disability, marital status, familial status, sexual orientation, pregnancy, genetic information, gender identity, gender expression, national origin, ancestry, citizenship status, veteran status, and any other legally protected status under federal, state, or local anti-discrimination laws.  BrightStar Care participates in E-Verify. </p><p>Disability Accommodation </p><p>For individuals with disabilities that need additional assistance at any point in the application and interview process, please email <a href=\"mailto:BrightStarHR@brightstarcare.com\" rel=\"noreferrer noopener\" target=\"_blank\">BrightStarHR@brightstarcare.com</a>.  </p>",
    "experience_level": null,
    "application_url": "https://workforcenow.adp.com/mascsr/default/mdf/recruitment/recruitment.html?cid=448700bd-e79c-46c5-93d8-185b819e9acb&jobId=503877",
    "language": "en",
    "clearance_required": false,
    "salary_min": null,
    "salary_max": null,
    "salary_currency": null
  },
  {
    "id": 5040863,
    "ext_id": "9200742137590_1",
    "company": {
      "id": 22834,
      "name": "BrightStar Care",
      "logo": "https://jobdataapi.com/media/company/logo/24/02/brightstarcare_logo.jpeg",
      "website_url": "https://www.brightstarcare.com/",
      "linkedin_url": "https://www.linkedin.com/company/brightstarcare/",
      "twitter_handle": null,
      "github_url": null
    },
    "title": "Pediatric Registered Nurse (RN)",
    "location": "FL - Pensacola, Pensacola, FL, US | Defuniak Springs, FL, DeFuniak Springs, FL, US",
    "types": [
      {
        "id": 1,
        "name": "Full Time"
      }
    ],
    "cities": [
      {
        "geonameid": 4168228,
        "asciiname": "Pensacola",
        "name": "Pensacola",
        "country": {
          "code": "US",
          "name": "United States",
          "region": {
            "id": 5,
            "name": "North America"
          }
        },
        "timezone": "America/Chicago",
        "latitude": "30.42131",
        "longitude": "-87.21691"
      }
    ],
    "countries": [
      {
        "code": "US",
        "name": "United States",
        "region": {
          "id": 5,
          "name": "North America"
        }
      }
    ],
    "regions": [
      {
        "id": 5,
        "name": "North America"
      }
    ],
    "has_remote": false,
    "published": "2024-04-08T19:23:00Z",
    "description": "<p>Join the BrightStar Team as a Registered Nurse (RN) and Shine! </p><p><br/></p><p>Do you enjoy spending more time with your patients?  Our RN’s bring compassion and comfort to home care by giving personalized One-to-One care that makes a noticeable difference in the lives of our patients.  Our nurses are the heart of our company - the BrightSTARS to our patients. </p><p><br/></p><p id=\"isPasted\"><strong>Defuniak Springs, FL - FT/Nights 12/hr shifts</strong></p><p><strong>Twins w/developmental delays</strong></p><p><strong>Respiratory complexity</strong></p><p><strong>g-tube/continuous night feeds</strong></p><p><br/></p><p>Registered Nurse (RN) Responsibilities: </p><ul><li><p>Provide 1:1 care in the patient’s home. </p></li><li><p>Implement treatment and plan of care using sound judgment and critical thinking. </p></li><li><p>Maintain accurate, detailed, and timely documentation consistent with the care plan and nursing processes. </p></li><li><p>Perform all skills, treatments, and procedures to the scope of practice defined in the Nurse Practice Act in the state of clinical practice and adhere to the company policy, procedures, and protocols. </p></li></ul><p>Here are some of the perks: </p><ul><li><p>Weekly pay w/direct deposit </p></li><li><p>Flexible scheduling </p></li><li><p>Growth opportunities </p></li></ul><p>Registered Nurse (RN) Qualifications: </p><ul><li><p>An unencumbered license as a Registered Nurse (RN) in the state where care is provided </p></li><li><p>Minimum of (1) year nursing experience </p></li><li><p>Excellent problem-solving skills and organizational and multi-tasking skills </p></li><li><p>In-depth knowledge of health and safety guidelines and procedures (sanitation, decontamination, etc.) and willingness to follow them at all times </p></li><li><p>Up-to-date Level 2 AHCA Background, Valid Driver's License, Auto Insurance, BLS CPR card, and an up-to-date TB skin test or Chest X-Ray </p></li><li><p>Must be able to stand, walk, squat, bend, kneel, reach, twist, push, and pull </p></li><li><p>Must be able to lift or transfer up to 50 pounds </p></li></ul><p> </p><p>Candidate must have demonstrated alignment and experience in successfully living the BrightStar Care Core Values: </p><ul><li><p>Be Open and Honest: Approachable, Fun, Unflappable, Kind, Empathetic </p></li><li><p>Serve with Passion: Help First, Confident Yet Humble, For the Greater Good, Make a Real Difference </p></li><li><p>Do the Right Thing: Honest, Ethical, Tell the Truth </p></li><li><p>Do What You Say: On Time, Finish What You Start, Accountable, Take Responsibility </p></li><li><p>Make it Great: Continuous Improvement, Exceed Expectations, Bring Out the Best in Others, Detail Oriented </p></li></ul><p> </p><p>Equal Opportunity Employer </p><p>BrightStar Care is proud to be an equal opportunity employer and is committed to maintaining a diverse and inclusive work environment. All qualified applicants will receive considerations for employment without regard to race, color, religion, sex, age, disability, marital status, familial status, sexual orientation, pregnancy, genetic information, gender identity, gender expression, national origin, ancestry, citizenship status, veteran status, and any other legally protected status under federal, state, or local anti-discrimination laws.  BrightStar Care participates in E-Verify. </p><p>Disability Accommodation </p><p>For individuals with disabilities that need additional assistance at any point in the application and interview process, please email <a href=\"mailto:BrightStarHR@brightstarcare.com\" rel=\"noreferrer noopener\" target=\"_blank\">BrightStarHR@brightstarcare.com</a>.  </p>",
    "experience_level": null,
    "application_url": "https://workforcenow.adp.com/mascsr/default/mdf/recruitment/recruitment.html?cid=448700bd-e79c-46c5-93d8-185b819e9acb&jobId=503876",
    "language": "en",
    "clearance_required": false,
    "salary_min": null,
    "salary_max": null,
    "salary_currency": null
  },
  {
    "id": 5031671,
    "ext_id": "7323716002",
    "company": {
      "id": 16931,
      "name": "BAYADA Home Health Care",
      "logo": "https://jobdataapi.com/media/company/logo/23/12/logo_img_PRpAEwu.png",
      "website_url": "https://www.bayada.com/",
      "linkedin_url": "https://www.linkedin.com/company/bayada-home-health-care/",
      "twitter_handle": "joinbayada",
      "github_url": null
    },
    "title": "Registered Nurse, Senior Living",
    "location": "Middletown, DE 19709 | 39.478281421 | -75.691760628",
    "types": [
      {
        "id": 1,
        "name": "Full Time"
      }
    ],
    "cities": [
      {
        "geonameid": 5101170,
        "asciiname": "Middletown",
        "name": "Middletown",
        "country": {
          "code": "US",
          "name": "United States",
          "region": {
            "id": 5,
            "name": "North America"
          }
        },
        "timezone": "America/New_York",
        "latitude": "40.39428",
        "longitude": "-74.11709"
      }
    ],
    "countries": [
      {
        "code": "US",
        "name": "United States",
        "region": {
          "id": 5,
          "name": "North America"
        }
      }
    ],
    "regions": [
      {
        "id": 5,
        "name": "North America"
      }
    ],
    "has_remote": false,
    "published": "2024-04-08T19:02:02Z",
    "description": "<h3>We have a <strong>Registered Nurse </strong>opportunity available now doing visits in Senior Living communities in New Castle County<strong>. </strong></h3>\n<h3><strong><em>Flexible schedules, 1:1 care, and great work/life balance. Join us today!</em></strong></h3>\n<h3> </h3>\n<p><strong></strong></p>\n<p><strong>Registered Nurse (RN) Benefits:</strong></p>\n<ul>\n<li>BAYADA offers a comprehensive benefits plan that includes the following: Paid holidays, vacation and sick leave, vision, dental and medical health plans, employer paid life insurance, 401k with company match, direct deposit and employee assistance program</li>\n<li>To learn more about BAYADA Benefits, <a href=\"https://www.bayada.com/benefits/\">click here</a></li>\n<li>Enjoy being part of a team that cares and a company that believes in leading with our values.</li>\n<li><strong>Feel confident, safe, and supported with PPE supplies, comprehensive infection prevention protocol, daily pre-screens, and close monitoring of the COVID-19 outbreak.</strong></li>\n<li>Develop your skills with training and scholarship opportunities.</li>\n<li>Advance your career with specially designed career tracks.</li>\n<li>Be recognized and rewarded for your compassion, excellence, and reliability.</li>\n<li>Benefits may include medical, dental, vision, and life insurance; mileage reimbursement; paid time off; weekly pay and direct deposit; scholarship opportunities; one-on-one training; recognition programs; referral bonuses; 401(k) with company match; and opportunities for career advancement.</li>\n</ul>\n<p><strong>Registered Nurse (RN) Responsibilities:</strong></p>\n<ul>\n<li>Follow a designated care plan in accordance with patient's needs </li>\n<li>Make home visits to clients in designated geographic territories</li>\n<li>Perform assigned duties, including administration of medication, wound care, treatments, and procedures</li>\n<li>Monitor clients' conditions; reporting changes to Clinical or Client Services Manager</li>\n<li>Follow up with, execute, and properly document doctors' orders</li>\n<li>Perform client assessments as necessary</li>\n<li>Case management and coordination</li>\n<li>Accurately document observations, interventions, and evaluations pertaining to client care management and services provided, utilizing a state-of-the-art touch pad tablet</li>\n</ul>\n<p><strong>Qualifications for a Registered Nurse (RN):</strong></p>\n<ul>\n<li>A current license as a Registered Nurse in <strong>Delaware.</strong></li>\n<li>A minimum of one year of recent, verifiable clinical (medical/surgical) experience.</li>\n<li>Prior home care experience strongly preferred, but not required.</li>\n<li>Graduation from an accredited and approved nursing program, as indicated by school transcript or diploma.</li>\n<li>Ability to work independently and manage time effectively.</li>\n<li>Strong interpersonal skills.</li>\n<li>Solid computer skills; prior experience with electronic medical records (EMR) preferred.</li>\n<li>Ability to travel to cases as assigned. </li>\n</ul>\n<p>BAYADA recognizes and rewards our RNs who set and maintain the highest standards of excellence. Join our caring team today!</p><p><strong>As an accredited, regulated, certified, and licensed home health care provider, BAYADA complies with all state/local mandates.</strong></p>\n<p>BAYADA Home Health Care, Inc., and its associated entities and joint venture partners, are Equal Opportunity Employers. All employment decisions are made on a non-discriminatory basis without regard to sex, race, color, age, disability, pregnancy or maternity, sexual orientation, gender identity, citizenship status, military status, or any other similarly protected status in accordance with federal, state and local laws.  Hence, we strongly encourage applications from people with these identities or who are members of other marginalized communities.</p>",
    "experience_level": "SE",
    "application_url": "https://jobs.bayada.com/en/jobs?gh_jid=7323716002",
    "language": "en",
    "clearance_required": false,
    "salary_min": null,
    "salary_max": null,
    "salary_currency": null
  },
  {
    "id": 5031672,
    "ext_id": "7323728002",
    "company": {
      "id": 16931,
      "name": "BAYADA Home Health Care",
      "logo": "https://jobdataapi.com/media/company/logo/23/12/logo_img_PRpAEwu.png",
      "website_url": "https://www.bayada.com/",
      "linkedin_url": "https://www.linkedin.com/company/bayada-home-health-care/",
      "twitter_handle": "joinbayada",
      "github_url": null
    },
    "title": "Registered Nurse, Senior Living Home Health Visits",
    "location": "Newark, DE 19702 | 39.635501788 | -75.703606288",
    "types": [
      {
        "id": 1,
        "name": "Full Time"
      }
    ],
    "cities": [
      {
        "geonameid": 5101798,
        "asciiname": "Newark",
        "name": "Newark",
        "country": {
          "code": "US",
          "name": "United States",
          "region": {
            "id": 5,
            "name": "North America"
          }
        },
        "timezone": "America/New_York",
        "latitude": "40.73566",
        "longitude": "-74.17237"
      }
    ],
    "countries": [
      {
        "code": "US",
        "name": "United States",
        "region": {
          "id": 5,
          "name": "North America"
        }
      }
    ],
    "regions": [
      {
        "id": 5,
        "name": "North America"
      }
    ],
    "has_remote": false,
    "published": "2024-04-08T19:01:57Z",
    "description": "<h3>We have a <strong>Registered Nurse </strong>opportunity available now doing visits in Senior Living communities in New Castle County<strong>. </strong></h3>\n<h3><strong><em>Flexible schedules, 1:1 care, and great work/life balance. Join us today!</em></strong></h3>\n<h3> </h3>\n<p><strong></strong></p>\n<p><strong>Registered Nurse (RN) Benefits:</strong></p>\n<ul>\n<li>BAYADA offers a comprehensive benefits plan that includes the following: Paid holidays, vacation and sick leave, vision, dental and medical health plans, employer paid life insurance, 401k with company match, direct deposit and employee assistance program</li>\n<li>To learn more about BAYADA Benefits, <a href=\"https://www.bayada.com/benefits/\">click here</a></li>\n<li>Enjoy being part of a team that cares and a company that believes in leading with our values.</li>\n<li><strong>Feel confident, safe, and supported with PPE supplies, comprehensive infection prevention protocol, daily pre-screens, and close monitoring of the COVID-19 outbreak.</strong></li>\n<li>Develop your skills with training and scholarship opportunities.</li>\n<li>Advance your career with specially designed career tracks.</li>\n<li>Be recognized and rewarded for your compassion, excellence, and reliability.</li>\n<li>Benefits may include medical, dental, vision, and life insurance; mileage reimbursement; paid time off; weekly pay and direct deposit; scholarship opportunities; one-on-one training; recognition programs; referral bonuses; 401(k) with company match; and opportunities for career advancement.</li>\n</ul>\n<p><strong>Registered Nurse (RN) Responsibilities:</strong></p>\n<ul>\n<li>Follow a designated care plan in accordance with patient's needs </li>\n<li>Make home visits to clients in designated geographic territories</li>\n<li>Perform assigned duties, including administration of medication, wound care, treatments, and procedures</li>\n<li>Monitor clients' conditions; reporting changes to Clinical or Client Services Manager</li>\n<li>Follow up with, execute, and properly document doctors' orders</li>\n<li>Perform client assessments as necessary</li>\n<li>Case management and coordination</li>\n<li>Accurately document observations, interventions, and evaluations pertaining to client care management and services provided, utilizing a state-of-the-art touch pad tablet</li>\n</ul>\n<p><strong>Qualifications for a Registered Nurse (RN):</strong></p>\n<ul>\n<li>A current license as a Registered Nurse in <strong>Delaware.</strong></li>\n<li>A minimum of one year of recent, verifiable clinical (medical/surgical) experience.</li>\n<li>Prior home care experience strongly preferred, but not required.</li>\n<li>Graduation from an accredited and approved nursing program, as indicated by school transcript or diploma.</li>\n<li>Ability to work independently and manage time effectively.</li>\n<li>Strong interpersonal skills.</li>\n<li>Solid computer skills; prior experience with electronic medical records (EMR) preferred.</li>\n<li>Ability to travel to cases as assigned. </li>\n</ul>\n<p>BAYADA recognizes and rewards our RNs who set and maintain the highest standards of excellence. Join our caring team today!</p><p><strong>As an accredited, regulated, certified, and licensed home health care provider, BAYADA complies with all state/local mandates.</strong></p>\n<p>BAYADA Home Health Care, Inc., and its associated entities and joint venture partners, are Equal Opportunity Employers. All employment decisions are made on a non-discriminatory basis without regard to sex, race, color, age, disability, pregnancy or maternity, sexual orientation, gender identity, citizenship status, military status, or any other similarly protected status in accordance with federal, state and local laws.  Hence, we strongly encourage applications from people with these identities or who are members of other marginalized communities.</p>",
    "experience_level": "SE",
    "application_url": "https://jobs.bayada.com/en/jobs?gh_jid=7323728002",
    "language": "en",
    "clearance_required": false,
    "salary_min": null,
    "salary_max": null,
    "salary_currency": null
  },
  {
    "id": 5040877,
    "ext_id": "9200742125676_1",
    "company": {
      "id": 22834,
      "name": "BrightStar Care",
      "logo": "https://jobdataapi.com/media/company/logo/24/02/brightstarcare_logo.jpeg",
      "website_url": "https://www.brightstarcare.com/",
      "linkedin_url": "https://www.linkedin.com/company/brightstarcare/",
      "twitter_handle": null,
      "github_url": null
    },
    "title": "Pediatric Registered Nurse (RN)",
    "location": "FL - Pensacola, Pensacola, FL, US",
    "types": [
      {
        "id": 1,
        "name": "Full Time"
      }
    ],
    "cities": [
      {
        "geonameid": 4168228,
        "asciiname": "Pensacola",
        "name": "Pensacola",
        "country": {
          "code": "US",
          "name": "United States",
          "region": {
            "id": 5,
            "name": "North America"
          }
        },
        "timezone": "America/Chicago",
        "latitude": "30.42131",
        "longitude": "-87.21691"
      }
    ],
    "countries": [
      {
        "code": "US",
        "name": "United States",
        "region": {
          "id": 5,
          "name": "North America"
        }
      }
    ],
    "regions": [
      {
        "id": 5,
        "name": "North America"
      }
    ],
    "has_remote": false,
    "published": "2024-04-08T18:57:00Z",
    "description": "<p>Join the BrightStar Team as a Registered Nurse (RN) and Shine! </p><p><br/></p><p>Do you enjoy spending more time with your patients?  Our RN’s bring compassion and comfort to home care by giving personalized One-to-One care that makes a noticeable difference in the lives of our patients.  Our nurses are the heart of our company - the BrightSTARS to our patients. </p><p><br/></p><p><strong>Cantonment, FL</strong></p><p id=\"isPasted\"><strong>FT Night Position - 12/hr shifts - Medical Foster Home - Multiple patients</strong></p><p><strong>Pediatric patient with seizure disorder - Mickey Button - Feeds - CP </strong></p><p><strong>Genetic disorders - Wheelchair bound</strong></p><p><br/></p><p>Registered Nurse (RN) Responsibilities: </p><ul><li><p>Provide 1:1 care in the patient’s home. </p></li><li><p>Implement treatment and plan of care using sound judgment and critical thinking. </p></li><li><p>Maintain accurate, detailed, and timely documentation consistent with the care plan and nursing processes. </p></li><li><p>Perform all skills, treatments, and procedures to the scope of practice defined in the Nurse Practice Act in the state of clinical practice and adhere to the company policy, procedures, and protocols. </p></li></ul><p>Here are some of the perks: </p><ul><li><p>Weekly pay w/direct deposit </p></li><li><p>Flexible scheduling </p></li><li><p>Growth opportunities </p></li></ul><p>Registered Nurse (RN) Qualifications: </p><ul><li><p>An unencumbered license as a Registered Nurse (RN) in the state where care is provided </p></li><li><p>Minimum of (1) year nursing experience </p></li><li><p>Excellent problem-solving skills and organizational and multi-tasking skills </p></li><li><p>In-depth knowledge of health and safety guidelines and procedures (sanitation, decontamination, etc.) and willingness to follow them at all times </p></li><li><p>Up-to-date Level 2 ACHA Background, Valid Driver's License, Auto Insurance, BLS CPR card, and an up-to-date TB skin test or Chest X-Ray </p></li><li><p>Must be able to stand, walk, squat, bend, kneel, reach, twist, push, and pull </p></li><li><p>Must be able to lift or transfer up to 50 pounds </p></li></ul><p> </p><p>Candidate must have demonstrated alignment and experience in successfully living the BrightStar Care Core Values: </p><ul><li><p>Be Open and Honest: Approachable, Fun, Unflappable, Kind, Empathetic </p></li><li><p>Serve with Passion: Help First, Confident Yet Humble, For the Greater Good, Make a Real Difference </p></li><li><p>Do the Right Thing: Honest, Ethical, Tell the Truth </p></li><li><p>Do What You Say: On Time, Finish What You Start, Accountable, Take Responsibility </p></li><li><p>Make it Great: Continuous Improvement, Exceed Expectations, Bring Out the Best in Others, Detail Oriented </p></li></ul><p> </p><p>Equal Opportunity Employer </p><p>BrightStar Care is proud to be an equal opportunity employer and is committed to maintaining a diverse and inclusive work environment. All qualified applicants will receive considerations for employment without regard to race, color, religion, sex, age, disability, marital status, familial status, sexual orientation, pregnancy, genetic information, gender identity, gender expression, national origin, ancestry, citizenship status, veteran status, and any other legally protected status under federal, state, or local anti-discrimination laws.  BrightStar Care participates in E-Verify. </p><p>Disability Accommodation </p><p>For individuals with disabilities that need additional assistance at any point in the application and interview process, please email <a href=\"mailto:BrightStarHR@brightstarcare.com\" rel=\"noreferrer noopener\" target=\"_blank\">BrightStarHR@brightstarcare.com</a>.  </p>",
    "experience_level": null,
    "application_url": "https://workforcenow.adp.com/mascsr/default/mdf/recruitment/recruitment.html?cid=448700bd-e79c-46c5-93d8-185b819e9acb&jobId=503872",
    "language": "en",
    "clearance_required": false,
    "salary_min": null,
    "salary_max": null,
    "salary_currency": null
  },
  {
    "id": 5031668,
    "ext_id": "7323685002",
    "company": {
      "id": 16931,
      "name": "BAYADA Home Health Care",
      "logo": "https://jobdataapi.com/media/company/logo/23/12/logo_img_PRpAEwu.png",
      "website_url": "https://www.bayada.com/",
      "linkedin_url": "https://www.linkedin.com/company/bayada-home-health-care/",
      "twitter_handle": "joinbayada",
      "github_url": null
    },
    "title": "Registered Nurse- Home Health Visits",
    "location": "Berwick, PA 18603 | 41.063687461 | -76.248819577",
    "types": [
      {
        "id": 1,
        "name": "Full Time"
      }
    ],
    "cities": [
      {
        "geonameid": 2176031,
        "asciiname": "Berwick",
        "name": "Berwick",
        "country": {
          "code": "AU",
          "name": "Australia",
          "region": {
            "id": 2,
            "name": "Asia/Pacific"
          }
        },
        "timezone": "Australia/Melbourne",
        "latitude": "-38.03333",
        "longitude": "145.35000"
      }
    ],
    "countries": [
      {
        "code": "AU",
        "name": "Australia",
        "region": {
          "id": 2,
          "name": "Asia/Pacific"
        }
      }
    ],
    "regions": [
      {
        "id": 2,
        "name": "Asia/Pacific"
      }
    ],
    "has_remote": false,
    "published": "2024-04-08T18:34:46Z",
    "description": "<h3>We have a Part time or Per Diem <strong>Registered Nurse </strong>opportunity open now doing home visits in Columbia County, PA! </h3>\n<h3><strong><em>Flexible schedules, 1:1 care, and great work/life balance. Join us today!</em></strong></h3>\n<h3> </h3>\n<p><strong></strong></p>\n<p><strong>Registered Nurse (RN) Benefits:</strong></p>\n<ul>\n<li>BAYADA offers a comprehensive benefits plan that includes the following: Paid holidays, vacation and sick leave, vision, dental and medical health plans, employer paid life insurance, 401k with company match, direct deposit and employee assistance program</li>\n<li>To learn more about BAYADA Benefits, <a href=\"https://www.bayada.com/benefits/\">click here</a></li>\n<li>Enjoy being part of a team that cares and a company that believes in leading with our values.</li>\n<li><strong>Feel confident, safe, and supported with PPE supplies, comprehensive infection prevention protocol, daily pre-screens, and close monitoring of the COVID-19 outbreak.</strong></li>\n<li>Develop your skills with training and scholarship opportunities.</li>\n<li>Advance your career with specially designed career tracks.</li>\n<li>Be recognized and rewarded for your compassion, excellence, and reliability.</li>\n<li>Benefits may include medical, dental, vision, and life insurance; mileage reimbursement; paid time off; weekly pay and direct deposit; scholarship opportunities; one-on-one training; recognition programs; referral bonuses; 401(k) with company match; and opportunities for career advancement.</li>\n</ul>\n<p><strong>Registered Nurse (RN) Responsibilities:</strong></p>\n<ul>\n<li>Follow a designated care plan in accordance with patient's needs </li>\n<li>Make home visits to clients in designated geographic territories</li>\n<li>Perform assigned duties, including administration of medication, wound care, treatments, and procedures</li>\n<li>Monitor clients' conditions; reporting changes to Clinical or Client Services Manager</li>\n<li>Follow up with, execute, and properly document doctors' orders</li>\n<li>Perform client assessments as necessary</li>\n<li>Case management and coordination</li>\n<li>Accurately document observations, interventions, and evaluations pertaining to client care management and services provided, utilizing a state-of-the-art touch pad tablet</li>\n</ul>\n<p><strong>Qualifications for a Registered Nurse (RN):</strong></p>\n<ul>\n<li>A current license as a Registered Nurse in PA<strong>.</strong></li>\n<li>A minimum of one year of recent, verifiable clinical (medical/surgical) experience.</li>\n<li>Prior home care experience strongly preferred, but not required.</li>\n<li>Graduation from an accredited and approved nursing program, as indicated by school transcript or diploma.</li>\n<li>Ability to work independently and manage time effectively.</li>\n<li>Strong interpersonal skills.</li>\n<li>Solid computer skills; prior experience with electronic medical records (EMR) preferred.</li>\n<li>Ability to travel to cases as assigned. </li>\n</ul>\n<p>BAYADA recognizes and rewards our RNs who set and maintain the highest standards of excellence. Join our caring team today!</p><p><strong>As an accredited, regulated, certified, and licensed home health care provider, BAYADA complies with all state/local mandates.</strong></p>\n<p>BAYADA Home Health Care, Inc., and its associated entities and joint venture partners, are Equal Opportunity Employers. All employment decisions are made on a non-discriminatory basis without regard to sex, race, color, age, disability, pregnancy or maternity, sexual orientation, gender identity, citizenship status, military status, or any other similarly protected status in accordance with federal, state and local laws.  Hence, we strongly encourage applications from people with these identities or who are members of other marginalized communities.</p>",
    "experience_level": "MI",
    "application_url": "https://jobs.bayada.com/en/jobs?gh_jid=7323685002",
    "language": "en",
    "clearance_required": false,
    "salary_min": null,
    "salary_max": null,
    "salary_currency": null
  },
  {
    "id": 5037476,
    "ext_id": "743999979193923",
    "company": {
      "id": 7593,
      "name": "William Osler Health System",
      "logo": "https://jobdataapi.com/media/company/logo/23/03/sHY5ctxz_400x400.jpg",
      "website_url": "https://www.williamoslerhs.ca",
      "linkedin_url": "https://www.linkedin.com/company/william-osler-health-system/",
      "twitter_handle": "OslerHealth",
      "github_url": null
    },
    "title": "Registered Nurse - Post Anaesthetic Care Unit",
    "location": "Brampton, ON, Canada",
    "types": [
      {
        "id": 1,
        "name": "Full Time"
      },
      {
        "id": 2,
        "name": "Part Time"
      }
    ],
    "cities": [
      {
        "geonameid": 5907364,
        "asciiname": "Brampton",
        "name": "Brampton",
        "country": {
          "code": "CA",
          "name": "Canada",
          "region": {
            "id": 5,
            "name": "North America"
          }
        },
        "timezone": "America/Toronto",
        "latitude": "43.68341",
        "longitude": "-79.76633"
      }
    ],
    "countries": [
      {
        "code": "CA",
        "name": "Canada",
        "region": {
          "id": 5,
          "name": "North America"
        }
      }
    ],
    "regions": [
      {
        "id": 5,
        "name": "North America"
      }
    ],
    "has_remote": false,
    "published": "2024-04-08T17:36:29.492000Z",
    "description": "<h3>Company Description</h3><p>One of Canada's Best Diversity Employers and Greater Toronto's Top Employers for many consecutive years, William Osler Health System (Osler) provides a safe and supportive health care network to grow your career. Osler is nationally recognized for its commitment to patient safety and is Accredited with Exemplary Standing, the highest rating a Canadian hospital can receive. As a major Ontario hospital system, and home to some of the biggest specialty and emergency departments in the country, Osler serves the 1.3 million residents of Brampton, Etobicoke and surrounding communities. We are proud to offer you incredible exposure to best-in-class health care delivery and challenging hands-on opportunities to stay at the top of your game.</p><p>A hospital system built for and by the community, we continue to expand our services to meet the needs of a growing population, creating opportunities for increased hands-on skills development, cross-department training and promotional opportunities. Guided by our accomplished senior leadership team, together we are driving our vision of patient-inspired health care without boundaries.</p><p>At Osler, we invest in careers that go beyond where health care professionals like you can achieve their goals and find deep personal and professional fulfillment. Join our team today!</p><h3>Job Description</h3><p>Accountabilities:</p><ul><li>Safe nursing practice in all aspects of the nursing process: assessment, planning, implementation and evaluation of patient care</li><li>Compliance with policies and procedures associated with observations</li><li>Professional, patient-centred care to ensure patient safety and physiological and psychological well-being, associated with creating a therapeutic relationship and environment</li><li>Providing care in a compassionate and caring manner within a diverse cultural environment</li><li>Practicing according to the infection control and prevention measures</li><li>Responding to emergency situations by recognizing changes in patient's health status and consulting appropriately when necessary using transfer of accountability principles</li><li>Providing health teaching to patients and families including thorough discharge instructions to ensure the continuity of care in the community</li></ul><h3>Qualifications</h3><ul><li>Experience within the last five years with a minimum of two years in a post-anesthesia care unit, emergency or critical care unit required</li><li>Experience with patients requiring ventilator support and hemodynamic monitoring (arterial lines, CVP) required</li><li>Critical Care certificate required</li><li>Post-Anesthetic Care Nursing course preferred</li></ul><p>Core competencies:</p><ul><li>Current registration, and in good standing, with the College of Nurses of Ontario</li><li>Sound knowledge of nursing process, theory, and responsibilities to the nursing profession</li><li>BCLS required</li><li>Demonstrated excellent interpersonal, communication, problem-solving, conflict-resolution and decision-making skills required</li><li>Demonstrated ability to work collaboratively as a member of an inter-professional team</li><li>Demonstrated knowledge of patient and family-centred care</li><li>Demonstrated experience with patient and family health teaching required</li><li>Demonstrated leadership and facilitation skills required</li><li>Demonstrated excellent customer service, organizational and critical-thinking skills required</li><li>Demonstrated commitment to continuous learning and professional development as it applies to the profession and related field</li><li>Demonstrated ability to work in a stressful and fast-paced environment</li><li>Exemplary clinical practice within an inter-professional team to develop appropriate strategies for patient care</li><li>Ability to prioritize patient care needs and make autonomous decisions</li><li>Excellent physical assessment skills required</li><li>Ability to promote a healthy work environment and practice excellent client safety guidelines</li><li>Knowledge and understanding of the Occupational Health and Safety Act</li><li>Must demonstrate Osler's Values of Respect, Excellence, Service, Compassion, Innovation and Collaboration</li><li>May be required to travel and work between all Osler sites</li><li>Excellent attendance, punctuality and work record</li><li>Knowledge and understanding of information systems and technology</li></ul><h3>Additional Information</h3><p>This position is eligible for the Employee Referral Reward Program. Some conditions may apply.</p><p>Hours: Currently days/evenings with night call, staggered eight hour shifts including weekends and statutory holidays (subject to change in accordance with operational requirements)</p><p>Internal application deadline: May 25, 2023</p><p>Applications are still open for external applicants.</p><p>#PT</p><p>#SJ1<br/>\n#LI-RR1</p><p> </p><p>Osler values inclusivity and diversity in the workplace. We welcome and encourage applicants from diverse backgrounds. We are committed to providing accessible employment practices that are in compliance with the Accessibility for Ontarians with Disabilities Act. If you require an accommodation at any stage of the recruitment process, please notify Human Resources at <a href=\"mailto:human.resources@williamoslerhs.ca\">human.resources@williamoslerhs.ca</a>.</p><p>While we thank all applicants, only those selected for an interview will be contacted. Any information obtained during the course of recruitment will be used for employment recruitment purposes only, and not for any other purpose.</p>",
    "experience_level": "EN",
    "application_url": "https://jobs.smartrecruiters.com/WilliamOslerHealthSystem1/743999979193923-registered-nurse-post-anaesthetic-care-unit",
    "language": "en",
    "clearance_required": false,
    "salary_min": null,
    "salary_max": null,
    "salary_currency": null
  },
  {
    "id": 5040795,
    "ext_id": "743999979179062",
    "company": {
      "id": 8836,
      "name": "Northwestern Memorial Healthcare",
      "logo": "https://jobdataapi.com/media/company/logo/23/07/NorthwesternMed.jpg",
      "website_url": "https://www.nm.org",
      "linkedin_url": "https://www.linkedin.com/company/northwestern-medicine",
      "twitter_handle": "NorthwesternMed",
      "github_url": null
    },
    "title": "Registered Nurse - Charge Nurse Labor and Delivery Full Time Nights $3,000 Sign On Bonus",
    "location": "Lake Forest, IL, United States",
    "types": [
      {
        "id": 1,
        "name": "Full Time"
      }
    ],
    "cities": [
      {
        "geonameid": 4899012,
        "asciiname": "Lake Forest",
        "name": "Lake Forest",
        "country": {
          "code": "US",
          "name": "United States",
          "region": {
            "id": 5,
            "name": "North America"
          }
        },
        "timezone": "America/Chicago",
        "latitude": "42.25863",
        "longitude": "-87.84063"
      }
    ],
    "countries": [
      {
        "code": "US",
        "name": "United States",
        "region": {
          "id": 5,
          "name": "North America"
        }
      }
    ],
    "regions": [
      {
        "id": 5,
        "name": "North America"
      }
    ],
    "has_remote": false,
    "published": "2024-04-08T16:18:09.478000Z",
    "description": "<h3>Company Description</h3><p>At Northwestern Medicine, every patient interaction makes a difference in cultivating a positive workplace. This patient-first approach is what sets us apart as a leader in the healthcare industry. As an integral part of our team, you'll have the opportunity to join our quest for better healthcare, no matter where you work within the Northwestern Medicine system. At Northwestern Medicine, we pride ourselves on providing competitive benefits: from tuition reimbursement and loan forgiveness to 401(k) matching and lifecycle benefits, we take care of our employees. Ready to join our quest for better?</p><h3>Job Description</h3><p>The <u><strong>Registered Nurse</strong></u> reflects the mission, vision, and values of NM, adheres to the organization's Code of Ethics and Corporate Compliance Program, and complies with all relevant policies, procedures, guidelines, and all other regulatory and accreditation standards. </p><p><u><strong>Responsibilities:</strong></u></p><ul><li>Performs a comprehensive assessment on all assigned patients as evidenced by completed documentation.</li><li>Supports patient/family/spiritual/cultural needs when assessing the patient and family needs for teaching; identifies the patient's learning level and readiness, and documents education record.</li><li>Communicates changes in patients condition promptly.</li><li>Utilizes appropriate nursing diagnosis and data from the assessment to derive realistic outcomes and documents them as measurable goals on the plan of care; modifies care plan, if indicated, in order to identify realistic patient goals. Identifies and prioritizes patient needs and/or nursing diagnosis for patients and documents.</li><li>Collaborates with patient, family, and other members of the health care team when planning patient care, and documents accordingly.</li><li>Assesses patients with regard to discharge planning and makes the appropriate referrals as necessary.</li><li>Implements nursing interventions consistent with the established plan of care.</li><li>Demonstrates safe medication administration.</li><li>Assesses patients with regard to discharge planning and makes the appropriate referrals as necessary.</li><li>Evaluates and documents the patient response to nursing interventions and alters the plan of care as necessary.</li><li>Oversees and directs the work of patient care or support techs; maintains overall accountability for the care of assigned patients.</li><li>Demonstrates effective interpersonal skills in leading and directing others; deals with conflict directly and appropriately.</li><li>Demonstrates proficiency in the charge nurse/preceptor role when assigned; assumes responsibility for coordinating patient care for the entire unit.</li></ul><p>EOE Minorities/Women/Disabled/Veterans. VEVRAA Federal Contractor.</p><p>#iNDN</p><h3>Qualifications</h3><p><u><strong>Required: </strong></u></p><ul><li>Registered Nursing license issued by the state of Illinois.</li><li>Graduation from an accredited nursing program.</li><li>BLS through American Heart Association.</li></ul><p><u><strong>Preferred: </strong></u></p><ul><li>Bachelors of Science in Nursing.</li><li>National Certification in area of specialty.</li></ul><h3>Additional Information</h3><p>Northwestern Medicine is an affirmative action/equal opportunity employer and does not discriminate in hiring or employment on the basis of age, sex, race, color, religion, national origin, gender identity, veteran status, disability, sexual orientation or any other protected status.</p>",
    "experience_level": "MI",
    "application_url": "https://jobs.smartrecruiters.com/NorthwesternMedicine/743999979179062-registered-nurse-charge-nurse-labor-and-delivery-full-time-nights-3-000-sign-on-bonus",
    "language": "en",
    "clearance_required": false,
    "salary_min": null,
    "salary_max": null,
    "salary_currency": null
  },
  {
    "id": 5037478,
    "ext_id": "743999979158463",
    "company": {
      "id": 7593,
      "name": "William Osler Health System",
      "logo": "https://jobdataapi.com/media/company/logo/23/03/sHY5ctxz_400x400.jpg",
      "website_url": "https://www.williamoslerhs.ca",
      "linkedin_url": "https://www.linkedin.com/company/william-osler-health-system/",
      "twitter_handle": "OslerHealth",
      "github_url": null
    },
    "title": "Registered Nurse",
    "location": "Brampton, ON, Canada",
    "types": [
      {
        "id": 1,
        "name": "Full Time"
      }
    ],
    "cities": [
      {
        "geonameid": 5907364,
        "asciiname": "Brampton",
        "name": "Brampton",
        "country": {
          "code": "CA",
          "name": "Canada",
          "region": {
            "id": 5,
            "name": "North America"
          }
        },
        "timezone": "America/Toronto",
        "latitude": "43.68341",
        "longitude": "-79.76633"
      }
    ],
    "countries": [
      {
        "code": "CA",
        "name": "Canada",
        "region": {
          "id": 5,
          "name": "North America"
        }
      }
    ],
    "regions": [
      {
        "id": 5,
        "name": "North America"
      }
    ],
    "has_remote": false,
    "published": "2024-04-08T15:08:09.917000Z",
    "description": "<h3>Company Description</h3><p>One of Canada's Best Diversity Employers and Greater Toronto's Top Employers for many consecutive years, William Osler Health System (Osler) provides a safe and supportive health care network to grow your career. Osler is nationally recognized for its commitment to patient safety and is Accredited with Exemplary Standing, the highest rating a Canadian hospital can receive. As a major Ontario hospital system, and home to some of the biggest specialty and emergency departments in the country, Osler serves the 1.3 million residents of Brampton, Etobicoke and surrounding communities. We are proud to offer you incredible exposure to best-in-class health care delivery and challenging hands-on opportunities to stay at the top of your game.</p><p>A hospital system built for and by the community, we continue to expand our services to meet the needs of a growing population, creating opportunities for increased hands-on skills development, cross-department training and promotional opportunities. Guided by our accomplished senior leadership team, together we are driving our vision of patient-inspired health care without boundaries.</p><p>At Osler, we invest in careers that go beyond where health care professionals like you can achieve their goals and find deep personal and professional fulfillment. Join our team today!</p><h3>Job Description</h3><p>The Registered Nurse (RN) is a regulated health care professional who is accountable and responsible for providing quality patient focused nursing care to patients in the Labour and Delivery and Postpartum Units. As part of the inter-professional health care team, the RN will practice according to the nursing practice expectations set by Osler, the regulatory practice standards of the College of Nurses and the legislative requirements set by the Regulated Health Professions Act.</p><p>Accountabilities:  </p><ul><li>Safe nursing practice in all aspects of the nursing process: assessment, planning, implementation and evaluation of patient care</li><li>Compliance with policies and procedures associated with observations</li><li>Professional, patient-centred care to ensure patient safety and physiological and psychological well-being, associated with creating a therapeutic relationship and environment</li><li>Providing care in a compassionate and caring manner within a diverse cultural environment</li><li>Practicing according to the infection control and prevention measures</li><li>Responding to emergency situations by recognizing changes in patient's health status and consulting appropriately when necessary using transfer of accountability principles</li><li>Providing health teaching to patients and families including thorough discharge instructions to ensure the continuity of care in the community</li></ul><h3>Qualifications</h3><ul><li>Clinical experience within the last five years, with a minimum of two years within obstetrics is required</li><li>Current Neonatal Resuscitation Program certificate required</li><li>Completion of Registered Nurses' Association of Ontario breastfeeding e-learning course required</li><li>Current Fetal Health Surveillance certificate required</li><li>Obstetrics Nursing certificate required, or enrolled within six months of hire</li></ul><p>Core competencies:</p><ul><li>Current registration, and in good standing, with the College of Nurses of Ontario</li><li>Sound knowledge of nursing process, theory, and responsibilities to the nursing profession</li><li>BCLS required</li><li>Demonstrated excellent interpersonal, communication, problem-solving, conflict-resolution and decision-making skills required</li><li>Demonstrated ability to work collaboratively as a member of an inter-professional team</li><li>Demonstrated knowledge of patient and family-centred care</li><li>Demonstrated experience with patient and family health teaching required</li><li>Demonstrated leadership and facilitation skills required</li><li>Demonstrated excellent customer service, organizational and critical-thinking skills required</li><li>Demonstrated commitment to continuous learning and professional development as it applies to the profession and related field</li><li>Demonstrated ability to work in a stressful and fast-paced environment</li><li>Exemplary clinical practice within an inter-professional team to develop appropriate strategies for patient care</li><li>Ability to prioritize patient care needs and make autonomous decisions</li><li>Excellent physical assessment skills required</li><li>Ability to promote a healthy work environment and practice excellent client safety guidelines</li><li>Knowledge and understanding of the Occupational Health and Safety Act</li><li>Must demonstrate Osler's Values of Respect, Excellence, Service, Compassion, Innovation and Collaboration</li><li>May be required to travel and work between all Osler sites</li><li>Excellent attendance, punctuality and work record</li><li>Knowledge and understanding of information systems and technology</li></ul><h3>Additional Information</h3><p>Hours: Currently Days/Nights, 12-hour shifts including weekends and statutory holidays (subject to change in accordance with operational requirements)</p><p>This position is eligible for the Employee Referral Reward Program. Some conditions may apply</p><p>Internal application deadline: March 2, 2023</p><p>Applications are still open for external applicants</p><p>#LI-NP1</p><p>#SJ1</p><p>Osler values inclusivity and diversity in the workplace. We welcome and encourage applicants from diverse backgrounds. We are committed to providing accessible employment practices that are in compliance with the Accessibility for Ontarians with Disabilities Act. If you require an accommodation at any stage of the recruitment process, please notify Human Resources at <a href=\"mailto:human.resources@williamoslerhs.ca\">human.resources@williamoslerhs.ca</a>.</p><p>While we thank all applicants, only those selected for an interview will be contacted. Any information obtained during the course of recruitment will be used for employment recruitment purposes only, and not for any other purpose.</p>",
    "experience_level": "EN",
    "application_url": "https://jobs.smartrecruiters.com/WilliamOslerHealthSystem1/743999979158463-registered-nurse",
    "language": "en",
    "clearance_required": false,
    "salary_min": null,
    "salary_max": null,
    "salary_currency": null
  },
  {
    "id": 5039507,
    "ext_id": "743999979157163",
    "company": {
      "id": 12423,
      "name": "University Health Network",
      "logo": "https://jobdataapi.com/media/company/logo/23/11/logo_img_WACRRe3.png",
      "website_url": "https://www.UHN.ca",
      "linkedin_url": "https://www.linkedin.com/company/university-health-network",
      "twitter_handle": "UHN",
      "github_url": null
    },
    "title": "Registered Nurse",
    "location": "Toronto, ON, Canada",
    "types": [
      {
        "id": 1,
        "name": "Full Time"
      }
    ],
    "cities": [
      {
        "geonameid": 6167865,
        "asciiname": "Toronto",
        "name": "Toronto",
        "country": {
          "code": "CA",
          "name": "Canada",
          "region": {
            "id": 5,
            "name": "North America"
          }
        },
        "timezone": "America/Toronto",
        "latitude": "43.70011",
        "longitude": "-79.41630"
      }
    ],
    "countries": [
      {
        "code": "CA",
        "name": "Canada",
        "region": {
          "id": 5,
          "name": "North America"
        }
      }
    ],
    "regions": [
      {
        "id": 5,
        "name": "North America"
      }
    ],
    "has_remote": false,
    "published": "2024-04-08T15:03:23.194000Z",
    "description": "<h3>Company Description</h3><p>The University Health Network, where “above all else the needs of patients come first”, encompasses Toronto General Hospital, Toronto Western Hospital, Princess Margaret Cancer Centre, Toronto Rehabilitation Institute and the Michener Institute of Education. The breadth of research, the complexity of the cases treated, and the magnitude of its educational enterprise has made UHN a national and international resource for patient care, research and education. With a long tradition of ground breaking firsts and a purpose of “Transforming lives and communities through excellence in care, discovery and learning”, the University Health Network (UHN), Canada’s largest research teaching hospital, brings together over 16,000 employees, more than 1,200 physicians, 8,000+ students, and many volunteers. UHN is a caring, creative place where amazing people are amazing the world. </p><h3>Job Description</h3><p><strong>Union: </strong>ONA <br/>\n<strong>Site: </strong>Princess Margaret Cancer Centre<br/>\n<strong>Department:</strong> 15A Inpatient Leukemia<br/>\n<strong>Reports to:</strong> Nurse Manager<br/>\n<strong>Work Model: </strong>On-Site<br/>\n<strong>Grade: </strong>PU4<br/>\n<strong>Hours: </strong>20 shifts in 6 weeks <br/>\n<strong>Salary: </strong>$39.07 - 56.00 per hour (start rate is non-negotiable and in accordance with collective agreement requirements)<br/>\n<strong>Shifts:</strong> Days/Nights<br/>\n<strong>Status:</strong> Temporary Full-Time (1 Year Contract)<br/>\n<strong>Closing Date:</strong> July 11, 2024</p><p><strong>Please note: </strong>This posting is for 5 vacancies.</p><p><strong>Position Summary</strong></p><p>As a member multi-disciplinary Team, the REGISTERED NURSE practices in accordance with relevant legislation/standards, the UHN Professional Practice Model and the mission and vision of nursing at the UHN to provide compassionate, collaborative and competent care, while meeting the legal and ethical requirements of the profession. </p><p><strong>Duties</strong></p><ul><li>Applying knowledge of nursing science, theory, skill and critical decision making in the provision of compassionate, collaborative and competent care in accordance with the UHN Professional Practice Model for Nursing and the mission and vision of nursing at the UHN.</li><li>Ensuring practice is consistent with professional standards and the ethical framework as outlined by the College of Nurses of Ontario and the UHN policy and procedure.</li><li>Demonstrating commitment to professional life long learning by participating in continuing education activities to meet the needs of the patient population served and the standards of the profession.</li><li>Performing reflective practice, analyzing and evaluating nursing knowledge and modifying practice accordingly to improve the quality of nursing and patient care.</li><li>Performing cross-functional and other responsibilities, as assigned and/or requested.</li></ul><h3>Qualifications</h3><ul><li>Current Registration with the College of Nurses of Ontario required</li><li>Basic Cardiac Life Support Certification required</li><li>Flexible and able to work effectively and efficiently within a interdisciplinary patient care team</li><li>Must be able to meet the physical requirements of the position</li><li>Excellent interpersonal, communication and decision making skills</li><li>Excellent organizational and time management skills</li><li>Excellent computer skills</li><li>BScN degree preferred</li></ul><h3>Additional Information</h3><p><strong>Why join UHN?</strong></p><p>In addition to working alongside some of the most talented and inspiring healthcare professionals in the world, UHN offers a wide range of benefits, programs and perks. It is the comprehensiveness of these offerings that makes it a differentiating factor, allowing you to find value where it matters most to you, now and throughout your career at UHN.</p><ul><li>Competitive offer packages</li><li>Government organization and a member of the Healthcare of Ontario Pension Plan (HOOPP<a href=\"https://hoopp.com/\"> https://hoopp.com/</a>)</li><li>Close access to Transit and UHN shuttle service</li><li>A flexible work environment</li><li>Opportunities for development and promotions within a large organization</li><li>Additional perks (multiple corporate discounts including: travel, restaurants, parking, phone plans, auto insurance discounts, on-site gyms, etc.) </li></ul><p>All applications must be submitted before the posting close date.</p><p>UHN uses email to communicate with selected candidates.  Please ensure you check your email regularly.</p><p>Please be advised that a Criminal Record Check may be required of the successful candidate. Should it be determined that any information provided by a candidate be misleading, inaccurate or incorrect, UHN reserves the right to discontinue with the consideration of their application.</p><p>All UHN Employees are required to be fully vaccinated with a COVID-19 vaccine series, approved by Health Canada or the World Health Organization, as a condition of hire. Proof of COVID-19 vaccination will be required. Should you be the successful candidate, you will be required to comply with UHN’s mandatory Vaccination Policy that is in effect.</p><p>UHN is an equal opportunity employer committed to an inclusive recruitment process and workplace. Requests for accommodation can be made at any stage of the recruitment process. Applicants need to make their requirements known.</p><p><strong>We thank all applicants for their interest, however, only those selected for further consideration will be contacted.</strong></p>",
    "experience_level": "EN",
    "application_url": "https://jobs.smartrecruiters.com/UniversityHealthNetwork/743999979157163-registered-nurse",
    "language": "en",
    "clearance_required": false,
    "salary_min": null,
    "salary_max": null,
    "salary_currency": null
  },
  {
    "id": 5039508,
    "ext_id": "743999979147784",
    "company": {
      "id": 12423,
      "name": "University Health Network",
      "logo": "https://jobdataapi.com/media/company/logo/23/11/logo_img_WACRRe3.png",
      "website_url": "https://www.UHN.ca",
      "linkedin_url": "https://www.linkedin.com/company/university-health-network",
      "twitter_handle": "UHN",
      "github_url": null
    },
    "title": "Registered Nurse",
    "location": "Toronto, ON, Canada",
    "types": [
      {
        "id": 1,
        "name": "Full Time"
      },
      {
        "id": 2,
        "name": "Part Time"
      }
    ],
    "cities": [
      {
        "geonameid": 6167865,
        "asciiname": "Toronto",
        "name": "Toronto",
        "country": {
          "code": "CA",
          "name": "Canada",
          "region": {
            "id": 5,
            "name": "North America"
          }
        },
        "timezone": "America/Toronto",
        "latitude": "43.70011",
        "longitude": "-79.41630"
      }
    ],
    "countries": [
      {
        "code": "CA",
        "name": "Canada",
        "region": {
          "id": 5,
          "name": "North America"
        }
      }
    ],
    "regions": [
      {
        "id": 5,
        "name": "North America"
      }
    ],
    "has_remote": false,
    "published": "2024-04-08T14:32:58.377000Z",
    "description": "<h3>Company Description</h3><p>The University Health Network, where “above all else the needs of patients come first”, encompasses Toronto General Hospital, Toronto Western Hospital, Princess Margaret Cancer Centre, Toronto Rehabilitation Institute and the Michener Institute of Education. The breadth of research, the complexity of the cases treated, and the magnitude of its educational enterprise has made UHN a national and international resource for patient care, research and education. With a long tradition of ground breaking firsts and a purpose of “Transforming lives and communities through excellence in care, discovery and learning”, the University Health Network (UHN), Canada’s largest research teaching hospital, brings together over 16,000 employees, more than 1,200 physicians, 8,000+ students, and many volunteers. UHN is a caring, creative place where amazing people are amazing the world.</p><h3>Job Description</h3><p><strong>Union: </strong>ONA  <br/>\n<strong>Site:</strong> Toronto Rehabilitation Institute – University Centre <br/>\n<strong>Department:</strong> South 5, Specialized Dementia Unit <br/>\n<strong>Reports to: </strong>Program Services Manager<br/>\n<strong>Work Model: </strong>On-Site<br/>\n<strong>Grade:</strong> EU4<br/>\n<strong>Hours: </strong>0.30 FTE <br/>\n<strong>Salary:</strong> $39.07 - 56.00 per hour (start rate is non-negotiable and in accordance with collective agreement requirements) <br/>\n<strong>Shifts: </strong>Days/Nights <br/>\n<strong>Status:</strong> Permanent Part-Time  <br/>\n<strong>Closing Date: </strong>April 28, 2024</p><p><strong>Job Summary</strong></p><p>The Toronto Rehabilitation Institute, a leader in adult rehabilitation and complex continuing care, is Canada’s largest adult rehabilitation hospital. Bringing together innovative patient care, groundbreaking research and diverse education to help people overcome or recover from disabling injury, illness or age-related conditions Toronto Rehab is located at four sites: University Centre (550 University Ave.), Lyndhurst Hospital and Toronto Rehab’s Cardiac and Stroke Centre (Rumsey Road) and the Bickle Centre (Dunn Ave).</p><p><strong>Duties</strong></p><ul><li>Plan, manage, evaluate and coordinate comprehensive professional nursing care for patients and families within the context of an interprofessional practice and primary nursing model</li><li>Use theoretical and empirical knowledge and the input of team members to plan and implement care for patients with dementia and their families</li><li>Education of patients, family, referring facilities and other community providers regarding care of older adults with dementia</li><li>Participate in interprofessional team care planning forums, interprofessional rounds and family conferences</li><li>Provide leadership, supervision and mentorship to students and new staff on the unit related to Geriatric Rehabilitation nursing</li><li>Participate in professional, program and hospital-wide initiatives, including professional development of self</li><li>Compliance with and commitment to patient safety responsibilities and corresponding hospital plans, policies and procedures in order to ensure a safe environment for patients</li></ul><h3>Qualifications</h3><ul><li>Member in good standing with the College of Nurses of Ontario</li><li>Baccalaureate degree in Nursing preferred</li><li>Ability to demonstrate strong health assessment skills</li><li>Experience in Geriatric Rehabilitation and care and management of patients with behaviours and psychological symptoms of dementia preferred</li><li>Certification in gerontology preferred</li><li>Successful completion of Basic Cardiac Life Support (C level) Heart Saver Plus (Canada) required</li><li>Member, Registered Nurses Association of Ontario (RNAO), OARN (SIG) preferred</li><li>Excellent conceptual and theoretical understanding of nursing concepts and ability to articulate the concepts as they relate to Geriatric Rehabilitation</li><li>Superior clinical decision-making skills that reflect patient centeredness, problem solving and critical thinking</li><li>Excellent communication, interpersonal, and leadership skills</li><li>Ability to use theoretical concepts and research findings in practice</li><li>Ability to teach students within the context of a teaching hospital</li><li>Proven ability to work independently, and as part of an interprofessional team</li><li>Excellent knowledge of standards of rehabilitation nursing practice and applicable health care legislation</li><li>Ability to identify and meet own learning needs for ongoing professional development</li><li>Ability to provide substantiated rationale for clinical management of patient care</li><li>Successful candidate is required to work rotational shift</li><li>Computer proficiency required</li><li>Good Attendance required</li></ul><h3>Additional Information</h3><p><strong>Why join UHN?</strong></p><p>In addition to working alongside some of the most talented and inspiring healthcare professionals in the world, UHN offers a wide range of benefits, programs and perks. It is the comprehensiveness of these offerings that makes it a differentiating factor, allowing you to find value where it matters most to you, now and throughout your career at UHN.</p><ul><li>Competitive compensation &amp; benefits (medical, dental, etc.)</li><li>HOOPP defined benefit pension plan</li><li>Wellness services &amp; offerings</li><li>Close access to the TTC and UHN shuttle service</li><li>Opportunities for development and promotions within a large organization</li><li>Additional perks (multiple corporate discounts including: travel, restaurants, parking, phone plans, auto insurance discounts, on-site gyms, etc.)</li></ul><p>All applications must be submitted before the posting close date.</p><p>UHN uses email to communicate with selected candidates.  Please ensure you check your email regularly.</p><p>Please be advised that a Criminal Record Check may be required of the successful candidate. Should it be determined that any information provided by a candidate be misleading, inaccurate or incorrect, UHN reserves the right to discontinue with the consideration of their application.</p><p>All UHN Employees are required to be fully vaccinated with a COVID-19 vaccine series, approved by Health Canada or the World Health Organization, as a condition of hire. Proof of COVID-19 vaccination will be required. Should you be the successful candidate, you will be required to comply with UHN’s mandatory Vaccination Policy that is in effect.</p><p>UHN is an equal opportunity employer committed to an inclusive recruitment process and workplace. Requests for accommodation can be made at any stage of the recruitment process. Applicants need to make their requirements known.</p><p><strong>We thank all applicants for their interest, however, only those selected for further consideration will be contacted.</strong></p>",
    "experience_level": "MI",
    "application_url": "https://jobs.smartrecruiters.com/UniversityHealthNetwork/743999979147784-registered-nurse",
    "language": "en",
    "clearance_required": false,
    "salary_min": null,
    "salary_max": null,
    "salary_currency": null
  },
  {
    "id": 5039509,
    "ext_id": "743999979143250",
    "company": {
      "id": 12423,
      "name": "University Health Network",
      "logo": "https://jobdataapi.com/media/company/logo/23/11/logo_img_WACRRe3.png",
      "website_url": "https://www.UHN.ca",
      "linkedin_url": "https://www.linkedin.com/company/university-health-network",
      "twitter_handle": "UHN",
      "github_url": null
    },
    "title": "Registered Nurse",
    "location": "Toronto, ON, Canada",
    "types": [
      {
        "id": 1,
        "name": "Full Time"
      },
      {
        "id": 2,
        "name": "Part Time"
      }
    ],
    "cities": [
      {
        "geonameid": 6167865,
        "asciiname": "Toronto",
        "name": "Toronto",
        "country": {
          "code": "CA",
          "name": "Canada",
          "region": {
            "id": 5,
            "name": "North America"
          }
        },
        "timezone": "America/Toronto",
        "latitude": "43.70011",
        "longitude": "-79.41630"
      }
    ],
    "countries": [
      {
        "code": "CA",
        "name": "Canada",
        "region": {
          "id": 5,
          "name": "North America"
        }
      }
    ],
    "regions": [
      {
        "id": 5,
        "name": "North America"
      }
    ],
    "has_remote": false,
    "published": "2024-04-08T14:32:05.808000Z",
    "description": "<h3>Company Description</h3><p>The University Health Network, where “above all else the needs of patients come first”, encompasses Toronto General Hospital, Toronto Western Hospital, Princess Margaret Cancer Centre, Toronto Rehabilitation Institute and the Michener Institute of Education. The breadth of research, the complexity of the cases treated, and the magnitude of its educational enterprise has made UHN a national and international resource for patient care, research and education. With a long tradition of ground breaking firsts and a purpose of “Transforming lives and communities through excellence in care, discovery and learning”, the University Health Network (UHN), Canada’s largest research teaching hospital, brings together over 16,000 employees, more than 1,200 physicians, 8,000+ students, and many volunteers. UHN is a caring, creative place where amazing people are amazing the world. </p><h3>Job Description</h3><p><strong>Union:</strong> ONA<br/>\n<strong>Site:</strong> Toronto Rehabilitation Institute – E.W. Bickle Centre<br/>\n<strong>Department:</strong> South 5, CCC<br/>\n<strong>Reports to:</strong> Manager, Program Services<br/>\n<strong>Work Model:</strong> On-Site<br/>\n<strong>Grade: </strong>EU4<br/>\n<strong>Hours:</strong> 0.50 FTE <br/>\n<strong>Salary:</strong> $39.07 - 56.00 (start rate is non-negotiable and in accordance with the collective agreement)<br/>\n<strong>Shifts: </strong>Days/Nights<br/>\n<strong>Status:</strong> Permanent Part-Time<br/>\n<strong>Closing Date:</strong> April 21, 2024</p><p><strong>Position Summary</strong></p><p>As a member multi-disciplinary Team, the REGISTERED NURSE practices in accordance with relevant legislation/standards, the UHN Professional Practice Model and the mission and vision of nursing at the UHN to provide compassionate, collaborative and competent care, while meeting the legal and ethical requirements of the profession. </p><p><strong>Duties</strong></p><ul><li>Applying knowledge of nursing science, theory, skill and critical decision making in the provision of compassionate, collaborative and competent care in accordance with the UHN Professional Practice Model for Nursing and the mission and vision of nursing at the UHN.</li><li>Ensuring practice is consistent with professional standards and the ethical framework as outlined by the College of Nurses of Ontario and the UHN policy and procedure.</li><li>Demonstrating commitment to professional life long learning by participating in continuing education activities to meet the needs of the patient population served and the standards of the profession.</li><li>Performing reflective practice, analyzing and evaluating nursing knowledge and modifying practice accordingly to improve the quality of nursing and patient care.</li><li>Performing cross-functional and other responsibilities, as assigned and/or requested.</li></ul><h3>Qualifications</h3><ul><li>Current Registration with the College of Nurses of Ontario required</li><li>Basic Cardiac Life Support Certification required</li><li>Flexible and able to work effectively and efficiently within a interdisciplinary patient care team</li><li>Must be able to meet the physical requirements of the position</li><li>Excellent interpersonal, communication and decision making skills</li><li>Excellent organizational and time management skills</li><li>Excellent computer skills</li><li>BScN degree preferred</li></ul><h3>Additional Information</h3><p>In addition to working alongside some of the most talented and inspiring healthcare professionals in the world, UHN offers a wide range of benefits, programs and perks. It is the comprehensiveness of these offerings that makes it a differentiating factor, allowing you to find value where it matters most to you, now and throughout your career at UHN.</p><ul><li>Competitive offer packages</li><li>Government organization and a member of the Healthcare of Ontario Pension Plan (HOOPP <a href=\"https://hoopp.com/\">https://hoopp.com/</a>)</li><li>Close access to Transit and UHN shuttle service</li><li>A flexible work environment</li><li>Opportunities for development and promotions within a large organization</li><li>Additional perks (multiple corporate discounts including: travel, restaurants, parking, phone plans, auto insurance discounts, on-site gyms, etc.)</li><li>All applications must be submitted before the posting close date.</li></ul><p>All applications must be submitted before the posting close date.</p><p>UHN uses email to communicate with selected candidates.  Please ensure you check your email regularly.</p><p>Please be advised that a Criminal Record Check may be required of the successful candidate. Should it be determined that any information provided by a candidate be misleading, inaccurate or incorrect, UHN reserves the right to discontinue with the consideration of their application.</p><p>All UHN Employees are required to be fully vaccinated with a COVID-19 vaccine series, approved by Health Canada or the World Health Organization, as a condition of hire. Proof of COVID-19 vaccination will be required. Should you be the successful candidate, you will be required to comply with UHN’s mandatory Vaccination Policy that is in effect.</p><p>UHN is an equal opportunity employer committed to an inclusive recruitment process and workplace. Requests for accommodation can be made at any stage of the recruitment process. Applicants need to make their requirements known.</p><p><strong>We thank all applicants for their interest, however, only those selected for further consideration will be contacted.</strong></p>",
    "experience_level": null,
    "application_url": "https://jobs.smartrecruiters.com/UniversityHealthNetwork/743999979143250-registered-nurse",
    "language": "en",
    "clearance_required": false,
    "salary_min": null,
    "salary_max": null,
    "salary_currency": null
  },
  {
    "id": 5039510,
    "ext_id": "743999979142609",
    "company": {
      "id": 12423,
      "name": "University Health Network",
      "logo": "https://jobdataapi.com/media/company/logo/23/11/logo_img_WACRRe3.png",
      "website_url": "https://www.UHN.ca",
      "linkedin_url": "https://www.linkedin.com/company/university-health-network",
      "twitter_handle": "UHN",
      "github_url": null
    },
    "title": "Registered Nurse",
    "location": "Toronto, ON, Canada",
    "types": [
      {
        "id": 1,
        "name": "Full Time"
      },
      {
        "id": 2,
        "name": "Part Time"
      }
    ],
    "cities": [
      {
        "geonameid": 6167865,
        "asciiname": "Toronto",
        "name": "Toronto",
        "country": {
          "code": "CA",
          "name": "Canada",
          "region": {
            "id": 5,
            "name": "North America"
          }
        },
        "timezone": "America/Toronto",
        "latitude": "43.70011",
        "longitude": "-79.41630"
      }
    ],
    "countries": [
      {
        "code": "CA",
        "name": "Canada",
        "region": {
          "id": 5,
          "name": "North America"
        }
      }
    ],
    "regions": [
      {
        "id": 5,
        "name": "North America"
      }
    ],
    "has_remote": false,
    "published": "2024-04-08T14:31:49.535000Z",
    "description": "<h3>Company Description</h3><p>The University Health Network, where “above all else the needs of patients come first”, encompasses Toronto General Hospital, Toronto Western Hospital, Princess Margaret Cancer Centre, Toronto Rehabilitation Institute and the Michener Institute of Education. The breadth of research, the complexity of the cases treated, and the magnitude of its educational enterprise has made UHN a national and international resource for patient care, research and education. With a long tradition of ground breaking firsts and a purpose of “Transforming lives and communities through excellence in care, discovery and learning”, the University Health Network (UHN), Canada’s largest research teaching hospital, brings together over 16,000 employees, more than 1,200 physicians, 8,000+ students, and many volunteers. UHN is a caring, creative place where amazing people are amazing the world. </p><h3>Job Description</h3><p><strong>Union: </strong>ONA<br/>\n<strong>Site: </strong>Princess Margaret Cancer Centre <br/>\n<strong>Department: </strong>BMT / Allogeneic Transplant 14B/C<br/>\n<strong>Reports to: </strong>Nurse Manager<br/>\n<strong>Work Model: </strong>On-Site<br/>\n<strong>Grade:</strong> PU4 <br/>\n<strong>Hours: </strong>0.50FTE <br/>\n<strong>Salary: </strong>$39.07 - 56.00 per hour (start rate is non-negotiable and determined in accordance with collective agreement requirements)<br/>\n<strong>Shifts: </strong>Days/Nights<br/>\n<strong>Status: </strong>Permanent Part-Time <br/>\n<strong>Closing Date: </strong>April 21, 2024</p><p><strong>Position Summary</strong></p><p>The Princess Margaret Cancer Centre has 12 site groups and 26 specialty clinics, and almost 3,000 staff who see over 400,000 patient visits every year. Its 800,000 square feet house 130 inpatient beds, 373,000 square feet of research space and 17 radiation treatment machines, making it one of the largest comprehensive cancer treatment facilities in the world and the largest radiation treatment centre in Canada. <a href=\"http://www.uhn.ca/corporate/AboutUHN/Purpose_Performance/Pages/purpose_values_principles.aspx\">Find out about our purpose, values and principles here</a>.</p><p>Our team on the Hans Messner Allogeneic Blood &amp; Marrow Transplant Units (14B and 14C) provide care to patients who require a stem cell transplant from a related, haploidentical or unrelated donor. The Messner Allogenic Blood &amp; Marrow Transplant (BMT) program, established in 1976, is one of the largest stem cell transplant facilities in North America and ranks amongst the top in the world. The Messner Allogenic Blood &amp; Marrow Transplant service has international recognition for some of the longest surviving patients and for being the first to perform allogenic stem cell transplants as well as transplants with unrelated donors in Canada.</p><p>As a member of the UHN and the Nursing and Interdisciplinary Teams, the REGISTERED NURSE practices in accordance with relevant legislation/standards, meeting the legal and ethical requirements of the profession.</p><p><strong>Duties</strong></p><ul><li>Applying knowledge of nursing science, theory, skill and critical decision making in the provision of compassionate, collaborative and competent care in accordance with the UHN Professional Practice Model for Nursing and the mission and vision of nursing at the UHN;</li><li>Ensuring practice is consistent with professional standards and the ethical framework as outlined by the College of Nurses of Ontario and the UHN policy and procedure;</li><li>Demonstrating commitment to professional life long learning by participating in continuing education activities to meet the needs of the patient population served and the standards of the profession;</li><li>Performing reflective practice, analyzing and evaluating nursing knowledge and modifying practice accordingly to improve the quality of nursing and patient care;</li><li>Performing cross-functional and other responsibilities, as assigned and/or requested.</li><li>The successful candidate will bring a commitment to Primary Nursing Care as the care delivery model.</li></ul><h3>Qualifications</h3><ul><li>Current Registration as a Registered Nurse with the College of Nurses of Ontario required</li><li>Basic Cardiac Life Support (BCLS) program required</li><li>Chemotherapy certification and experience in the care of the client with oncologic disorders required</li><li>Blood and marrow transplant experience preferred</li><li>Excellent verbal and written communication skills</li><li>Evidence of cooperative and facilitative relationships when working with all interdisciplinary and direct care team members</li><li>Evidence of commitment to team building and working within a patient focused care model</li><li>Ability to function independently</li><li>Strong problem solving skills</li><li>Evidence of excellent physical assessment skills with the ability to detect changes in patient status</li><li>Evidence of effective psychosocial, and patient/family teaching skills</li><li>Demonstrated knowledge and ability to utilize the nursing process in planning, implementing and evaluating patient care</li><li>Demonstrated leadership/in charge skills and evidence of good organizational and decision making skills</li><li>Evidence of commitment to self-directed learning</li><li>Oncology certification and BMT certification preferred</li><li>Bachelor of Science in Nursing preferred</li></ul><h3>Additional Information</h3><p><strong>Why join UHN?</strong></p><p>In addition to working alongside some of the most talented and inspiring healthcare professionals in the world, UHN offers a wide range of benefits, programs and perks. It is the comprehensiveness of these offerings that makes it a differentiating factor, allowing you to find value where it matters most to you, now and throughout your career at UHN.</p><ul><li>Competitive offer packages</li><li>Government organization and a member of the Healthcare of Ontario Pension Plan (HOOPP <a href=\"https://hoopp.com/\">https://hoopp.com/</a>)</li><li>Close access to Transit and UHN shuttle service</li><li>A flexible work environment</li><li>Opportunities for development and promotions within a large organization</li><li>Additional perks (multiple corporate discounts including: travel, restaurants, parking, phone plans, auto insurance discounts, on-site gyms, etc.)</li><li>All applications must be submitted before the posting close date.</li></ul><p>All applications must be submitted before the posting close date.</p><p>UHN uses email to communicate with selected candidates.  Please ensure you check your email regularly.</p><p>Please be advised that a Criminal Record Check may be required of the successful candidate. Should it be determined that any information provided by a candidate be misleading, inaccurate or incorrect, UHN reserves the right to discontinue with the consideration of their application.</p><p>All UHN Employees are required to be fully vaccinated with a COVID-19 vaccine series, approved by Health Canada or the World Health Organization, as a condition of hire. Proof of COVID-19 vaccination will be required. Should you be the successful candidate, you will be required to comply with UHN’s mandatory Vaccination Policy that is in effect.</p><p>UHN is an equal opportunity employer committed to an inclusive recruitment process and workplace. Requests for accommodation can be made at any stage of the recruitment process. Applicants need to make their requirements known.</p><p><strong>We thank all applicants for their interest, however, only those selected for further consideration will be contacted.</strong></p>",
    "experience_level": "EN",
    "application_url": "https://jobs.smartrecruiters.com/UniversityHealthNetwork/743999979142609-registered-nurse",
    "language": "en",
    "clearance_required": false,
    "salary_min": null,
    "salary_max": null,
    "salary_currency": null
  },
  {
    "id": 5039511,
    "ext_id": "743999979146340",
    "company": {
      "id": 12423,
      "name": "University Health Network",
      "logo": "https://jobdataapi.com/media/company/logo/23/11/logo_img_WACRRe3.png",
      "website_url": "https://www.UHN.ca",
      "linkedin_url": "https://www.linkedin.com/company/university-health-network",
      "twitter_handle": "UHN",
      "github_url": null
    },
    "title": "Registered Nurse",
    "location": "Toronto, ON, Canada",
    "types": [
      {
        "id": 1,
        "name": "Full Time"
      },
      {
        "id": 2,
        "name": "Part Time"
      }
    ],
    "cities": [
      {
        "geonameid": 6167865,
        "asciiname": "Toronto",
        "name": "Toronto",
        "country": {
          "code": "CA",
          "name": "Canada",
          "region": {
            "id": 5,
            "name": "North America"
          }
        },
        "timezone": "America/Toronto",
        "latitude": "43.70011",
        "longitude": "-79.41630"
      }
    ],
    "countries": [
      {
        "code": "CA",
        "name": "Canada",
        "region": {
          "id": 5,
          "name": "North America"
        }
      }
    ],
    "regions": [
      {
        "id": 5,
        "name": "North America"
      }
    ],
    "has_remote": false,
    "published": "2024-04-08T14:31:26.432000Z",
    "description": "<h3>Company Description</h3><p>The University Health Network, where “above all else the needs of patients come first”, encompasses Toronto General Hospital, Toronto Western Hospital, Princess Margaret Cancer Centre, Toronto Rehabilitation Institute and the Michener Institute of Education. The breadth of research, the complexity of the cases treated, and the magnitude of its educational enterprise has made UHN a national and international resource for patient care, research and education. With a long tradition of ground breaking firsts and a purpose of “Transforming lives and communities through excellence in care, discovery and learning”, the University Health Network (UHN), Canada’s largest research teaching hospital, brings together over 16,000 employees, more than 1,200 physicians, 8,000+ students, and many volunteers. UHN is a caring, creative place where amazing people are amazing the world. </p><h3>Job Description</h3><p><strong>Union: </strong>ONA <br/>\n<strong>Site: </strong>Princess Margaret Cancer Centre<br/>\n<strong>Department:</strong> BMT / Allogeneic Transplant 14B/C<br/>\n<strong>Reports to:</strong> Nurse Manager<br/>\n<strong>Work Model: </strong>On-Site<br/>\n<strong>Grade: </strong>PU4<br/>\n<strong>Hours:</strong> 0.50 FTE<br/>\n<strong>Salary: </strong>$39.07 - 56.00 per hour (start rate is non-negotiable and in accordance with collective agreement requirements)<br/>\n<strong>Shifts:</strong> Days/Nights<br/>\n<strong>Status:</strong> Permanent Part-Time<br/>\n<strong>Closing Date:</strong> April 21, 2024</p><p><strong>Position Summary</strong></p><p>The Princess Margaret Cancer Centre has 12 site groups and 26 specialty clinics, and almost 3,000 staff who see over 400,000 patient visits every year. Its 800,000 square feet house 130 inpatient beds, 373,000 square feet of research space and 17 radiation treatment machines, making it one of the largest comprehensive cancer treatment facilities in the world and the largest radiation treatment centre in Canada. <a href=\"http://www.uhn.ca/corporate/AboutUHN/Purpose_Performance/Pages/purpose_values_principles.aspx\">Find out about our purpose, values and principles here</a>.</p><p>Our team on the Hans Messner Allogeneic Blood &amp; Marrow Transplant Units (14B and 14C) provide care to patients who require a stem cell transplant from a related, haploidentical or unrelated donor. The Messner Allogenic Blood &amp; Marrow Transplant (BMT) program, established in 1976, is one of the largest stem cell transplant facilities in North America and ranks amongst the top in the world. The Messner Allogenic Blood &amp; Marrow Transplant service has international recognition for some of the longest surviving patients and for being the first to perform allogenic stem cell transplants as well as transplants with unrelated donors in Canada.</p><p>As a member of the UHN and the Nursing and Interdisciplinary Teams, the REGISTERED NURSE practices in accordance with relevant legislation/standards, meeting the legal and ethical requirements of the profession.</p><p><strong>Duties</strong></p><ul><li>Applying knowledge of nursing science, theory, skill and critical decision making in the provision of compassionate, collaborative and competent care in accordance with the UHN Professional Practice Model for Nursing and the mission and vision of nursing at the UHN;</li><li>Ensuring practice is consistent with professional standards and the ethical framework as outlined by the College of Nurses of Ontario and the UHN policy and procedure;</li><li>Demonstrating commitment to professional life long learning by participating in continuing education activities to meet the needs of the patient population served and the standards of the profession;</li><li>Performing reflective practice, analyzing and evaluating nursing knowledge and modifying practice accordingly to improve the quality of nursing and patient care;</li><li>Performing cross-functional and other responsibilities, as assigned and/or requested.</li><li>The successful candidate will bring a commitment to Primary Nursing Care as the care delivery model.</li></ul><h3>Qualifications</h3><ul><li>Current Registration as a Registered Nurse with the College of Nurses of Ontario required</li><li>Basic Cardiac Life Support (BCLS) program required</li><li>Chemotherapy certification and experience in the care of the client with oncologic disorders required</li><li>Blood and marrow transplant experience preferred</li><li>Excellent verbal and written communication skills</li><li>Evidence of cooperative and facilitative relationships when working with all interdisciplinary and direct care team members</li><li>Evidence of commitment to team building and working within a patient focused care model</li><li>Ability to function independently</li><li>Strong problem solving skills</li><li>Evidence of excellent physical assessment skills with the ability to detect changes in patient status</li><li>Evidence of effective psychosocial, and patient/family teaching skills</li><li>Demonstrated knowledge and ability to utilize the nursing process in planning, implementing and evaluating patient care</li><li>Demonstrated leadership/in charge skills and evidence of good organizational and decision making skills</li><li>Evidence of commitment to self-directed learning</li><li>Oncology certification and BMT certification preferred</li><li>Bachelor of Science in Nursing preferred</li></ul><h3>Additional Information</h3><p><strong>Why join UHN?</strong></p><p>In addition to working alongside some of the most talented and inspiring healthcare professionals in the world, UHN offers a wide range of benefits, programs and perks. It is the comprehensiveness of these offerings that makes it a differentiating factor, allowing you to find value where it matters most to you, now and throughout your career at UHN.</p><ul><li>Competitive offer packages</li><li>Government organization and a member of the Healthcare of Ontario Pension Plan (HOOPP <a href=\"https://hoopp.com/\">https://hoopp.com/</a>)</li><li>Close access to Transit and UHN shuttle service</li><li>A flexible work environment</li><li>Opportunities for development and promotions within a large organization</li><li>Additional perks (multiple corporate discounts including: travel, restaurants, parking, phone plans, auto insurance discounts, on-site gyms, etc.)</li><li>All applications must be submitted before the posting close date.</li></ul><p>All applications must be submitted before the posting close date.</p><p>UHN uses email to communicate with selected candidates.  Please ensure you check your email regularly.</p><p>Please be advised that a Criminal Record Check may be required of the successful candidate. Should it be determined that any information provided by a candidate be misleading, inaccurate or incorrect, UHN reserves the right to discontinue with the consideration of their application.</p><p>All UHN Employees are required to be fully vaccinated with a COVID-19 vaccine series, approved by Health Canada or the World Health Organization, as a condition of hire. Proof of COVID-19 vaccination will be required. Should you be the successful candidate, you will be required to comply with UHN’s mandatory Vaccination Policy that is in effect.</p><p>UHN is an equal opportunity employer committed to an inclusive recruitment process and workplace. Requests for accommodation can be made at any stage of the recruitment process. Applicants need to make their requirements known.</p><p><strong>We thank all applicants for their interest, however, only those selected for further consideration will be contacted.</strong></p>",
    "experience_level": "EN",
    "application_url": "https://jobs.smartrecruiters.com/UniversityHealthNetwork/743999979146340-registered-nurse",
    "language": "en",
    "clearance_required": false,
    "salary_min": null,
    "salary_max": null,
    "salary_currency": null
  },
  {
    "id": 5039512,
    "ext_id": "743999979147173",
    "company": {
      "id": 12423,
      "name": "University Health Network",
      "logo": "https://jobdataapi.com/media/company/logo/23/11/logo_img_WACRRe3.png",
      "website_url": "https://www.UHN.ca",
      "linkedin_url": "https://www.linkedin.com/company/university-health-network",
      "twitter_handle": "UHN",
      "github_url": null
    },
    "title": "Registered Nurse",
    "location": "Toronto, ON, Canada",
    "types": [
      {
        "id": 1,
        "name": "Full Time"
      },
      {
        "id": 2,
        "name": "Part Time"
      }
    ],
    "cities": [
      {
        "geonameid": 6167865,
        "asciiname": "Toronto",
        "name": "Toronto",
        "country": {
          "code": "CA",
          "name": "Canada",
          "region": {
            "id": 5,
            "name": "North America"
          }
        },
        "timezone": "America/Toronto",
        "latitude": "43.70011",
        "longitude": "-79.41630"
      }
    ],
    "countries": [
      {
        "code": "CA",
        "name": "Canada",
        "region": {
          "id": 5,
          "name": "North America"
        }
      }
    ],
    "regions": [
      {
        "id": 5,
        "name": "North America"
      }
    ],
    "has_remote": false,
    "published": "2024-04-08T14:30:36.072000Z",
    "description": "<h3>Company Description</h3><p>The University Health Network, where “above all else the needs of patients come first”, encompasses Toronto General Hospital, Toronto Western Hospital, Princess Margaret Cancer Centre, Toronto Rehabilitation Institute and the Michener Institute of Education. The breadth of research, the complexity of the cases treated, and the magnitude of its educational enterprise has made UHN a national and international resource for patient care, research and education. With a long tradition of ground breaking firsts and a purpose of “Transforming lives and communities through excellence in care, discovery and learning”, the University Health Network (UHN), Canada’s largest research teaching hospital, brings together over 16,000 employees, more than 1,200 physicians, 8,000+ students, and many volunteers. UHN is a caring, creative place where amazing people are amazing the world. </p><h3>Job Description</h3><p><strong>Union:</strong> ONA<br/>\n<strong>Site:</strong> Princess Margaret Hospital<br/>\n<strong>Department:</strong> 14A Inpatient Malignant Hematology<br/>\n<strong>Reports to: </strong>Nurse Manager<br/>\n<strong>Work Model:</strong> On-Site <br/>\n<strong>Grade: </strong>PU4<br/>\n<strong>Hours:</strong> 0.6 FTE<br/>\n<strong>Salary:</strong> $39.07 - 56.00 per hour (start rate is non-negotiable and determined in accordance with collective agreement requirements)<br/>\n<strong>Shifts:</strong> Day/Nights<br/>\n<strong>Status:</strong> Permanent Part Time<br/>\n<strong>Closed Date:</strong> April 21, 2024</p><p><strong>Position Summary</strong></p><p>As a member multi-disciplinary Team, the REGISTERED NURSE practices in accordance with relevant legislation/standards, the UHN Professional Practice Model and the mission and vision of nursing at the UHN to provide compassionate, collaborative and competent care, while meeting the legal and ethical requirements of the profession. </p><p><strong>Duties</strong></p><ul><li>Applying knowledge of nursing science, theory, skill and critical decision making in the provision of compassionate, collaborative and competent care in accordance with the UHN Professional Practice Model for Nursing and the mission and vision of nursing at the UHN.</li><li>Ensuring practice is consistent with professional standards and the ethical framework as outlined by the College of Nurses of Ontario and the UHN policy and procedure.</li><li>Demonstrating commitment to professional life long learning by participating in continuing education activities to meet the needs of the patient population served and the standards of the profession.</li><li>Performing reflective practice, analyzing and evaluating nursing knowledge and modifying practice accordingly to improve the quality of nursing and patient care.</li><li>Performing cross-functional and other responsibilities, as assigned and/or requested.</li></ul><h3>Qualifications</h3><ul><li>Current Registration with the College of Nurses of Ontario required</li><li>Basic Cardiac Life Support Certification required</li><li>Flexible and able to work effectively and efficiently within a interdisciplinary patient care team</li><li>Must be able to meet the physical requirements of the position</li><li>Excellent interpersonal, communication and decision making skills</li><li>Excellent organizational and time management skills</li><li>Excellent computer skills</li><li>BScN degree preferred</li></ul><h3>Additional Information</h3><p>In addition to working alongside some of the most talented and inspiring healthcare professionals in the world, UHN offers a wide range of benefits, programs and perks. It is the comprehensiveness of these offerings that makes it a differentiating factor, allowing you to find value where it matters most to you, now and throughout your career at UHN.</p><ul><li>Competitive compensation &amp; benefits (medical, dental, etc.)</li><li>HOOPP defined benefit pension plan</li><li>Wellness services &amp; offerings</li><li>Close access to the TTC and UHN shuttle service</li><li>Opportunities for development and promotions within a large organization</li><li>Additional perks (multiple corporate discounts including: travel, restaurants, parking, phone plans, auto insurance discounts, on-site gyms, etc.)</li></ul><p>All applications must be submitted before the posting close date.</p><p>UHN uses email to communicate with selected candidates.  Please ensure you check your email regularly.</p><p>Please be advised that a Criminal Record Check may be required of the successful candidate. Should it be determined that any information provided by a candidate be misleading, inaccurate or incorrect, UHN reserves the right to discontinue with the consideration of their application.</p><p>All UHN Employees are required to be fully vaccinated with a COVID-19 vaccine series, approved by Health Canada or the World Health Organization, as a condition of hire. Proof of COVID-19 vaccination will be required. Should you be the successful candidate, you will be required to comply with UHN’s mandatory Vaccination Policy that is in effect.</p><p>UHN is an equal opportunity employer committed to an inclusive recruitment process and workplace. Requests for accommodation can be made at any stage of the recruitment process. Applicants need to make their requirements known.</p><p><strong>We thank all applicants for their interest, however, only those selected for further consideration will be contacted.</strong></p>",
    "experience_level": null,
    "application_url": "https://jobs.smartrecruiters.com/UniversityHealthNetwork/743999979147173-registered-nurse",
    "language": "en",
    "clearance_required": false,
    "salary_min": null,
    "salary_max": null,
    "salary_currency": null
  }
]
